id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
version: 1.0
date: '2018-02-26'
name: Get Authentication Logs For Endpoint
description: This search returns all users that have attempted to access a particular
  endpoint.
author: Bhavin Patel, Splunk
inputs: 
  - dest
search: '| tstats count from datamodel=Authentication where Authentication.dest={dest}
      by _time, Authentication.dest, Authentication.user, Authentication.app, Authentication.action
      | `drop_dm_object_name("Authentication")`'