name: Windows Event Log Security 4768
id: 4a5fd6ed-66bd-4f34-bc74-51c00c73c298
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4768
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- Channel
- Computer
- Error_Code
- EventCode
- EventData_Xml
- EventID
- EventRecordID
- Guid
- IpAddress
- IpPort
- Keywords
- Level
- Name
- Opcode
- PreAuthType
- ProcessID
- RecordNumber
- ServiceName
- ServiceSid
- Source_Port
- Source_Workstation
- Status
- SystemTime
- System_Props_Xml
- TargetDomainName
- TargetSid
- TargetUserName
- Target_Domain
- Target_User_Name
- Task
- ThreadID
- TicketEncryptionType
- TicketOptions
- Version
- action
- app
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- name
- product
- punct
- service
- service_id
- service_name
- signature
- signature_id
- source
- sourcetype
- splunk_server
- src
- src_ip
- src_nt_host
- src_port
- status
- subject
- ta_windows_action
- ta_windows_status
- tag
- tag::action
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group
- vendor
- vendor_product
example_log: <Event xmlns='http://schemas.microsoft.com/win/2004/08/events/event'><System><Provider
  Name='Microsoft-Windows-Security-Auditing' Guid='{54849625-5478-4994-A5BA-3E3B0328C30D}'/><EventID>4768</EventID><Version>0</Version><Level>0</Level><Task>14339</Task><Opcode>0</Opcode><Keywords>0x8010000000000000</Keywords><TimeCreated
  SystemTime='2022-09-08T18:16:25.601071000Z'/><EventRecordID>391562</EventRecordID><Correlation/><Execution
  ProcessID='644' ThreadID='3500'/><Channel>Security</Channel><Computer>win-dc-mvelazco-02713-392.attackrange.local</Computer><Security/></System><EventData><Data
  Name='TargetUserName'>RXETPKZH</Data><Data Name='TargetDomainName'>attackrange.local</Data><Data
  Name='TargetSid'>NULL SID</Data><Data Name='ServiceName'>krbtgt/attackrange.local</Data><Data
  Name='ServiceSid'>NULL SID</Data><Data Name='TicketOptions'>0x40810010</Data><Data
  Name='Status'>0x12</Data><Data Name='TicketEncryptionType'>0xffffffff</Data><Data
  Name='PreAuthType'>-</Data><Data Name='IpAddress'>::ffff:10.0.1.15</Data><Data Name='IpPort'>64568</Data><Data
  Name='CertIssuerName'></Data><Data Name='CertSerialNumber'></Data><Data Name='CertThumbprint'></Data></EventData></Event>
