name: Windows Event Log Security 4769
id: 358d5520-f40b-4fa2-b799-966c030cb731
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4769
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- Channel
- Computer
- Error_Code
- EventCode
- EventData_Xml
- EventID
- EventRecordID
- Guid
- IpAddress
- IpPort
- Keywords
- Level
- LogonGuid
- Name
- Opcode
- ProcessID
- RecordNumber
- ServiceName
- ServiceSid
- Source_Port
- Source_Workstation
- Status
- SystemTime
- System_Props_Xml
- TargetDomainName
- TargetUserName
- Target_Domain
- Target_User_Name
- Task
- ThreadID
- TicketEncryptionType
- TicketOptions
- TransmittedServices
- Version
- action
- app
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- name
- product
- punct
- service
- service_id
- service_name
- signature
- signature_id
- source
- sourcetype
- splunk_server
- src
- src_ip
- src_nt_host
- src_port
- status
- subject
- ta_windows_action
- ta_windows_status
- tag
- tag::action
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group
- vendor
- vendor_product
example_log: <Event xmlns='http://schemas.microsoft.com/win/2004/08/events/event'><System><Provider
  Name='Microsoft-Windows-Security-Auditing' Guid='{54849625-5478-4994-a5ba-3e3b0328c30d}'/><EventID>4769</EventID><Version>0</Version><Level>0</Level><Task>14337</Task><Opcode>0</Opcode><Keywords>0x8020000000000000</Keywords><TimeCreated
  SystemTime='2024-04-09T01:00:49.143003800Z'/><EventRecordID>148521</EventRecordID><Correlation/><Execution
  ProcessID='636' ThreadID='1776'/><Channel>Security</Channel><Computer>ar-win-dc.attackrange.local</Computer><Security/></System><EventData><Data
  Name='TargetUserName'>AR-WIN-2$@ATTACKRANGE.LOCAL</Data><Data Name='TargetDomainName'>ATTACKRANGE.LOCAL</Data><Data
  Name='ServiceName'>AR-WIN-2$</Data><Data Name='ServiceSid'>ATTACKRANGE\AR-WIN-2$</Data><Data
  Name='TicketOptions'>0x40810000</Data><Data Name='TicketEncryptionType'>0x17</Data><Data
  Name='IpAddress'>::ffff:10.0.1.15</Data><Data Name='IpPort'>59191</Data><Data Name='Status'>0x0</Data><Data
  Name='LogonGuid'>{3b4ad75b-7184-6094-b975-ea3f91932ee0}</Data><Data Name='TransmittedServices'>-</Data></EventData></Event>
