name: Windows Event Log Security 4627
id: e35c7b9a-b451-4084-95a5-43b7f8965cac
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4627
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- ActivityID
- Caller_Domain
- Caller_User_Name
- Channel
- Computer
- Error_Code
- EventCode
- EventCountTotal
- EventData_Xml
- EventID
- EventIdx
- EventRecordID
- GroupMembership
- Guid
- Keywords
- Level
- LogonType
- Logon_ID
- Logon_Type
- Name
- Opcode
- ProcessID
- RecordNumber
- SubjectDomainName
- SubjectLogonId
- SubjectUserName
- SubjectUserSid
- SystemTime
- System_Props_Xml
- TargetDomainName
- TargetLogonId
- TargetUserName
- TargetUserSid
- Target_Domain
- Target_User_Name
- Task
- ThreadID
- Version
- action
- app
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- product
- punct
- session_id
- signature_id
- source
- sourcetype
- splunk_server
- status
- ta_windows_action
- tag
- tag::action
- tag::app
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group
- vendor
- vendor_product
example_log: <Event xmlns='http://schemas.microsoft.com/win/2004/08/events/event'><System><Provider
  Name='Microsoft-Windows-Security-Auditing' Guid='{54849625-5478-4994-a5ba-3e3b0328c30d}'/><EventID>4627</EventID><Version>0</Version><Level>0</Level><Task>12554</Task><Opcode>0</Opcode><Keywords>0x8020000000000000</Keywords><TimeCreated
  SystemTime='2023-10-05T20:02:43.026235200Z'/><EventRecordID>186260</EventRecordID><Correlation
  ActivityID='{58660170-f720-0003-8b01-665820f7d901}'/><Execution ProcessID='620'
  ThreadID='4580'/><Channel>Security</Channel><Computer>ar-win-dc.attackrange.local</Computer><Security/></System><EventData><Data
  Name='SubjectUserSid'>S-1-0-0</Data><Data Name='SubjectUserName'>-</Data><Data Name='SubjectDomainName'>-</Data><Data
  Name='SubjectLogonId'>0x0</Data><Data Name='TargetUserSid'>S-1-5-21-2442966654-584408786-1775486684-1115</Data><Data
  Name='TargetUserName'>lowpriv</Data><Data Name='TargetDomainName'>ATTACKRANGE.LOCAL</Data><Data
  Name='TargetLogonId'>0x1094dbc</Data><Data Name='LogonType'>3</Data><Data Name='EventIdx'>1</Data><Data
  Name='EventCountTotal'>1</Data><Data Name='GroupMembership'>
