name: Windows Event Log Security 4648
id: 6a367f8b-1ee0-463d-94a7-029757c6cd02
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4648
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- ActivityID
- Caller_Domain
- Caller_User_Name
- Channel
- Computer
- Error_Code
- EventCode
- EventData_Xml
- EventID
- EventRecordID
- Guid
- IpAddress
- IpPort
- Keywords
- Level
- LogonGuid
- Logon_ID
- Name
- Opcode
- ProcessID
- ProcessId
- RecordNumber
- Source_Port
- Source_Workstation
- SubjectDomainName
- SubjectLogonId
- SubjectUserName
- SubjectUserSid
- SystemTime
- System_Props_Xml
- TargetDomainName
- TargetInfo
- TargetLogonGuid
- TargetServerName
- TargetUserName
- Target_Domain
- Target_Server_Name
- Target_User_Name
- Task
- ThreadID
- Version
- action
- app
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dest_nt_host
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- name
- process_id
- product
- punct
- session_id
- signature
- signature_id
- source
- sourcetype
- splunk_server
- src
- src_ip
- src_nt_domain
- src_nt_host
- src_port
- src_user
- status
- subject
- ta_windows_action
- tag
- tag::action
- tag::app
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group
- vendor
- vendor_product
example_log: <Event xmlns='http://schemas.microsoft.com/win/2004/08/events/event'><System><Provider
  Name='Microsoft-Windows-Security-Auditing' Guid='{54849625-5478-4994-A5BA-3E3B0328C30D}'/><EventID>4648</EventID><Version>0</Version><Level>0</Level><Task>12544</Task><Opcode>0</Opcode><Keywords>0x8020000000000000</Keywords><TimeCreated
  SystemTime='2022-09-08T21:33:47.813673700Z'/><EventRecordID>336567</EventRecordID><Correlation
  ActivityID='{61CE8B0D-C305-0002-148B-CE6105C3D801}'/><Execution ProcessID='644'
  ThreadID='4476'/><Channel>Security</Channel><Computer>win-host-mvelazco-02713-447.attackrange.local</Computer><Security/></System><EventData><Data
  Name='SubjectUserSid'>ATTACKRANGE\REED_LARSEN</Data><Data Name='SubjectUserName'>reed_larsen</Data><Data
  Name='SubjectDomainName'>ATTACKRANGE</Data><Data Name='SubjectLogonId'>0x1360f2</Data><Data
  Name='LogonGuid'>{00000000-0000-0000-0000-000000000000}</Data><Data Name='TargetUserName'>STEVE_BRADFORD</Data><Data
  Name='TargetDomainName'>attackrange.local</Data><Data Name='TargetLogonGuid'>{00000000-0000-0000-0000-000000000000}</Data><Data
  Name='TargetServerName'>win-dc-mvelazco-02713-392.attackrange.local</Data><Data
  Name='TargetInfo'>win-dc-mvelazco-02713-392.attackrange.local</Data><Data Name='ProcessId'>0x4</Data><Data
  Name='ProcessName'></Data><Data Name='IpAddress'>10.0.1.14</Data><Data Name='IpPort'>445</Data></EventData></Event>
