name: Windows Event Log Security 4738
id: cb85709b-101e-41a9-bb60-d2108f79dfbd
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4738
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- AccountExpires
- AllowedToDelegateTo
- Caller_Domain
- Caller_User_Name
- CategoryString
- Channel
- Computer
- DisplayName
- Dummy
- Error_Code
- EventCode
- EventData_Xml
- EventID
- EventRecordID
- Guid
- HomeDirectory
- HomePath
- Keywords
- Level
- LogonHours
- Logon_ID
- Name
- NewUacValue
- OldUacValue
- Opcode
- PasswordLastSet
- PrimaryGroupId
- PrivilegeList
- ProcessID
- ProfilePath
- RecordNumber
- SamAccountName
- ScriptPath
- SidHistory
- SubjectDomainName
- SubjectLogonId
- SubjectUserName
- SubjectUserSid
- SystemTime
- System_Props_Xml
- TargetDomainName
- TargetSid
- TargetUserName
- Target_Domain
- Target_User_Name
- Task
- ThreadID
- UserAccountControl
- UserParameters
- UserPrincipalName
- UserWorkstations
- Version
- action
- app
- change_type
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- name
- object
- object_attrs
- object_category
- object_id
- product
- punct
- result
- session_id
- signature
- signature_id
- source
- sourcetype
- splunk_server
- src_nt_domain
- src_user
- src_user_name
- status
- subject
- ta_windows_action
- ta_windows_security_CategoryString
- tag
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group
- user_name
- vendor
- vendor_product
example_log: <Event xmlns='http://schemas.microsoft.com/win/2004/08/events/event'><System><Provider
  Name='Microsoft-Windows-Security-Auditing' Guid='{54849625-5478-4994-A5BA-3E3B0328C30D}'/><EventID>4738</EventID><Version>0</Version><Level>0</Level><Task>13824</Task><Opcode>0</Opcode><Keywords>0x8020000000000000</Keywords><TimeCreated
  SystemTime='2022-11-17T03:25:57.674067800Z'/><EventRecordID>6389713</EventRecordID><Correlation/><Execution
  ProcessID='640' ThreadID='1800'/><Channel>Security</Channel><Computer>ar-win-dc.attackrange.local</Computer><Security/></System><EventData><Data
  Name='Dummy'>-</Data><Data Name='TargetUserName'>unpriv</Data><Data Name='TargetDomainName'>ATTACKRANGE</Data><Data
  Name='TargetSid'>S-1-5-21-945660386-2529346225-2932127451-1112</Data><Data Name='SubjectUserSid'>S-1-5-21-945660386-2529346225-2932127451-500</Data><Data
  Name='SubjectUserName'>Administrator</Data><Data Name='SubjectDomainName'>ATTACKRANGE</Data><Data
  Name='SubjectLogonId'>0x54bb3a</Data><Data Name='PrivilegeList'>-</Data><Data Name='SamAccountName'>-</Data><Data
  Name='DisplayName'>-</Data><Data Name='UserPrincipalName'>-</Data><Data Name='HomeDirectory'>-</Data><Data
  Name='HomePath'>-</Data><Data Name='ScriptPath'>-</Data><Data Name='ProfilePath'>-</Data><Data
  Name='UserWorkstations'>-</Data><Data Name='PasswordLastSet'>-</Data><Data Name='AccountExpires'>-</Data><Data
  Name='PrimaryGroupId'>-</Data><Data Name='AllowedToDelegateTo'>-</Data><Data Name='OldUacValue'>-</Data><Data
  Name='NewUacValue'>-</Data><Data Name='UserAccountControl'>-</Data><Data Name='UserParameters'>-</Data><Data
  Name='SidHistory'>
