name: Windows Event Log Security 4624
id: 08682968-0366-4882-9559-fe4fe018a846
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4624
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- ActivityID
- AuthenticationPackageName
- Caller_Domain
- Caller_User_Name
- Channel
- Computer
- ElevatedToken
- Error_Code
- EventCode
- EventData_Xml
- EventID
- EventRecordID
- Guid
- ImpersonationLevel
- IpAddress
- IpPort
- KeyLength
- Keywords
- Level
- LmPackageName
- LogonGuid
- LogonProcessName
- LogonType
- Logon_ID
- Logon_Type
- Name
- Opcode
- ProcessID
- ProcessId
- ProcessName
- RecordNumber
- RestrictedAdminMode
- Source_Port
- Source_Workstation
- SubjectDomainName
- SubjectLogonId
- SubjectUserName
- SubjectUserSid
- SystemTime
- System_Props_Xml
- TargetDomainName
- TargetLinkedLogonId
- TargetLogonId
- TargetOutboundDomainName
- TargetOutboundUserName
- TargetUserName
- TargetUserSid
- Target_Domain
- Target_User_Name
- Task
- ThreadID
- TransmittedServices
- Version
- VirtualAccount
- WorkstationName
- action
- app
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- name
- process
- process_id
- process_name
- process_path
- product
- punct
- session_id
- signature
- signature_id
- source
- sourcetype
- splunk_server
- src_ip
- src_port
- status
- subject
- ta_windows_action
- tag
- tag::action
- tag::app
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group
- vendor
- vendor_product
example_log: <Event xmlns='http://schemas.microsoft.com/win/2004/08/events/event'><System><Provider
  Name='Microsoft-Windows-Security-Auditing' Guid='{54849625-5478-4994-A5BA-3E3B0328C30D}'/><EventID>4624</EventID><Version>2</Version><Level>0</Level><Task>12544</Task><Opcode>0</Opcode><Keywords>0x8020000000000000</Keywords><TimeCreated
  SystemTime='2023-03-23T19:15:28.337312500Z'/><EventRecordID>371886</EventRecordID><Correlation
  ActivityID='{64015806-5D92-0000-1258-0164925DD901}'/><Execution ProcessID='596'
  ThreadID='2428'/><Channel>Security</Channel><Computer>ar-win-7.attackrange.local</Computer><Security/></System><EventData><Data
  Name='SubjectUserSid'>NULL SID</Data><Data Name='SubjectUserName'>-</Data><Data
  Name='SubjectDomainName'>-</Data><Data Name='SubjectLogonId'>0x0</Data><Data Name='TargetUserSid'>ATTACKRANGE\ELMER_SALAS</Data><Data
  Name='TargetUserName'>ELMER_SALAS</Data><Data Name='TargetDomainName'>ATTACKRANGE.LOCAL</Data><Data
  Name='TargetLogonId'>0x693ef4</Data><Data Name='LogonType'>3</Data><Data Name='LogonProcessName'>Kerberos</Data><Data
  Name='AuthenticationPackageName'>Kerberos</Data><Data Name='WorkstationName'>-</Data><Data
  Name='LogonGuid'>{139F7D70-0163-38CC-676D-00AE04A0F19C}</Data><Data Name='TransmittedServices'>-</Data><Data
  Name='LmPackageName'>-</Data><Data Name='KeyLength'>0</Data><Data Name='ProcessId'>0x0</Data><Data
  Name='ProcessName'>-</Data><Data Name='IpAddress'>10.0.1.16</Data><Data Name='IpPort'>49980</Data><Data
  Name='ImpersonationLevel'>%%1833</Data><Data Name='RestrictedAdminMode'>-</Data><Data
  Name='TargetOutboundUserName'>-</Data><Data Name='TargetOutboundDomainName'>-</Data><Data
  Name='VirtualAccount'>%%1843</Data><Data Name='TargetLinkedLogonId'>0x0</Data><Data
  Name='ElevatedToken'>%%1843</Data></EventData></Event>
