name: Windows Event Log Security 4781
id: 9732ffe7-ebce-4557-865c-1725a0f633cb
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4781
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- ActivityID
- Caller_Domain
- Caller_User_Name
- CategoryString
- Channel
- Computer
- Error_Code
- EventCode
- EventData_Xml
- EventID
- EventRecordID
- Guid
- Keywords
- Level
- Logon_ID
- Name
- NewTargetUserName
- OldTargetUserName
- Opcode
- PrivilegeList
- ProcessID
- RecordNumber
- SubjectDomainName
- SubjectLogonId
- SubjectUserName
- SubjectUserSid
- SystemTime
- System_Props_Xml
- TargetDomainName
- TargetSid
- Target_Domain
- Task
- ThreadID
- Version
- action
- app
- change_type
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- name
- object
- object_attrs
- object_category
- object_id
- product
- punct
- result
- session_id
- signature
- signature_id
- source
- sourcetype
- splunk_server
- src_nt_domain
- src_user
- src_user_name
- status
- subject
- ta_windows_action
- ta_windows_security_CategoryString
- tag
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_name
- vendor
- vendor_product
example_log: <Event xmlns='http://schemas.microsoft.com/win/2004/08/events/event'><System><Provider
  Name='Microsoft-Windows-Security-Auditing' Guid='{54849625-5478-4994-a5ba-3e3b0328c30d}'/><EventID>4781</EventID><Version>0</Version><Level>0</Level><Task>13824</Task><Opcode>0</Opcode><Keywords>0x8020000000000000</Keywords><TimeCreated
  SystemTime='2024-04-09T22:22:45.521723900Z'/><EventRecordID>148763</EventRecordID><Correlation
  ActivityID='{b05ffbda-8ac8-0003-e6fb-5fb0c88ada01}'/><Execution ProcessID='620'
  ThreadID='3936'/><Channel>Security</Channel><Computer>ar-win-dc.attackrange.local</Computer><Security/></System><EventData><Data
  Name='OldTargetUserName'>AR-WIN-2$</Data><Data Name='NewTargetUserName'>Administrator</Data><Data
  Name='TargetDomainName'>ATTACKRANGE</Data><Data Name='TargetSid'>ATTACKRANGE\AR-WIN-2$</Data><Data
  Name='SubjectUserSid'>ATTACKRANGE\Administrator</Data><Data Name='SubjectUserName'>Administrator</Data><Data
  Name='SubjectDomainName'>ATTACKRANGE</Data><Data Name='SubjectLogonId'>0x141a04</Data><Data
  Name='PrivilegeList'>-</Data></EventData></Event>
