name: Windows Event Log Security 4732
id: b0d61c5d-aefe-486a-9152-de45cc10fbb4
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4732
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- Account_Domain
- Account_Name
- CategoryString
- ComputerName
- Error_Code
- EventCode
- EventType
- Group_Domain
- Group_Name
- Keywords
- LogName
- Logon_ID
- Message
- OpCode
- Privileges
- RecordNumber
- Security_ID
- SourceName
- Subject_Account_Domain
- Subject_Account_Name
- Subject_Logon_ID
- Subject_Security_ID
- TaskCategory
- Type
- action
- app
- body
- category
- change_type
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dest_nt_host
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- member_dn
- member_id
- member_nt_domain
- name
- object_attrs
- object_category
- privilege_id
- product
- punct
- result
- session_id
- severity
- severity_id
- signature
- signature_id
- source
- sourcetype
- splunk_server
- src_nt_domain
- src_user
- status
- subject
- ta_windows_action
- ta_windows_security_CategoryString
- tag
- tag::action
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group
- vendor
- vendor_privilege
- vendor_product
example_log: 10/09/2020 10:41:26 AM
