name: Windows Event Log Security 4741
id: ef87257f-e7d1-4856-abae-097b2cfdcdb4
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4741
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- AccountExpires
- AllowedToDelegateTo
- Caller_Domain
- Caller_User_Name
- CategoryString
- Channel
- Computer
- DisplayName
- DnsHostName
- Error_Code
- EventCode
- EventData_Xml
- EventID
- EventRecordID
- Guid
- HomeDirectory
- HomePath
- Keywords
- Level
- LogonHours
- Logon_ID
- Name
- NewUacValue
- OldUacValue
- Opcode
- PasswordLastSet
- PrimaryGroupId
- PrivilegeList
- ProcessID
- ProfilePath
- RecordNumber
- SamAccountName
- ScriptPath
- ServicePrincipalNames
- SidHistory
- SubjectDomainName
- SubjectLogonId
- SubjectUserName
- SubjectUserSid
- SystemTime
- System_Props_Xml
- TargetDomainName
- TargetSid
- TargetUserName
- Target_Domain
- Target_User_Name
- Task
- ThreadID
- UserAccountControl
- UserParameters
- UserPrincipalName
- UserWorkstations
- Version
- action
- app
- change_type
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- name
- object_attrs
- object_category
- product
- punct
- result
- session_id
- signature
- signature_id
- source
- sourcetype
- splunk_server
- src_nt_domain
- src_user
- status
- subject
- ta_windows_action
- ta_windows_security_CategoryString
- tag
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group
- user_type
- vendor
- vendor_product
example_log: <Event xmlns='http://schemas.microsoft.com/win/2004/08/events/event'><System><Provider
  Name='Microsoft-Windows-Security-Auditing' Guid='{54849625-5478-4994-a5ba-3e3b0328c30d}'/><EventID>4741</EventID><Version>0</Version><Level>0</Level><Task>13825</Task><Opcode>0</Opcode><Keywords>0x8020000000000000</Keywords><TimeCreated
  SystemTime='2024-04-08T18:48:04.618400500Z'/><EventRecordID>143475</EventRecordID><Correlation/><Execution
  ProcessID='636' ThreadID='1776'/><Channel>Security</Channel><Computer>ar-win-dc.attackrange.local</Computer><Security/></System><EventData><Data
  Name='TargetUserName'>AR-WIN-2$</Data><Data Name='TargetDomainName'>ATTACKRANGE</Data><Data
  Name='TargetSid'>ATTACKRANGE\AR-WIN-2$</Data><Data Name='SubjectUserSid'>ATTACKRANGE\Administrator</Data><Data
  Name='SubjectUserName'>Administrator</Data><Data Name='SubjectDomainName'>ATTACKRANGE</Data><Data
  Name='SubjectLogonId'>0xd9f04</Data><Data Name='PrivilegeList'>-</Data><Data Name='SamAccountName'>AR-WIN-2$</Data><Data
  Name='DisplayName'>-</Data><Data Name='UserPrincipalName'>-</Data><Data Name='HomeDirectory'>-</Data><Data
  Name='HomePath'>-</Data><Data Name='ScriptPath'>-</Data><Data Name='ProfilePath'>-</Data><Data
  Name='UserWorkstations'>-</Data><Data Name='PasswordLastSet'>4/8/2024 6:48:04 PM</Data><Data
  Name='AccountExpires'>%%1794</Data><Data Name='PrimaryGroupId'>515</Data><Data Name='AllowedToDelegateTo'>-</Data><Data
  Name='OldUacValue'>0x0</Data><Data Name='NewUacValue'>0x80</Data><Data Name='UserAccountControl'>
