name: Windows Event Log Security 4742
id: ea830adf-5450-489a-bcdc-fb8d2cbe674c
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4742
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- AccountExpires
- AllowedToDelegateTo
- Caller_Domain
- Caller_User_Name
- CategoryString
- Channel
- Computer
- ComputerAccountChange
- DisplayName
- DnsHostName
- Error_Code
- EventCode
- EventData_Xml
- EventID
- EventRecordID
- Guid
- HomeDirectory
- HomePath
- Keywords
- Level
- LogonHours
- Logon_ID
- Name
- NewUacValue
- OldUacValue
- Opcode
- PasswordLastSet
- PrimaryGroupId
- PrivilegeList
- ProcessID
- ProfilePath
- RecordNumber
- SamAccountName
- ScriptPath
- ServicePrincipalNames
- SidHistory
- SubjectDomainName
- SubjectLogonId
- SubjectUserName
- SubjectUserSid
- SystemTime
- System_Props_Xml
- TargetDomainName
- TargetSid
- TargetUserName
- Target_Domain
- Target_User_Name
- Task
- ThreadID
- UserAccountControl
- UserParameters
- UserPrincipalName
- UserWorkstations
- Version
- action
- app
- change_type
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- name
- object_attrs
- object_category
- product
- punct
- result
- session_id
- signature
- signature_id
- source
- sourcetype
- splunk_server
- src_nt_domain
- src_user
- status
- subject
- ta_windows_action
- ta_windows_security_CategoryString
- tag
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group
- user_type
- vendor
- vendor_product
example_log: <Event xmlns='http://schemas.microsoft.com/win/2004/08/events/event'><System><Provider
  Name='Microsoft-Windows-Security-Auditing' Guid='{54849625-5478-4994-A5BA-3E3B0328C30D}'/><EventID>4742</EventID><Version>0</Version><Level>0</Level><Task>13825</Task><Opcode>0</Opcode><Keywords>0x8020000000000000</Keywords><TimeCreated
  SystemTime='2022-08-04T09:26:26.793335600Z'/><EventRecordID>901860</EventRecordID><Correlation/><Execution
  ProcessID='636' ThreadID='2340'/><Channel>Security</Channel><Computer>win-dc-root-04195-428.attackrange.local</Computer><Security/></System><EventData><Data
  Name='ComputerAccountChange'>-</Data><Data Name='TargetUserName'>WIN-HOST-ROOT-0$</Data><Data
  Name='TargetDomainName'>ATTACKRANGE</Data><Data Name='TargetSid'>S-1-5-21-199921393-3534762603-6736986-1111</Data><Data
  Name='SubjectUserSid'>S-1-5-21-199921393-3534762603-6736986-500</Data><Data Name='SubjectUserName'>Administrator</Data><Data
  Name='SubjectDomainName'>ATTACKRANGE</Data><Data Name='SubjectLogonId'>0x177304</Data><Data
  Name='PrivilegeList'>-</Data><Data Name='SamAccountName'>-</Data><Data Name='DisplayName'>-</Data><Data
  Name='UserPrincipalName'>-</Data><Data Name='HomeDirectory'>-</Data><Data Name='HomePath'>-</Data><Data
  Name='ScriptPath'>-</Data><Data Name='ProfilePath'>-</Data><Data Name='UserWorkstations'>-</Data><Data
  Name='PasswordLastSet'>-</Data><Data Name='AccountExpires'>-</Data><Data Name='PrimaryGroupId'>-</Data><Data
  Name='AllowedToDelegateTo'>-</Data><Data Name='OldUacValue'>-</Data><Data Name='NewUacValue'>-</Data><Data
  Name='UserAccountControl'>-</Data><Data Name='UserParameters'>-</Data><Data Name='SidHistory'>
