name: Windows Event Log Security 4798
id: 29e97f72-eb2e-400e-b0c9-81277547e43b
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4798
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- ActivityID
- CallerProcessId
- CallerProcessName
- Caller_Domain
- Caller_User_Name
- Channel
- Computer
- Error_Code
- EventCode
- EventData_Xml
- EventID
- EventRecordID
- Guid
- Keywords
- Level
- Logon_ID
- Name
- Opcode
- ProcessID
- RecordNumber
- SubjectDomainName
- SubjectLogonId
- SubjectUserName
- SubjectUserSid
- SystemTime
- System_Props_Xml
- TargetDomainName
- TargetSid
- TargetUserName
- Target_Domain
- Target_User_Name
- Task
- ThreadID
- Version
- action
- app
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- product
- punct
- session_id
- signature_id
- source
- sourcetype
- splunk_server
- src_nt_domain
- src_user
- status
- ta_windows_action
- tag
- tag::action
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group
- vendor
- vendor_product
example_log: <Event xmlns='http://schemas.microsoft.com/win/2004/08/events/event'><System><Provider
  Name='Microsoft-Windows-Security-Auditing' Guid='{54849625-5478-4994-A5BA-3E3B0328C30D}'/><EventID>4798</EventID><Version>0</Version><Level>0</Level><Task>13824</Task><Opcode>0</Opcode><Keywords>0x8020000000000000</Keywords><TimeCreated
  SystemTime='2024-02-02T00:12:21.404799400Z'/><EventRecordID>386860</EventRecordID><Correlation
  ActivityID='{A0011278-554F-0000-8212-01A04F55DA01}'/><Execution ProcessID='584'
  ThreadID='5616'/><Channel>Security</Channel><Computer>ar-win-2.attackrange.local</Computer><Security/></System><EventData><Data
  Name='TargetUserName'>Guest</Data><Data Name='TargetDomainName'>AR-WIN-2</Data><Data
  Name='TargetSid'>AR-WIN-2\Guest</Data><Data Name='SubjectUserSid'>AR-WIN-2\Administrator</Data><Data
  Name='SubjectUserName'>Administrator</Data><Data Name='SubjectDomainName'>AR-WIN-2</Data><Data
  Name='SubjectLogonId'>0x2f4df4</Data><Data Name='CallerProcessId'>0x1590</Data><Data
  Name='CallerProcessName'>C:\Windows\ImmersiveControlPanel\telegram\telegram.exe</Data></EventData></Event>
