name: Windows Event Log Security 4625
id: 365a02c2-7d18-4baf-b76e-d90c20bbe6ed
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4625
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- ActivityID
- AuthenticationPackageName
- Caller_Domain
- Caller_User_Name
- Channel
- Computer
- Error_Code
- EventCode
- EventData_Xml
- EventID
- EventRecordID
- FailureReason
- Guid
- IpAddress
- IpPort
- KeyLength
- Keywords
- Level
- LmPackageName
- LogonProcessName
- LogonType
- Logon_ID
- Logon_Type
- Name
- Opcode
- ProcessID
- ProcessId
- ProcessName
- RecordNumber
- Source_Port
- Source_Workstation
- Status
- SubStatus
- Sub_Status
- SubjectDomainName
- SubjectLogonId
- SubjectUserName
- SubjectUserSid
- SystemTime
- System_Props_Xml
- TargetDomainName
- TargetUserName
- TargetUserSid
- Target_Domain
- Target_User_Name
- Task
- ThreadID
- TransmittedServices
- Version
- WorkstationName
- action
- app
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- name
- process
- process_id
- process_name
- process_path
- product
- punct
- session_id
- signature
- signature_id
- source
- sourcetype
- splunk_server
- src_ip
- src_port
- status
- subject
- ta_windows_action
- ta_windows_status
- tag
- tag::action
- tag::app
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group
- vendor
- vendor_product
example_log: <Event xmlns='http://schemas.microsoft.com/win/2004/08/events/event'><System><Provider
  Name='Microsoft-Windows-Security-Auditing' Guid='{54849625-5478-4994-A5BA-3E3B0328C30D}'/><EventID>4625</EventID><Version>0</Version><Level>0</Level><Task>12544</Task><Opcode>0</Opcode><Keywords>0x8010000000000000</Keywords><TimeCreated
  SystemTime='2023-03-22T20:25:15.594676400Z'/><EventRecordID>367348</EventRecordID><Correlation
  ActivityID='{6C54D781-5C05-0000-8CD7-546C055CD901}'/><Execution ProcessID='588'
  ThreadID='3564'/><Channel>Security</Channel><Computer>ar-win-8.attackrange.local</Computer><Security/></System><EventData><Data
  Name='SubjectUserSid'>NULL SID</Data><Data Name='SubjectUserName'>-</Data><Data
  Name='SubjectDomainName'>-</Data><Data Name='SubjectLogonId'>0x0</Data><Data Name='TargetUserSid'>NULL
  SID</Data><Data Name='TargetUserName'>Administrator</Data><Data Name='TargetDomainName'>builtin</Data><Data
  Name='Status'>0xc000006d</Data><Data Name='FailureReason'>%%2313</Data><Data Name='SubStatus'>0xc000006a</Data><Data
  Name='LogonType'>3</Data><Data Name='LogonProcessName'>NtLmSsp </Data><Data Name='AuthenticationPackageName'>NTLM</Data><Data
  Name='WorkstationName'>-</Data><Data Name='TransmittedServices'>-</Data><Data Name='LmPackageName'>-</Data><Data
  Name='KeyLength'>0</Data><Data Name='ProcessId'>0x0</Data><Data Name='ProcessName'>-</Data><Data
  Name='IpAddress'>10.0.1.30</Data><Data Name='IpPort'>59450</Data></EventData></Event>
