name: Windows Event Log Security 4703
id: e256673b-16e8-4b74-b7aa-9eed6ce67072
version: 1
date: '2024-07-18'
author: Patrick Bareiss, Splunk
description: Data source object for Windows Event Log Security 4703
source: XmlWinEventLog:Security
sourcetype: xmlwineventlog
separator: EventCode
supported_TA:
- name: Splunk Add-on for Microsoft Windows
  url: https://splunkbase.splunk.com/app/742
  version: 8.9.0
fields:
- _time
- Caller_Domain
- Caller_User_Name
- Channel
- Computer
- DisabledPrivilegeList
- EnabledPrivilegeList
- Error_Code
- EventCode
- EventData_Xml
- EventID
- EventRecordID
- Guid
- Keywords
- Level
- Logon_ID
- Name
- Opcode
- ProcessID
- ProcessId
- ProcessName
- RecordNumber
- SubjectDomainName
- SubjectLogonId
- SubjectUserName
- SubjectUserSid
- SystemTime
- System_Props_Xml
- TargetDomainName
- TargetLogonId
- TargetUserName
- TargetUserSid
- Target_Domain
- Target_User_Name
- Task
- ThreadID
- Version
- action
- app
- change_type
- date_hour
- date_mday
- date_minute
- date_month
- date_second
- date_wday
- date_year
- date_zone
- dest
- dest_nt_domain
- dvc
- dvc_nt_host
- event_id
- eventtype
- host
- id
- index
- linecount
- object
- object_attrs
- object_category
- object_id
- process
- process_id
- process_name
- process_path
- product
- punct
- result
- session_id
- signature_id
- source
- sourcetype
- splunk_server
- src_nt_domain
- src_user
- src_user_name
- status
- ta_windows_action
- tag
- tag::eventtype
- timeendpos
- timestartpos
- user
- user_group
- user_name
- vendor
- vendor_product
example_log: <Event xmlns='http://schemas.microsoft.com/win/2004/08/events/event'><System><Provider
  Name='Microsoft-Windows-Security-Auditing' Guid='{54849625-5478-4994-A5BA-3E3B0328C30D}'/><EventID>4703</EventID><Version>0</Version><Level>0</Level><Task>13317</Task><Opcode>0</Opcode><Keywords>0x8020000000000000</Keywords><TimeCreated
  SystemTime='2022-08-31T09:47:43.137598500Z'/><EventRecordID>328761</EventRecordID><Correlation/><Execution
  ProcessID='4' ThreadID='320'/><Channel>Security</Channel><Computer>win-host-ctus-attack-range-115</Computer><Security/></System><EventData><Data
  Name='SubjectUserSid'>WIN-HOST-CTUS-A\Administrator</Data><Data Name='SubjectUserName'>Administrator</Data><Data
  Name='SubjectDomainName'>WIN-HOST-CTUS-A</Data><Data Name='SubjectLogonId'>0x288b91</Data><Data
  Name='TargetUserSid'>WIN-HOST-CTUS-A\Administrator</Data><Data Name='TargetUserName'>Administrator</Data><Data
  Name='TargetDomainName'>WIN-HOST-CTUS-A</Data><Data Name='TargetLogonId'>0x288b91</Data><Data
  Name='ProcessName'>C:\Temp\poc_2\c2_agent.exe</Data><Data Name='ProcessId'>0x570</Data><Data
  Name='EnabledPrivilegeList'>SeDebugPrivilege</Data><Data Name='DisabledPrivilegeList'>-</Data></EventData></Event>
