name: Endpoint.Registry
prefix: Registry
fields:
  - action
  - dest
  - dest_bunit
  - dest_category
  - dest_priority
  - dest_requires_av
  - dest_should_timesync
  - dest_should_update
  - process_guid
  - process_id
  - registry_hive
  - registry_path
  - registry_key_name
  - registry_value_data
  - registry_value_name
  - registry_value_text
  - registry_value_type
  - status
  - tag
  - user
  - user_bunit
  - user_category
  - user_priority
  - vendor_product