name: Endpoint.Filesystem
prefix: Filesystem
fields:
  - action
  - dest
  - dest_bunit
  - dest_category
  - dest_priority
  - dest_requires_av
  - dest_should_timesync
  - dest_should_update
  - file_access_time
  - file_create_time
  - file_hash
  - file_modify_time
  - file_name
  - file_path
  - file_acl
  - file_size
  - process_guid
  - process_id
  - tag
  - user
  - user_bunit
  - user_category
  - user_priority
  - vendor_product