name: Endpoint.Services
prefix: Services
fields:
  - description
  - dest
  - dest_bunit
  - dest_category
  - dest_is_expected
  - dest_priority
  - dest_requires_av
  - dest_should_timesync
  - dest_should_update
  - process_guid
  - process_id
  - service
  - service_dll
  - service_dll_path
  - service_dll_hash
  - service_dll_signature_exists
  - service_dll_signature_verified
  - service_exec
  - service_hash
  - service_id
  - service_name
  - service_path
  - service_signature_exists
  - service_signature_verified
  - start_mode
  - status
  - tag
  - user
  - user_bunit
  - user_category
  - user_priority
  - vendor_product