name: Network_Traffic.All_Traffic
prefix: All_Traffic
fields:
  - action
  - app
  - bytes
  - bytes_in
  - bytes_out
  - channel
  - dest
  - dest_bunit
  - dest_category
  - dest_interface
  - dest_ip
  - dest_mac
  - dest_port
  - dest_priority
  - dest_translated_ip
  - dest_translated_port
  - dest_zone
  - direction
  - duration
  - dvc
  - dvc_bunit
  - dvc_category
  - dvc_ip
  - dvc_mac
  - dvc_priority
  - dvc_zone
  - flow_id
  - icmp_code
  - icmp_type
  - packets
  - packets_in
  - packets_out
  - process_id
  - protocol
  - protocol_version
  - response_time
  - rule
  - session_id
  - src
  - src_bunit
  - src_category
  - src_interface
  - src_ip
  - src_mac
  - src_port
  - src_priority
  - src_translated_ip
  - src_translated_port
  - src_zone
  - ssid
  - tag
  - tcp_flag
  - transport
  - tos
  - ttl
  - user
  - user_bunit
  - user_category
  - user_priority
  - vendor_account
  - vendor_product
  - vlan
  - wifi