name: Network_Resolution.DNS
prefix: DNS
fields:
  - additional_answer_count
  - answer
  - answer_count
  - authority_answer_count
  - dest
  - dest_bunit
  - dest_category
  - dest_port
  - dest_priority
  - duration
  - message_type
  - name
  - query
  - query_count
  - query_type
  - record_type
  - reply_code
  - reply_code_id
  - response_time
  - src
  - src_bunit
  - src_category
  - src_port
  - src_priority
  - tag
  - transaction_id
  - transport
  - ttl
  - vendor_product