name: Web.Web
prefix: Web
fields:
  - action
  - app
  - bytes
  - bytes_in
  - bytes_out
  - cached
  - category
  - cookie
  - dest
  - dest_bunit
  - dest_category
  - dest_priority
  - dest_port
  - duration
  - http_content_type
  - http_method
  - http_referrer
  - http_referrer_domain
  - http_user_agent
  - http_user_agent_length
  - response_time
  - site
  - src
  - src_bunit
  - src_category
  - src_priority
  - status
  - tag
  - uri_path
  - uri_query
  - url
  - url_domain
  - url_length
  - user
  - user_bunit
  - user_category
  - user_priority
  - vendor_product