name: Anomalous usage of Archive Tools
id: 63614a58-10e2-4c6c-ae81-ea1113681439
version: 1
description: The following detection identifies the usage of archive tools from the
  command line.
search: ' | from read_ba_enriched_events() | eval timestamp = ucast(map_get(input_event,"time"),
  "long", null) | eval process_map = ucast(map_get(input_event, "process"), "map<string,
  any>", null) | eval file_map = ucast(map_get(process_map, "file"), "map<string,
  any>", null) | eval process_name = lower(ucast(map_get(file_map, "name"), "string",
  null)) | eval cmd_line = ucast(map_get(process_map, "cmd_line"), "string", null)
  | eval actor_map = ucast(map_get(input_event, "actor"), "map<string, any>", null)
  | eval actor_process_map = ucast(map_get(actor_map, "actor_process"), "map<string,
  any>", null) | eval actor_process_file_map = ucast(map_get(actor_process_map, "file"),
  "map<string, any>", null) | eval parent_process_name = ucast(map_get(actor_process_file_map,
  "name"), "string", null) | eval metadata_map = ucast(map_get(input_event, "metadata"),
  "map<string, any>", null) | eval metadata_uid = ucast(map_get(metadata_map, "uid"),
  "string", null) | eval disposition_id = ucast(map_get(input_event, "disposition_id"),
  "integer", null) | eval process_cmd_line_len = len(cmd_line) | where process_name="WinRAR.exe" OR like(process_name, "7z%") OR like(process_name,"winzip%") 
  | where like(parent_process_name, "%powershell.exe") OR like(parent_process_name,"%cmd.exe")  
  | eval origin_map=ucast(map_get(input_event, "origin"), "map<string,any>", null), 
  dest_device=ucast(map_get(origin_map, "device"), "map<string, any>",
  null), dest_user=ucast(map_get(input_event, "user"), "map<string, any>", null),
  dest_device_name=ucast(map_get(dest_device, "name"), "string", null), dest_user_name=ucast(map_get(dest_user,
  "name"), "string", null), message=concat("An instance of $parent_process_name$ spawning
  $process_name$ was identified on endpoint $dest$ by user $user$. This behavior is
  indicative of suspicious loading of 7zip.", dest_device_name, " by ", dest_user_name,
  " via process ", process_name, ".")  
  | eval body=create_map(
    "activity_id", 1,
    "analytic_stories", ["Cobalt Strike", "NOBELIUM Group", "Insider Threat"],
    "cis_csc", [create_map("control", "CIS 10", "version", 7)],
    "category_uid", 2,
    "class", "Detection Report",
    "class_uid", 102001,
    "confidence", 60,
    "confidence_id", 2,
    "devices", [
        create_map(
            "uid", ucast(map_get( dest_device , "ref_uid"), "string", null), "type_id", 0)
    ],
    "duration", 0,
    "time", timestamp,
    "evidence", create_map(
        "actor.process.file.name", parent_process_name,
        "process.file.name", process_name,
        "process.cmd_line", cmd_line,
        "process_cmd_length", process_cmd_line_len
    ),
    "impact", 70,
    "impact_id", 4,
    "kill_chain", [create_map("phase", "Exploitation", "phase_id", 4)],
    "attacks", [create_map("tactics", [create_map("name", "Collection", "uid", "TA0009")], "technique", create_map("name", "Archive via Utility", "uid", "T1560.001"), "version", "12.1"), create_map("tactics", [create_map("name", "Collection", "uid", "TA0009")], "technique", create_map("name", "Archive Collected Data", "uid", "T1560"), "version", "12.1")],  
    "message", message,
    "metadata", create_map(
        "product", create_map(
            "name", "Behavioral Analytic Service",
            "vendor_name", "Splunk"
        ),
        "version", "1.0.0"
    ),
    "nist", ["DE.AE"],
    "observables", [create_map("name", "dest_user", "type_id", 6, "value", dest_user), create_map("name", "parent_process_name", "type_id", 15, "value", parent_process_name), create_map("name", "process_name", "type_id", 15, "value", process_name)],
    "risk_level", "Medium",
    "risk_level_id", 2,
    "risk_score", 42,
    "severity_id", 4,
    "type_id", 10200101,
    "users", [
        create_map(
            "uid", ucast(map_get(dest_user, "ref_uid"),"string", null)
        )
    ]
  )
  | into write_ba_finding_events();'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: False positives can be ligitmate usage of archive tools from
  the command line.
references:
- https://attack.mitre.org/techniques/T1560/001/
tags:
  analytic_story:
  - Cobalt Strike
  - NOBELIUM Group
  - Insider Threat
  cis20:
  - CIS 10
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1560.001
  - T1560
  nist:
  - DE.AE
  required_fields: 
  - test
  risk_score: 42
  security_domain: endpoint
  risk_severity: low
  research_site_url: https://research.splunk.com/endpoint/63614a58-10e2-4c6c-ae81-ea1113681439/
  event_schema: cim
test:
  name: Anomalous usage of Archive Tools Unit Test
  tests:
  - name: Anomalous usage of Archive Tools
    attack_data:
    - file_name: windows-security.log
      data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1560.001/archive_tools/windows-security.log
      source: WinEventLog:Security
