name: Abnormally High Number Of Cloud Security Group API Calls
id: d4dfb7f3-7a37-498a-b5df-f19334e871af
version: 1
date: '2020-09-07'
description: This search will detect a spike in the number of API calls made to your
  cloud infrastructure environment about security groups by a user.
how_to_implement: You must be ingesting your cloud infrastructure logs. You also must
  run the baseline search `Baseline Of Cloud Security Group API Calls Per User` to
  create the probability density function model.
type: ESCU
references: []
author: David Dorsey, Splunk
search: '| tstats count as security_group_api_calls values(All_Changes.command) as
  command from datamodel=Change where All_Changes.object_category=firewall AND All_Changes.status=success
  by All_Changes.user _time span=1h | `drop_dm_object_name("All_Changes")` | eval
  HourOfDay=strftime(_time, "%H") | eval HourOfDay=floor(HourOfDay/4)*4 | eval DayOfWeek=strftime(_time,
  "%w") | eval isWeekend=if(DayOfWeek >= 1 AND DayOfWeek <= 5, 0, 1) | join user HourOfDay
  isWeekend [ summary cloud_excessive_security_group_api_calls_v1] | where cardinality
  >=16 | apply cloud_excessive_security_group_api_calls_v1 threshold=0.005 | rename
  "IsOutlier(security_group_api_calls)" as isOutlier | where isOutlier=1 | eval expected_upper_threshold
  = mvindex(split(mvindex(BoundaryRanges, -1), ":"), 0) | where security_group_api_calls
  > expected_upper_threshold | eval distance_from_threshold = security_group_api_calls
  - expected_upper_threshold | table _time, user, command, security_group_api_calls,
  expected_upper_threshold, distance_from_threshold | `abnormally_high_number_of_cloud_security_group_api_calls_filter`'
known_false_positives: ''
tags:
  analytics_story:
  - Suspicious Cloud User Activities
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1078.004
  cis20:
  - CIS 16
  nist:
  - DE.DP
  - DE.CM
  - PR.AC
  product:
  - Splunk Security Analytics for AWS
  security_domain: network
  asset_type: AWS Instance
  risk_score: 25
  risk_object_type: user
  risk_object: user
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/suspicious_behaviour/abnormally_high_cloud_instances_launched/cloudtrail_behavioural_detections.json
