name: AWS IAM List Users
id: df11dda2-779d-11eb-8b13-acde48001122
version: 1
date: '2021-02-25'
author: Rod Soto
type: batch
datamodel:
- Authentication
description: UPDATE_DESCRIPTION
search: 'sourcetype=aws:cloudtrail eventSource=iam.amazonaws.com eventName=ListUsers | stats count min(_time) as firstTime max(_time) as lastTime by eventName eventType sourceIPAddress userAgent userIdentity.accessKeyId userIdentity.arn userIdentity.type userName | `aws_iam_list_users_filter`'
how_to_implement: UPDATE_HOW_TO_IMPLEMENT
known_false_positives: UPDATE_KNOWN_FALSE_POSITIVES
references:
tags:
  analytic_story:
  - UPDATE_STORY_NAME
  dataset:
  - UPDATE_DATASET_URL
  kill_chain_phases:
  - Reconnaissance
  mitre_attack_id:
  - T1087.004
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  