author: Michael Haag, Splunk
datamodel: []
date: '2021-04-01'
description: This detection identifies failure attempts to delete groups. We want
  to identify when a group is attempting to be deleted, but either access is denied,
  there is a conflict or there is no group. This is indicative of administrators performing
  an action, but also could be suspicious behavior occurring. Review parallel IAM
  events - recently added users, new groups and so forth.
how_to_implement: The Splunk AWS Add-on and Splunk App for AWS is required to utilize
  this data. The search requires AWS Cloudtrail logs.
id: 723b861a-92eb-11eb-93b8-acde48001122
known_false_positives: This detection will require tuning to provide high fidelity
  detection capabilties. Tune based on src addresses (corporate offices, VPN terminations)
  or by groups of users. Not every user with AWS access should have permission to
  delete groups (least privilege).
name: AWS IAM Failure Group Deletion
references:
- https://awscli.amazonaws.com/v2/documentation/api/latest/reference/iam/delete-group.html
- https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeleteGroup.html
search: '`cloudtrail` eventSource=iam.amazonaws.com eventName=DeleteGroup errorCode
  IN (NoSuchEntityException,DeleteConflictException, AccessDenied) (userAgent!=*.amazonaws.com)
  | stats count min(_time) as firstTime max(_time) as lastTime values(requestParameters.groupName)
  as group_name by src eventName eventSource aws_account_id errorCode errorMessage
  userAgent eventID awsRegion userIdentity.principalId user_arn | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `aws_iam_failure_group_deletion_filter`'
tags:
  analytic_story:
  - AWS IAM Privilege Escalation
  automated_detection_testing: passed
  confidence: 50
  context:
  - Source:Cloud Data
  - Scope:External
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1098/aws_iam_failure_group_deletion/aws_iam_failure_group_deletion.json
  impact: 10
  kill_chain_phases:
  - Actions on Objectives
  message: User $user_arn$ has had mulitple failures while attempting to delete groups
    from $src$
  mitre_attack_id:
  - T1098
  observable:
  - name: src
    role:
    - Attacker
    type: IP Address
  - name: user_arn
    role:
    - Victim
    type: User
  - name: group_name
    role:
    - Victim
    type: User
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  - Splunk Security Analytics for AWS
  required_fields:
  - _time
  - errorCode
  - eventName
  - userAgent
  risk_score: 5
  security_domain: cloud
type: Anomaly
version: 1
