name: AWS SetDefaultPolicyVersion
id: 2a9b80d3-6340-4345-11ad-212bf3d0dac4
version: 1
date: '2021-03-02'
author: Bhavin Patel, Splunk
type: batch
datamodel: []
description: This search looks for CloudTrail events where a user has set a default
  policy versions. Attackers have been know to use this technique for Privilege Escalation
  in case the previous versions of the policy had permissions to access more resources
  than the current version of the policy
search: '`cloudtrail` eventName=SetDefaultPolicyVersion eventSource = iam.amazonaws.com
  | stats count min(_time) as firstTime max(_time) as lastTime values(requestParameters.policyArn)
  as policy_arn by src requestParameters.versionId eventName eventSource aws_account_id
  errorCode userAgent eventID awsRegion userIdentity.principalId user_arn | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `aws_setdefaultpolicyversion_filter`'
how_to_implement: You must install splunk AWS add on and Splunk App for AWS. This
  search works with cloudtrail logs.
known_false_positives: While this search has no known false positives, it is possible
  that an AWS admin has legitimately set a default policy to allow a user to access
  all resources. That said, AWS strongly advises against granting full control to
  all AWS resources
references:
- https://labs.bishopfox.com/tech-blog/privilege-escalation-in-aws
- https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation-part-2/
tags:
  analytic_story:
  - AWS IAM Privilege Escalation
  asset_type: AWS Account
  automated_detection_testing: passed
  cis20:
  - CIS 13
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1078/aws_setdefaultpolicyversion/aws_cloudtrail_events.json
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1078.004
  nist:
  - PR.DS
  - PR.AC
  - DE.CM
  product:
  - Splunk Security Analytics for AWS
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - eventName
  - userAgent
  - errorCode
  - requestParameters.userName
  - eventSource
  risk_object: src
  risk_object_type: system
  risk_score: 25
  impact: 
  confidence: 
  # (impact * confidence)/100
  risk_score: 
  context:
  - Source: Cloud Data
  - Scope: Internal, External, Inbound, Outbound, Local, Network
  - Outcome: Blocked, Allowed
  - Stage: Recon, Initial Access, Execution, Persistence, Privilege Escalation, Defense Evasion, Credential Access, Discovery, Lateral Movement, Collection, Exfiltration, Command And Control
  - Rares: Rare Process, Rare Device, Rare Domain, Rare Network, Rare Location
  - Other: Policy Violation

  message: 
  observable:
  - name: 
    type: Other, Unknown, Device, Container, Endpoint, Hostname, IP Address, User, Username,Email, Email Address , URL , URL Domain, File , File Name ,File Hash ,Process ,Process Name, Location

    role:
    - Other, Unknown, Actor, Target, Attacker, Victim, Parent Process, Child Process, Known Bad, Data Loss

  security_domain: network
