name: AWS IAM Detect Creation Usage of Access Keys with Root
id: 42528528-9329-11eb-9fe1-acde48001122
version: 1
date: '2021-04-01'
author: Michael Haag, Splunk
type: batch
datamodel: []
description: THe following detection is aimed at detecting the Root user account creating keys. This is generally not an activity that would be performed after the Root account is locked down.
search: '`cloudtrail` eventName IN (CreateKey, CreateAccessKey) userName=root
| stats count min(_time) as firstTime max(_time) as lastTime values(userName) by src eventName eventSource aws_account_id errorCode userAgent eventID awsRegion userIdentity.principalId user_arn
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
| `aws_iam_detect_creation_usage_of_access_keys_with_root_filter`'
how_to_implement: The Splunk AWS Add-on and Splunk App for AWS is required to utilize this data. The search requires AWS Cloudtrail logs.
known_false_positives: Using the Root account for day to day activity is against best practices. Once Root is no longer used or needed for day to day operations, begin monitoring for usage.
references:
- https://docs.aws.amazon.com/IAM/latest/APIReference/API_CreateAccessKey.html
tags:
  analytic_story: 
  - AWS IAM Privilege Escalation
  dataset: []
  kill_chain_phases:
  - Privilege Escalation
  mitre_attack_id:
  - T1078.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  - Splunk Security Analytics for AWS
  required_fields:
  - _time
  security_domain: access