name: AWS IAM MFA Deactivated
id: 452972ca-930b-11eb-ba0d-acde48001122
version: 1
date: '2021-04-01'
author: Michael Haag, Splunk
type: batch
datamodel:
description: This detection looks for the successful event of MFA being deactivated on an account. 
search: '`cloudtrail` errorCode=DeactivateMFADevice status=success
| stats count min(_time) as firstTime max(_time) as lastTime values(requestParameters.policyName) as policy_name by src eventName eventSource aws_account_id errorCode requestParameters.policyDocument userAgent eventID awsRegion userIdentity.principalId user_arn 
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)`
 | `aws_iam_mfa_deactivated_filter`'
how_to_implement: The Splunk AWS Add-on and Splunk App for AWS is required to utilize this data. The search requires AWS Cloudtrail logs.
known_false_positives: False positives should be limited as the ability to disable MFA should be restricted and only used for troubleshooting an account issue.
references:
- https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeactivateMFADevice.html
tags:
  analytic_story:
  - UPDATE_STORY_NAME
  dataset: []
  kill_chain_phases:
  - Privilege Escalation
  mitre_attack_id:
  - T1003.002
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  - Splunk Security Analytics for AWS
  required_fields:
  - _time
  - eventName
  - userAgent
  - errorCode
  - requestParameters.policyName
  security_domain: access