name: AWS Credential Access RDS Password reset
id: 6153c5ea-ed30-4878-81e6-21ecdb198189
version: 2
date: '2024-03-19'
author: Gowthamaraj Rajendran, Splunk
status: production
type: TTP
description: The master user password for Amazon RDS DB instance can be reset using
  the Amazon RDS console. Using this technique, the attacker can get access to the
  sensitive data from the DB. Usually, the production databases may have sensitive
  data like Credit card information, PII, Health care Data. This event should be investigated
  further.
data_source: []
search: '`cloudtrail` eventSource="rds.amazonaws.com" eventName=ModifyDBInstance "requestParameters.masterUserPassword"=*
  | stats count min(_time) as firstTime max(_time) as lastTime values(requestParameters.dBInstanceIdentifier)
  as database_id by src awsRegion eventName userAgent user_arn| `security_content_ctime(firstTime)`|
  `security_content_ctime(lastTime)` | `aws_credential_access_rds_password_reset_filter`'
how_to_implement: You must install splunk AWS add on and Splunk App for AWS. This
  search works with AWS CloudTrail logs.
known_false_positives: Users may genuinely reset the RDS password.
references:
- https://aws.amazon.com/premiumsupport/knowledge-center/reset-master-user-password-rds
tags:
  analytic_story:
  - AWS Identity and Access Management Account Takeover
  asset_type: AWS Account
  confidence: 70
  impact: 70
  message: $database_id$ password has been reset from IP $src$
  mitre_attack_id:
  - T1586
  - T1586.003
  - T1110
  observable:
  - name: database_id
    type: Endpoint
    role:
    - Victim
  - name: src
    type: IP Address
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - eventName
  - eventSource
  - requestParameters.dBInstanceIdentifier
  - userAgent
  - sourceIPAddress
  - awsRegion
  risk_score: 49
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1110.002/aws_rds_password_reset/aws_cloudtrail_events.json
    source: aws_cloudtrail
    sourcetype: aws:cloudtrail
    update_timestamp: true
