name: AWS Defense Evasion Update Cloudtrail
id: 7c921d28-ef48-4f1b-85b3-0af8af7697db
version: 2
date: '2024-05-17'
author: Gowthamaraj Rajendran, Splunk
status: production
type: TTP
description: The following analytic detects `UpdateTrail` events in AWS CloudTrail
  logs. It identifies attempts to modify CloudTrail settings, potentially to evade
  logging. The detection leverages CloudTrail logs, focusing on `UpdateTrail` events
  where the user agent is not the AWS console and the operation is successful. This
  activity is significant because altering CloudTrail settings can disable or limit
  logging, hindering visibility into AWS account activities. If confirmed malicious,
  this could allow attackers to operate undetected, compromising the integrity and
  security of the AWS environment.
data_source:
- AWS CloudTrail UpdateTrail
search: '`cloudtrail` eventName = UpdateTrail eventSource = cloudtrail.amazonaws.com
  userAgent !=console.amazonaws.com errorCode = success| stats count min(_time) as
  firstTime max(_time) as lastTime values(requestParameters.name) as cloudtrail_name
  by src region eventName userAgent user_arn aws_account_id | `security_content_ctime(firstTime)`|
  `security_content_ctime(lastTime)`| `aws_defense_evasion_update_cloudtrail_filter`'
how_to_implement: You must install Splunk AWS Add on and enable CloudTrail logs in
  your AWS Environment.
known_false_positives: While this search has no known false positives, it is possible
  that an AWS admin has updated cloudtrail logging. Please investigate this activity.
references:
- https://attack.mitre.org/techniques/T1562/008/
tags:
  analytic_story:
  - AWS Defense Evasion
  asset_type: AWS Account
  confidence: 90
  impact: 100
  message: User $user_arn$ has updated a cloudtrail logging for account id $aws_account_id$
    from IP $src$
  mitre_attack_id:
  - T1562
  - T1562.008
  observable:
  - name: src
    type: IP Address
    role:
    - Attacker
  - name: user_arn
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - eventName
  - eventSource
  - requestParameters.name
  - userAgent
  - aws_account_id
  - src
  - region
  risk_score: 90
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.008/update_cloudtrail/aws_cloudtrail_events.json
    source: aws_cloudtrail
    sourcetype: aws:cloudtrail
    update_timestamp: true
