name: AWS Password Policy Changes
id: aee4a575-7064-4e60-b511-246f9baf9895
version: 2
date: '2024-05-10'
author: Bhavin Patel, Splunk
status: production
type: Hunting
description: The following analytic detects successful API calls to view, update,
  or delete the password policy in an AWS organization. It leverages AWS CloudTrail
  logs to identify events such as "UpdateAccountPasswordPolicy," "GetAccountPasswordPolicy,"
  and "DeleteAccountPasswordPolicy." This activity is significant because it is uncommon
  for regular users to perform these actions, and such changes can indicate an adversary
  attempting to understand or weaken password defenses. If confirmed malicious, this
  could lead to compromised accounts and increased attack surface, potentially allowing
  unauthorized access and control over AWS resources.
data_source:
- AWS CloudTrail UpdateAccountPasswordPolicy
- AWS CloudTrail GetAccountPasswordPolicy
- AWS CloudTrail DeleteAccountPasswordPolicy
search: '`cloudtrail` eventName IN ("UpdateAccountPasswordPolicy","GetAccountPasswordPolicy","DeleteAccountPasswordPolicy")
  errorCode=success | stats count values(eventName) as eventName values(userAgent)
  min(_time) as firstTime max(_time) as lastTime by eventSource aws_account_id errorCode  awsRegion
  userIdentity.principalId user_arn src_ip | `security_content_ctime(firstTime)` |
  `security_content_ctime(lastTime)`  | `aws_password_policy_changes_filter`'
how_to_implement: You must install Splunk AWS Add on and Splunk App for AWS. This
  search works with AWS CloudTrail logs.
known_false_positives: While this search has no known false positives, it is possible
  that an AWS admin has legitimately triggered an AWS audit tool activity which may
  trigger this event.
references:
- https://www.trendmicro.com/cloudoneconformity/knowledge-base/aws/IAM/password-policy.html
tags:
  analytic_story:
  - AWS IAM Privilege Escalation
  - Compromised User Account
  asset_type: AWS Account
  confidence: 80
  impact: 90
  message: User $user_arn$ is attempting to $eventName$ the password policy for account
    id $aws_account_id$
  mitre_attack_id:
  - T1201
  observable:
  - name: src_ip
    type: IP Address
    role:
    - Attacker
  - name: user_arn
    type: User
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - eventName
  - userAgent
  - errorCode
  - requestParameters.userName
  - eventSource
  - user_arn
  - aws_account_id
  - src_ip
  risk_score: 72
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1201/aws_password_policy/cloudtrail.json
    sourcetype: aws:cloudtrail
    source: aws_cloudtrail
    update_timestamp: true
