name: AWS IAM List Entities For Policy
id: 41fa2ada-77aa-11eb-a92b-acde48001122
version: 1
date: '2021-02-25'
author: Rod Soto
type: batch
datamodel:
description: UPDATE_DESCRIPTION
search: 'sourcetype=aws:cloudtrail eventSource=iam.amazonaws.com eventName=ListEntitiesForPolicy |stats count min(_time) as firstTime max(_time) as lastTime by awsRegion eventName requestParameters.policyArn sourceIPAddress userAgent userIdentity.arn userName userIdentity.accessKeyId | `aws_iam_list_entities_for_policy_filter`'
how_to_implement: UPDATE_HOW_TO_IMPLEMENT
known_false_positives: UPDATE_KNOWN_FALSE_POSITIVES
references:
tags:
  analytic_story:
  - UPDATE_STORY_NAME
  dataset:
  - UPDATE_DATASET_URL
  kill_chain_phases:
  - Lateral Movement
  mitre_attack_id:
  - T1069
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  