name: AWS Console Login Failed During MFA Challenge
id: 55349868-5583-466f-98ab-d3beb321961e
version: 1
date: '2022-10-03'
author: Bhavin Patel, Splunk
type: TTP
datamodel: []
description: The following analytic identifies an authentication attempt event against an AWS Console that fails during the Multi Factor Authentication challenge. AWS Cloudtrail logs provide a a very useful field called `additionalEventData` that logs information regarding usage of MFA. This behavior may represent an adversary trying to authenticate with compromised credentials for an account that has multi-factor authentication enabled. 
search: '`cloudtrail` eventName= ConsoleLogin errorMessage="Failed authentication" additionalEventData.MFAUsed = "Yes" 
| stats count min(_time) as firstTime max(_time) as lastTime by src eventName eventSource aws_account_id errorCode errorMessage
  userAgent eventID awsRegion user_name userIdentity.arn | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`| `aws_console_login_failed_during_mfa_challenge_filter`'
how_to_implement: The Splunk AWS Add-on is required to utilize this data. The search requires AWS Cloudtrail logs.
known_false_positives: Legitimate users may miss to reply the MFA challenge within the time window or deny it by mistake.
references:
- https://attack.mitre.org/techniques/T1621/
- https://aws.amazon.com/what-is/mfa/
tags:
  analytic_story:
  - AWS Identity and Access Management Account Takeover
  asset_type: AWS Account
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 80
  context:
  - Source:Cloud Data
  - Outcome:Blocked
  - Stage:Recon
  - Other:Brute Force
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1621/aws_failed_mfa/cloudtrail.json
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: User $user_name$ failed to pass MFA challenge while logging into console from $src$
  mitre_attack_id:
  - T1586
  - T1586.003
  - T1621

  nist:
  - DE.CM
  observable:
  - name: user_name
    type: User
    role:
    - Victim
  - name: src
    type: IP Address
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - src 
  - eventName 
  - eventSource 
  - aws_account_id 
  - errorCode 
  - errorMessage
  - userAgent 
  - eventID 
  - awsRegion
  - user_name 
  - userIdentity.arn 
  risk_score: 64
  security_domain: threat
