name: AWS Console Login Failed During MFA Challenge
id: 55349868-5583-466f-98ab-d3beb321961e
version: 2
date: '2024-05-29'
author: Bhavin Patel, Splunk
status: production
type: TTP
description: The following analytic identifies failed authentication attempts to the
  AWS Console during the Multi-Factor Authentication (MFA) challenge. It leverages
  AWS CloudTrail logs, specifically the `additionalEventData` field, to detect when
  MFA was used but the login attempt still failed. This activity is significant as
  it may indicate an adversary attempting to access an account with compromised credentials
  but being thwarted by MFA. If confirmed malicious, this could suggest an ongoing
  attempt to breach the account, potentially leading to unauthorized access and further
  attacks if MFA is bypassed.
data_source:
- AWS CloudTrail ConsoleLogin
search: '`cloudtrail` eventName= ConsoleLogin errorMessage="Failed authentication"
  additionalEventData.MFAUsed = "Yes" | stats count min(_time) as firstTime max(_time)
  as lastTime by src eventName eventSource aws_account_id errorCode errorMessage userAgent
  eventID awsRegion user_name userIdentity.arn | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`| `aws_console_login_failed_during_mfa_challenge_filter`'
how_to_implement: The Splunk AWS Add-on is required to utilize this data. The search
  requires AWS CloudTrail logs.
known_false_positives: Legitimate users may miss to reply the MFA challenge within
  the time window or deny it by mistake.
references:
- https://attack.mitre.org/techniques/T1621/
- https://aws.amazon.com/what-is/mfa/
tags:
  analytic_story:
  - AWS Identity and Access Management Account Takeover
  - Compromised User Account
  asset_type: AWS Account
  confidence: 80
  impact: 80
  message: User $user_name$ failed to pass MFA challenge while logging into console
    from $src$
  mitre_attack_id:
  - T1586
  - T1586.003
  - T1621
  observable:
  - name: user_name
    type: User
    role:
    - Victim
  - name: src
    type: IP Address
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - src
  - eventName
  - eventSource
  - aws_account_id
  - errorCode
  - errorMessage
  - userAgent
  - eventID
  - awsRegion
  - user_name
  - userIdentity.arn
  risk_score: 64
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1621/aws_failed_mfa/cloudtrail.json
    sourcetype: aws:cloudtrail
    source: aws_cloudtrail
    update_timestamp: true
