name: AWS Defense Evasion Impair Security Services
id: b28c4957-96a6-47e0-a965-6c767aac1458
version: 1
date: '2022-07-26'
author: Bhavin Patel, Gowthamaraj Rajendran, Splunk
type: Hunting
datamodel: []
description: This analytic looks for several delete specific API calls made to AWS Security Services like CloudWatch, Guardduy, Web Application Firewalls. These API calls  are often leveraged by adversaries to weaken your exiting security defenses to deleting logging configurations in the cloudwatch alarm, delete a set of detectors from your Guardduty environment or simply delete a bunch of cloudwatch alarams to remain stealthy and avoid detection. These API calls  
search: '`cloudtrail` eventName IN ("DeleteLogStream","DeleteDetector","DeleteIPSet","DeleteWebACL","DeleteRule","DeleteRuleGroup","DeleteLoggingConfiguration","DeleteAlarms") | stats
  count min(_time) as firstTime max(_time) as lastTime values(eventName)  as eventName values(eventSource) as eventSource values(requestParameters.*) as * by src region user_arn aws_account_id user_type user_agent errorCode| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)`| `aws_defense_evasion_impair_security_services_filter`'
how_to_implement: You must install Splunk AWS Add on and enable Cloudtrail logs in
  your AWS Environment.
known_false_positives: While this search has no known false positives, it is possible
  that it is a legitimate admin activity. Please consider filtering out these noisy events using userAgent, user_arn field names.
references:
- https://docs.aws.amazon.com/cli/latest/reference/guardduty/index.html
- https://docs.aws.amazon.com/cli/latest/reference/waf/index.html
tags:
  analytic_story:
  - AWS Defense Evasion
  asset_type: AWS Account
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 60
  context:
  - Source:Cloud Data
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.008/aws_delete_security_services/aws_cloudtrail_events.json
  impact: 70
  kill_chain_phases:
  - Actions on Objectives
  message: User $user_arn$ has made 
  mitre_attack_id:
  - T1562.008
  - T1562
  nist:
  - DE.CM
  observable:
  - name: src
    type: IP Address
    role:
    - Attacker
  - name: user_arn
    type: User
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time 
  - eventName
  - eventSource
  - user_agent
  - user_type
  - aws_account_id
  - src
  - region
  - errorCode
  risk_score: 42
  security_domain: threat