name: AWS IAM Root Account Login
id: c2f7330e-9315-11eb-b1d0-acde48001122
version: 1
date: '2021-04-01'
author: Michael Haag, Splunk
type: batch
datamodel: []
description: The following detection identifies the use of the account `root` on the given AWS instance. Per AWS best practices, this account should have MFA enabled and not used for day to day activity. 
search: '`cloudtrail` eventName=ConsoleLogin eventSource=signin.amazonaws.com userName=root (userAgent!=*.amazonaws.com)
| stats count min(_time) as firstTime max(_time) as lastTime values(responseElements.ConsoleLogin) as Console_login by src eventName eventSource aws_account_id errorCode userAgent eventID awsRegion userIdentity.principalId user_arn 
| `security_content_ctime(firstTime)`
| `security_content_ctime(lastTime)` 
| `aws_iam_root_account_login_filter`'
how_to_implement: The Splunk AWS Add-on and Splunk App for AWS is required to utilize this data. The search requires AWS Cloudtrail logs.
known_false_positives: False positives should be limited as the root account should not be used in day to day activity. The detection may be filtered down based on the `action` field - success / failure.
references:
- https://docs.aws.amazon.com/IAM/latest/UserGuide/id_root-user.html
tags:
  analytic_story:
  - AWS IAM Privilege Escalation
  dataset: []
  kill_chain_phases:
  - Intrusion
  mitre_attack_id:
  - T1078.004
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  - Splunk Security Analytics for AWS
  required_fields:
  - _time
  - eventName
  - userAgent
  - errorCode
  security_domain: access