name: AWS Console Logins From Multiple IPs
id: 395e50e1-2b87-4fa3-8632-0dfbdcbcd2cb
version: 1
date: '2023-01-19'
author: Bhavin Patel, Splunk
type: Anomaly
datamodel: 
- Authentication
description: This search looks for AWS CloudTrail authentication events where there are successfull AWS Console Login events from 2 or more different source IP addresses within a span of 10 mins. Often times, attackers with start with a phishing campaigns to commpromise cloud user accounts and would proceeed with trying to those use credentials before they would potentially expire or if the user rotates their credential then its no longer valid. Detecting successfull login attempts in from a short time window is a strong indicator of malicious behavior. 
search: '| tstats earliest(_time) as firstTime latest(_time) as lastTime  dc(Authentication.src) as distinct_ip_count values(Authentication.src) as src_ip values(Authentication.user_agent) as user_agent values(Authentication.action) as action from datamodel=Authentication
  where Authentication.signature=ConsoleLogin by _time span=10m Authentication.user Authentication.user_type 
| `drop_dm_object_name(Authentication)`  
|  where distinct_ip_count >= 2 |  `aws_console_logins_from_multiple_ips_filter`'
how_to_implement: You must install Splunk AWS add on and Splunk App for AWS. This
  search works when AWS CloudTrail events are normalized use the Authentication datamodel.
known_false_positives: It is highly unlikely to have two login attempts from entirely differnt IP addresses.  
references:
- https://rhinosecuritylabs.com/aws/mfa-phishing-on-aws/
tags:
  analytic_story:
  - Suspicious AWS Login Activities
  - Compromised User Account
  asset_type: AWS Account
  cis20:
  - CIS 13
  confidence: 80
  context:
  - Source:Cloud Data
  - Scope:External
  - Outcome:Allowed
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1586.003/aws_console_login_multiple_ips/cloudtrail.json
  impact: 90
  kill_chain_phases:
  - Actions on Objectives
  message: User $user$ has successfully logged into the AWS Console from different IP addresses $src$ with 5 mins
  mitre_attack_id:
  - T1586
  - T1535
  nist:
  - PR.DS
  - PR.AC
  - DE.CM
  observable:
  - name: src
    type: IP Address
    role:
    - Attacker
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Authentication.src
  - Authentication.user
  - Authentication.signature
  - Authentication.user_agent
  - Authentication.action 
  - Authentication.user_type
  risk_score: 72
  security_domain: threat
