name: AWS IAM List Roots
id: 7acd4d9c-77a5-11eb-8936-acde48001122
version: 1
date: '2021-02-25'
author: Rod Soto
type: batch
datamodel:
- Authentication
description: UPDATE_DESCRIPTION
search: 'sourcetype=aws:cloudtrail eventSource=organizations.amazonaws.com eventName=ListRoots | stats count min(_time) as firstTime max(_time) as lastTime by awsRegion eventName errorCode errorMessage sourceIPAddress userAgent userIdentity.accessKeyId userIdentity.arn userName command | `aws_iam_list_roots_filter`'
how_to_implement: UPDATE_HOW_TO_IMPLEMENT
known_false_positives: UPDATE_KNOWN_FALSE_POSITIVES
references:
tags:
  analytic_story:
  - UPDATE_STORY_NAME
  dataset:
  - UPDATE_DATASET_URL
  kill_chain_phases:
  - Lateral Movement
  mitre_attack_id:
  - T1087.004
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  