name: AWS Excessive Security Scanning
id: 1fdd164a-def8-4762-83a9-9ffe24e74d5a
version: 1
date: '2021-04-13'
author: Patrick Bareiss, Splunk
type: TTP
datamodel: []
description: This search looks for AWS CloudTrail events and analyse the amount of
  eventNames which starts with Describe by a single user. This indicates that this
  user scans the configuration of your AWS cloud environment.
search: '
  `o365_management_activity` Workload=AzureActiveDirectory UserAuthenticationMethod=* status=failure
  | stats count earliest(_time) as firstTime latest(_time) values(UserAuthenticationMethod) AS UserAuthenticationMethod values(UserAgent) AS UserAgent values(status) AS status values(src_ip) AS src_ip by user 
  | where count > 10 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | `o365_excessive_authentication_failures_alert_filter`'
how_to_implement: You must install splunk AWS add on and Splunk App for AWS. This
  search works with AWS CloudTrail logs.
known_false_positives: While this search has no known false positives.
references:
- https://github.com/aquasecurity/cloudsploit
tags:
  analytic_story:
  - AWS User Monitoring
  asset_type: AWS Account
  automated_detection_testing: passed
  cis20:
  - CIS 13
  confidence: 60
  context:
  - Source:Cloud Data
  - Scope:Inbound
  - Stage:Recon
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1526/aws_security_scanner/aws_security_scanner.json
  impact: 30
  kill_chain_phases:
  - Actions on Objectives
  message: user $user$ has excessive number of api calls $dc_events$ from these IP
    addresses $src$, violating the threshold of 50,  using the following commands
    $command$.
  mitre_attack_id:
  - T1526
  nist:
  - PR.DS
  - PR.AC
  - DE.CM
  observable:
  - name: src
    type: IP Address
    role:
    - Attacker
  - name: user
    type: User
    role:
    - Attacker
  product:
  - Splunk Security Analytics for AWS
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - eventName
  - src
  - userAgent
  - user
  - userIdentity.arn
  risk_object: src
  risk_object_type: system
  risk_score: 18
  security_domain: network
