name: Cloud Instance Modified By Previously Unseen User
id: 7fb15084-b14e-405a-bd61-a6de15a40722
version: 2
date: '2024-05-17'
author: Rico Valdez, Splunk
status: experimental
type: Anomaly
description: The following analytic identifies cloud instances being modified by users
  who have not previously modified them. It leverages data from the Change data model,
  focusing on successful modifications of EC2 instances. This activity is significant
  because it can indicate unauthorized or suspicious changes by potentially compromised
  or malicious users. If confirmed malicious, this could lead to unauthorized access,
  configuration changes, or potential disruption of cloud services, posing a significant
  risk to the organization's cloud infrastructure.
data_source: 
- AWS CloudTrail
search: '| tstats `security_content_summariesonly` count earliest(_time) as firstTime,
  latest(_time) as lastTime values(All_Changes.object_id) as object_id values(All_Changes.command)
  as command from datamodel=Change where All_Changes.action=modified All_Changes.change_type=EC2
  All_Changes.status=success by All_Changes.user | `drop_dm_object_name("All_Changes")`
  | lookup previously_seen_cloud_instance_modifications_by_user user as user OUTPUTNEW
  firstTimeSeen, enough_data | eventstats max(enough_data) as enough_data | where
  enough_data=1 | eval firstTimeSeenUser=min(firstTimeSeen) | where isnull(firstTimeSeenUser)
  OR firstTimeSeenUser > relative_time(now(), "-24h@h") | table firstTime user command
  object_id count | `security_content_ctime(firstTime)` | `cloud_instance_modified_by_previously_unseen_user_filter`'
how_to_implement: This search has a dependency on other searches to create and update
  a baseline of users observed to be associated with this activity. The search "Previously
  Seen Cloud Instance Modifications By User - Update" should be enabled for this detection
  to properly work.
known_false_positives: It's possible that a new user will start to modify EC2 instances
  when they haven't before for any number of reasons. Verify with the user that is
  modifying instances that this is the intended behavior.
references: []
tags:
  analytic_story:
  - Suspicious Cloud Instance Activities
  asset_type: AWS Instance
  confidence: 60
  impact: 70
  message: User $user$ is modifying an instance $object_id$ for the first time.
  mitre_attack_id:
  - T1078.004
  - T1078
  observable:
  - name: user
    type: User
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Changes.object_id
  - All_Changes.command
  - All_Changes.action
  - All_Changes.change_type
  - All_Changes.status
  - All_Changes.user
  risk_score: 42
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/suspicious_behaviour/abnormally_high_cloud_instances_launched/cloudtrail_behavioural_detections.json
    sourcetype: aws:cloudtrail
    source: aws_cloudtrail
    update_timestamp: true
