name: Cloud Compute Instance Created With Previously Unseen Image
id: bc24922d-987c-4645-b288-f8c73ec194c4
version: 1
date: '2018-10-12'
author: David Dorsey, Splunk
status: experimental
type: Anomaly
description: |-
  The following analytic detects potential instances that are created in a cloud computing environment using new or unknown image IDs that have not been seen before. This detection is important because it helps to investigate and take appropriate action to prevent further damage or unauthorized access to the Cloud environment, which can include data breaches, unauthorized access to sensitive information, or the deployment of malicious payloads within the cloud environment. False positives might occur since legitimate instances can also have previously unseen image IDs. Next steps include conducting an extensive triage and investigation to determine the nature of the activity. During triage, review the details of the created instances, including the user responsible for the creation, the image ID used, and any associated metadata. Additionally, consider inspecting any relevant on-disk artifacts and analyzing concurrent processes to identify the source of the attack.
data_source: []
search: '| tstats count earliest(_time) as firstTime, latest(_time) as lastTime values(All_Changes.object_id)
  as dest from datamodel=Change where All_Changes.action=created by All_Changes.Instance_Changes.image_id,
  All_Changes.user | `drop_dm_object_name("All_Changes")` | `drop_dm_object_name("Instance_Changes")`
  | where image_id != "unknown" | lookup previously_seen_cloud_compute_images image_id
  as image_id OUTPUT firstTimeSeen, enough_data | eventstats max(enough_data) as enough_data
  | where enough_data=1 | eval firstTimeSeenImage=min(firstTimeSeen) | where isnull(firstTimeSeenImage)
  OR firstTimeSeenImage > relative_time(now(), "-24h@h") | table firstTime, user,
  image_id, count, dest | `security_content_ctime(firstTime)` | `cloud_compute_instance_created_with_previously_unseen_image_filter`'
how_to_implement: You must be ingesting your cloud infrastructure logs from your cloud
  provider. You should run the baseline search `Previously Seen Cloud Compute Images
  - Initial` to build the initial table of images observed and times. You must also
  enable the second baseline search `Previously Seen Cloud Compute Images - Update`
  to keep this table up to date and to age out old data. You can also provide additional
  filtering for this search by customizing the `cloud_compute_instance_created_with_previously_unseen_image_filter`
  macro.
known_false_positives: After a new image is created, the first systems created with
  that image will cause this alert to fire.  Verify that the image being used was
  created by a legitimate user.
references: []
tags:
  analytic_story:
  - Cloud Cryptomining
  asset_type: Cloud Compute Instance
  confidence: 60
  impact: 60
  message: User $user$ is creating an instance $dest$ with an image that has not been
    previously seen.
  observable:
  - name: user
    type: User
    role:
    - Attacker
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Changes.object_id
  - All_Changes.action
  - All_Changes.Instance_Changes.image_id
  - All_Changes.user
  risk_score: 36
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/suspicious_behaviour/abnormally_high_cloud_instances_launched/cloudtrail_behavioural_detections.json
    sourcetype: aws:cloudtrail
    source: aws_cloudtrail
    update_timestamp: true
