name: Cloud Cryptomining Story Search
id: bdf1d795-abcb-489f-922a-7bf9ceeee573
version: 1
date: '2020-01-20'
description: This search looks for cloud compute instances being created with previously
  unseen image IDs.
how_to_implement: You must be ingesting your cloud infrastructure logs from your cloud
  provider. You should run the baseline search `Previously Seen Cloud Compute Images
  - Initial` to build the initial table of images observed and times. You must also
  enable the second baseline search `Previously Seen Cloud Compute Images - Update`
  to keep this table up to date and to age out old data. You can also provide additional
  filtering for this search by customizing the `cloud_compute_instance_created_with_previously_unseen_image_filter`
  macro.
type: ESCU
references: []
author: David Dorsey, Splunk
search:  '`risk_index` annotations.analytics_story="Cloud Cryptomining" | stats earliest(_time) as firstTime, latest(_time) as lastTime, sum(risk_score) as story_risk values(search_name) as detections values(vendor_region) as region values(instance_type) as instance_type values(image_id) as image_id values(object_id) as object_ids by risk_object, annotations.analytics_story |  where story_risk > 100 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` |  rename annotations.analytics_story as analytic_story | table firstTime, lastTime, analytic_story, detections, story_risk, region, instance_type, image_id, object_ids | `cloud_cryptomining_story_search_filter`'
known_false_positives: After a new image is created, the first systems created with
  that image will cause this alert to fire.  Verify that the image being used was
  created by a legitimate user.
tags:
  deployments:
  - Story Search
  analytics_story:
  - Cloud Cryptomining
  cis20:
  - CIS 1
  nist:
  - ID.AM
  security_domain: endpoint
  asset_type: Cloud Compute Instance
