name: Cloud API Calls From Previously Unseen User Roles
id: 2181ad1f-1e73-4d0c-9780-e8880482a08f
version: 1
date: '2020-09-04'
description: This search builds a table of the first and last times seen for every
  user role and command combination. This is broadly defined as any event that runs
  or creates something. This table is then cached.

description: This search looks for new commands from each user role.
how_to_implement:  You must be ingesting your cloud infrastructure logs from your 
  cloud provider.  You should run the baseline search `Previously Seen Cloud API Calls Per User Role - Initial`
  to build the initial table of user roles, commands, and times. You must also enable the second
  baseline search `Previously Seen Cloud API Calls Per User Role - Update` to keep this table up to date and
  to age out old data. You can adjust the time window for this search by updating the
  `cloud_api_calls_from_previously_unseen_user_roles_activity_window` macro. You can also
  provide additional filtering for this search by
  customizing the `cloud_api_calls_from_previously_unseen_user_roles_filter`
type: ESCU
references: []
author: David Dorsey, Splunk
search: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime from datamodel=Change 
  where All_Changes.user_type=AssumedRole AND All_Changes.status=success
  by All_Changes.user, All_Changes.command | `drop_dm_object_name("All_Changes")`
  | lookup previously_seen_cloud_api_calls_per_user_role user as user, command as command OUTPUT firstTimeSeen, enough_data
  | eventstats max(enough_data) as enough_data 
  | where enough_data=1
  | eval firstTimeSeenUserApiCall=min(firstTimeSeen)
  | where isnull(firstTimeSeenUserApiCall) OR firstTimeSeenUserApiCall > relative_time(now(), `cloud_api_calls_from_previously_unseen_user_roles_activity_window`)
  | table firstTime, user, object, command
  | `cloud_api_calls_from_previously_unseen_user_roles_filter`'
known_false_positives: "."
tags:
  analytics_story:
  - Suspicious Cloud User Activities
  cis20:
  - CIS 1
  nist:
  - ID.AM
  mitre_attack_id:
  - T1078
  security_domain: endpoint
  asset_type: AWS Instance
  risk_score: 25
  risk_object_type: user
  risk_object: user
