author: Rico Valdez, Splunk
date: '2020-07-29'
description: This search looks for cloud instances being modified by users who have
  not previously modified them.
how_to_implement: This search has a dependency on other searches to create and update
  a baseline of users observed to be associated with this activity. The search "Previously
  Seen Cloud Instance Modifications By User - Update" should be enabled for this detection
  to properly work.
id: 7fb15084-b14e-405a-bd61-a6de15a40722
known_false_positives: It's possible that a new user will start to modify EC2 instances
  when they haven't before for any number of reasons. Verify with the user that is
  modifying instances that this is the intended behavior.
name: Cloud Instance Modified By Previously Unseen User
references: []
search: '| tstats `security_content_summariesonly` count earliest(_time) as firstTime,
  latest(_time) as lastTime values(All_Changes.object_id) as object_id values(All_Changes.command)
  as command from datamodel=Change where All_Changes.action=modified All_Changes.change_type=EC2
  All_Changes.status=success by All_Changes.user | `drop_dm_object_name("All_Changes")`
  | lookup previously_seen_cloud_instance_modifications_by_user user as user OUTPUTNEW
  firstTimeSeen, enough_data | eventstats max(enough_data) as enough_data | where
  enough_data=1 | eval firstTimeSeenUser=min(firstTimeSeen) | where isnull(firstTimeSeenUser)
  OR firstTimeSeenUser > relative_time(now(), "-24h@h") | table firstTime user command
  object_id count | `security_content_ctime(firstTime)` | `cloud_instance_modified_by_previously_unseen_user_filter`'
tags:
  analytic_story:
  - Suspicious Cloud Instance Activities
  asset_type: AWS Instance
  automated_detection_testing: passed
  cis20:
  - CIS 1
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/suspicious_behaviour/abnormally_high_cloud_instances_launched/cloudtrail_behavioural_detections.json
  mitre_attack_id:
  - T1078.004
  nist:
  - ID.AM
  product:
  - Splunk Security Analytics for AWS
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_object: user
  risk_object_type: user
  risk_score: 10
  security_domain: endpoint
type: batch
version: 1
