name: Cloud Instance Modified By Previously Unseen User
id: 7fb15084-b14e-405a-bd61-a6de15a40722
version: 1
date: '2020-07-29'
description: This search looks for cloud instances being modified by users who have
  not previously modified them.
how_to_implement: This search has a dependency on other searches to create and update a
  baseline of users observed to be associated with this activity. The search 
  "Previously Seen Cloud Instance Modifications By User - Update" should be enabled for 
  this detection to properly work.
type: ESCU
references: []
author: Rico Valdez, Splunk

search: '| tstats `security_content_summariesonly` earliest(_time) as firstTime, latest(_time)
  as lastTime values(All_Changes.object_id) as Instances from datamodel=Change.All_Changes
  where All_Changes.action=modified by All_Changes.user | `drop_dm_object_name("All_Changes")`
  | eval enough_data = 0
  | inputlookup append=t previously_seen_cloud_instance_modifications_by_user | stats
  min(firstTime) as firstTime max(lastTime) as lastTime max(enough_data) as enough_data, 
  values(Instances) as Instances by user
  | eval new_user=if(firstTime >= relative_time(now(), `previously_seen_cloud_instance_modifications_by_user_search_window_begin_offset`),
  1, 0) | where new_user=1 AND enough_data=1| `security_content_ctime(firstTime)`|`security_content_ctime(lastTime)`]
  | table src_user, dest, firstTime, lastTime | `cloud_instance_modified_by_previously_unseen_user_filter`'

known_false_positives: It's possible that a new user will start to modify EC2 instances
  when they haven't before for any number of reasons. Verify with the user that is
  modifying instances that this is the intended behavior.
tags:
  analytics_story:
  - Suspicious Cloud Instance Activities
  mitre_attack_id:
  - T1078.004
  cis20:
  - CIS 1
  nist:
  - ID.AM
  security_domain: endpoint
  asset_type: AWS Instance
  risk_score: 10
  risk_object_type: user
  risk_object: src_user

