name: Detect AWS Console Login by User from New Country
id: 67bd3def-c41c-4bf6-837b-ae196b4257c6
version: 1
date: '2020-10-07'
description: This search looks for CloudTrail events wherein a console login event
  by a user was recorded within the last hour, then compares the event to a lookup
  file of previously seen users (by ARN values) who have logged into the console.
  The alert is fired if the user has logged into the console for the first time within
  the last hour
how_to_implement: "You must be ingesting your cloud infrastructure logs from your
  cloud provider. You should run the baseline search `Previously seen users in CloudTrail - Initial`
  to build the initial table of source IP address, geographic locations, and times. You must also enable the second
  baseline search `Previously Seen users in Cloudtrail - Update` to keep this table up to date and
  to age out old data. You can also provide additional filtering for this search by
  customizing the `detect_aws_console_login_by_user_from_new_country_filter` macro."
type: ESCU
author: Bhavin Patel, Splunk
search: '| tstats earliest(_time) as firstTime latest(_time) as lastTime from datamodel=Authentication where Authentication.signature=ConsoleLogin by Authentication.user Authentication.src 
| iplocation Authentication.src 
| `drop_dm_object_name(Authentication)` 
| table firstTime lastTime user Country
| join user  type=outer 
    [| inputlookup previously_seen_users_console_logins 
    | stats earliest(firstTime) AS earliestseen by user Country
    | fields earliestseen user Country]
| eval userCountry=if(firstTime >= relative_time(now(), "@d"), "New Country","Previously Seen Country") 
| eval userStatus=if(earliestseen >= relative_time(now(), "@d") OR isnull(earliestseen), "New User","Old User")
| where userCountry = "New Country" AND userStatus != "Old User"
| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)`
| table firstTime lastTime user Country  userStatus userCountry  | `detect_aws_console_login_by_user_from_new_country_filter`'
known_false_positives: When a legitimate new user logins for the first time, this
  activity will be detected. Check how old the account is and verify that the user
  activity is legitimate.
tags:
  analytics_story:
  - Suspicious AWS Login Activities
  - Suspicious Cloud Authentication Activities
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1535
  cis20:
  - CIS 16
  nist:
  - DE.DP
  - DE.AE
  security_domain: network
  asset_type: AWS Instance
  risk_score: 5
  risk_object_type: user
  risk_object: user

