name: Detect AWS Console Login by New User
id: bc91a8cd-35e7-4bb2-6140-e756cc46fd71
version: 3
date: '2022-05-10'
author: Rico Valdez, Splunk
status: experimental
type: Hunting
description: This search looks for AWS CloudTrail events wherein a console login event
  by a user was recorded within the last hour, then compares the event to a lookup
  file of previously seen users (by ARN values) who have logged into the console.
  The alert is fired if the user has logged into the console for the first time within
  the last hour
data_source: []
search: '| tstats earliest(_time) as firstTime latest(_time) as lastTime from datamodel=Authentication
  where Authentication.signature=ConsoleLogin by Authentication.user | `drop_dm_object_name(Authentication)`
  | join user type=outer [ | inputlookup previously_seen_users_console_logins | stats
  min(firstTime) as earliestseen by user] | eval userStatus=if(earliestseen >= relative_time(now(),
  "-24h@h") OR isnull(earliestseen), "First Time Logging into AWS Console", "Previously
  Seen User") | where userStatus="First Time Logging into AWS Console" | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `detect_aws_console_login_by_new_user_filter`'
how_to_implement: You must install and configure the Splunk Add-on for AWS (version
  5.1.0 or later) and Enterprise Security 6.2, which contains the required updates
  to the Authentication data model for cloud use cases. Run the `Previously Seen Users
  in CloudTrail - Initial` support search only once to create a baseline of previously
  seen IAM users within the last 30 days. Run `Previously Seen Users in CloudTrail
  - Update` hourly (or more frequently depending on how often you run the detection
  searches) to refresh the baselines.
known_false_positives: When a legitimate new user logins for the first time, this
  activity will be detected. Check how old the account is and verify that the user
  activity is legitimate.
references: []
tags:
  analytic_story:
  - Suspicious Cloud Authentication Activities
  - AWS Identity and Access Management Account Takeover
  asset_type: AWS Instance
  confidence: 60
  impact: 50
  message: User $user$ is logging into the AWS console for the first time
  mitre_attack_id:
  - T1586
  - T1586.003
  - T1552
  observable:
  - name: user
    type: User
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Authentication.signature
  - Authentication.user
  risk_score: 30
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/suspicious_behaviour/abnormally_high_cloud_instances_launched/cloudtrail_behavioural_detections.json
    sourcetype: aws:cloudtrail
    source: aws_cloudtrail
    update_timestamp: true
