name: Detect AWS Console Login by User from New Country
id: 67bd3def-c41c-4bf6-837b-ae196b4257c6
version: 1
date: '2020-10-07'
description: This search looks for CloudTrail events wherein a console login event
  by a user was recorded within the last hour, then compares the event to a lookup
  file of previously seen users (by ARN values) who have logged into the console.
  The alert is fired if the user has logged into the console for the first time within
  the last hour
how_to_implement: You must install and configure the Splunk Add-on for AWS (version
  5.1.0 or later) and Enterprise Security 6.2, which contains the required updates
  to the Authentication data model for cloud use cases. Run the `Previously Seen Users in CloudTrail - Initial` support search only once to create a baseline of previously seen
  IAM users within the last 30 days. Run `Previously Seen Users in CloudTrail - Update`
  hourly (or more frequently depending on how often you run the detection searches)
  to refresh the baselines. You
  can also provide additional filtering for this search by customizing the `detect_aws_console_login_by_user_from_new_country_filter`
  macro.
type: ESCU
author: Bhavin Patel, Splunk
search: '| tstats earliest(_time) as firstTime latest(_time) as lastTime from datamodel=Authentication
  where Authentication.signature=ConsoleLogin by Authentication.user Authentication.src
  | iplocation Authentication.src | `drop_dm_object_name(Authentication)` | table
  firstTime lastTime user Country | join user  type=outer [| inputlookup previously_seen_users_console_logins
  | stats earliest(firstTime) AS earliestseen by user Country | fields earliestseen
  user Country] | eval userCountry=if(firstTime >= relative_time(now(), "-24h@h"),
  "New Country","Previously Seen Country") | eval userStatus=if(earliestseen >= relative_time(now(),"-24h@h")
  OR isnull(earliestseen), "New User","Old User") | where userCountry = "New Country"
  AND userStatus != "Old User" | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | table firstTime lastTime user Country  userStatus userCountry  | `detect_aws_console_login_by_user_from_new_country_filter`'
known_false_positives: When a legitimate new user logins for the first time, this
  activity will be detected. Check how old the account is and verify that the user
  activity is legitimate.
tags:
  analytics_story:
  - Suspicious AWS Login Activities
  - Suspicious Cloud Authentication Activities
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1535
  cis20:
  - CIS 16
  nist:
  - DE.DP
  - DE.AE
  product:
  - Splunk Security Analytics for AWS
  security_domain: network
  asset_type: AWS Instance
  risk_score: 5
  risk_object_type: user
  risk_object: user
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/suspicious_behaviour/abnormally_high_cloud_instances_launched/cloudtrail_behavioural_detections.json
