name: GCP Successful Single-Factor Authentication
id: 40e17d88-87da-414e-b253-8dc1e4f9555b
version: 3
date: '2024-05-25'
author: Bhavin Patel, Mauricio Velazco, Splunk
status: production
type: TTP
description: The following analytic identifies a successful single-factor authentication
  event against Google Cloud Platform (GCP) for an account without Multi-Factor Authentication
  (MFA) enabled. It uses Google Workspace login event data to detect instances where
  MFA is not utilized. This activity is significant as it may indicate a misconfiguration,
  policy violation, or potential account takeover attempt. If confirmed malicious,
  an attacker could gain unauthorized access to GCP resources, potentially leading
  to data breaches, service disruptions, or further exploitation within the cloud
  environment.
data_source:
- Google Workspace login_success
search: '`gws_reports_login` event.name=login_success NOT `gws_login_mfa_methods`
  | stats count min(_time) as firstTime max(_time) as lastTime by user, src_ip,  login_challenge_method,
  app, event.name, vendor_account, action |`security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`|
  `gcp_successful_single_factor_authentication_filter`'
how_to_implement: You must install the latest version of Splunk Add-on for Google
  Workspace from Splunkbase (https://splunkbase.splunk.com/app/5556) which allows
  Splunk administrators to collect Google Workspace event data in Splunk using Google
  Workspace APIs. Specifically, this analytic leverages the User log events.
known_false_positives: Although not recommended, certain users may be required without
  multi-factor authentication. Filter as needed
references:
- https://attack.mitre.org/techniques/T1078/004/
- https://support.google.com/a/answer/175197?hl=en
- https://www.forbes.com/sites/daveywinder/2020/07/08/new-dark-web-audit-reveals-15-billion-stolen-logins-from-100000-breaches-passwords-hackers-cybercrime/?sh=69927b2a180f
tags:
  analytic_story:
  - GCP Account Takeover
  asset_type: Google Cloud Platform tenant
  confidence: 90
  impact: 50
  message: Successful authentication for user $user$ without MFA
  mitre_attack_id:
  - T1586
  - T1586.003
  - T1078
  - T1078.004
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: src_ip
    type: IP Address
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - event.name
  - event.parameters{}.multiValue{}
  - user
  - src_ip
  - login_challenge_method
  risk_score: 45
  security_domain: identity
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1078.004/gcp_single_factor_auth/gws_login.log
    source: gws:reports:login
    sourcetype: gws:reports:login
    update_timestamp: true
