name: Kubernetes AWS detect suspicious kubectl calls
id: 042a3d32-8318-4763-9679-09db2644a8f2
version: 2
date: '2022-11-11'
author: Rod Soto, Splunk
status: experimental
type: Hunting
description: This search provides information on anonymous Kubectl calls with IP,
  verb namespace and object access context
data_source: []
search: '`aws_cloudwatchlogs_eks` userAgent=kubectl* sourceIPs{}!=127.0.0.1 sourceIPs{}!=::1
  src_user=system:anonymous  | stats  count by src_ip src_user verb userAgent requestURI
  |`kubernetes_aws_detect_suspicious_kubectl_calls_filter`'
how_to_implement: You must install splunk AWS add on and Splunk App for AWS. This
  search works with cloudwatch logs.
known_false_positives: Kubectl calls are not malicious by nature. However source IP,
  verb and Object can reveal potential malicious activity, specially anonymous suspicious
  IPs and sensitive objects such as configmaps or secrets
references: []
tags:
  analytic_story:
  - Kubernetes Sensitive Object Access Activity
  asset_type: Kubernetes
  confidence: 50
  impact: 50
  message: tbd
  observable:
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - userAgent
  - sourceIPs{}
  - src_user
  - src_ip
  - verb
  - requestURI
  risk_score: 25
  security_domain: threat
