name: O365 New Federated Domain Added
id: e155876a-6048-11eb-ae93-0242ac130002
version: 2
date: '2023-08-02'
author: Rod Soto, Splunk
status: production
type: TTP
description: The following search detects the addition of a new Federated domain in O365 environments.  If an attacker adds an unverified domain to Office 365, they may gain unauthorized access to the organization's email and other services, potentially leading to data breaches and information theft. It can be misused to set up adversary infrastruture for phishing, spoofing emails and malware distribution.
data_source: []
search: '`o365_management_activity` Operation IN ("*add*", "*new*") AND Operation="*domain*"
  | stats count values(ModifiedProperties{}.NewValue) as new_value by  user user_agent authentication_service action Workload Operation 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)`
  | `o365_new_federated_domain_added_filter`'
how_to_implement: You must install splunk Microsoft Office 365 add-on. This search
  works with o365:management:activity.
known_false_positives: The creation of a new Federated domain is not necessarily malicious,
  however these events need to be followed closely, as it may indicate federated credential
  abuse or backdoor via federated identities at a similar or different cloud provider.
references:
- https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/wp-m-unc2452-2021-000343-01.pdf
- https://www.cisa.gov/uscert/ncas/alerts/aa21-008a
- https://www.splunk.com/en_us/blog/security/a-golden-saml-journey-solarwinds-continued.html
- https://blog.sygnia.co/detection-and-hunting-of-golden-saml-attack?hsLang=en
- https://o365blog.com/post/aadbackdoor/
tags:
  analytic_story:
  - Office 365 Detections
  - Cloud Federated Credential Abuse
  asset_type: Office 365
  confidence: 80
  impact: 80
  message: User $user$ has added a new federated domain $new_value$
  mitre_attack_id:
  - T1136.003
  - T1136
  observable:
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Workload
  - Operation
  - ModifiedProperties{}.NewValue
  - authentication_service
  - user
  - user_agent
  - action
  risk_score: 64
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1136.003/o365_new_federated_domain_added/o365_add_federated_domain.log
    sourcetype: o365:management:activity
    source: o365
    update_timestamp: true
