name: O365 New Federated Domain Added
id: e155876a-6048-11eb-ae93-0242ac130002
version: 2
date: '2023-08-02'
author: Rod Soto, Splunk
status: production
type: TTP
description: |-
  The following analytic detects the addition of a new federated domain in an organization's Office 365 environment. Identifies instances where a new federated domain is added to the organization's Office 365 configuration and helps to take immediate action to mitigate the risks, prevent further unauthorized access, and protect the organization's data and systems. The detection is made by the Splunk query `o365_management_activity` with the parameters `Workload=Exchange` and `Operation="Add-FederatedDomain"`, which analyzes the management activity logs in Office 365 and filters for the specific operation to add a federated domain. The detection is important because identifying the addition of a new federated domain can indicate potential unauthorized access or compromise of the organization's Office 365 environment. A new Federated domain can be added by an attacker to gain unauthorized access, exfiltrate data, or carry out other malicious activity, which can lead to data breaches, unauthorized access to sensitive information, or compromise of the organization's systems and infrastructure. Next steps include viewing the details of the added federated domain, including the organization name, originating server, user ID, and user key. You must also capture and analyze any relevant on-disk artifacts. Additionally, you must identify the source of the attack by looking for concurrent processes or other indicators of compromise.
data_source: []
search: '`o365_management_activity` Operation IN ("*add*", "*new*") AND Operation="*domain*"
  | stats count values(ModifiedProperties{}.NewValue) as new_value by  user user_agent
  authentication_service action Workload Operation | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `o365_new_federated_domain_added_filter`'
how_to_implement: You must install splunk Microsoft Office 365 add-on. This search
  works with o365:management:activity.
known_false_positives: The creation of a new Federated domain is not necessarily malicious,
  however these events need to be followed closely, as it may indicate federated credential
  abuse or backdoor via federated identities at a similar or different cloud provider.
references:
- https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/wp-m-unc2452-2021-000343-01.pdf
- https://www.cisa.gov/uscert/ncas/alerts/aa21-008a
- https://www.splunk.com/en_us/blog/security/a-golden-saml-journey-solarwinds-continued.html
- https://blog.sygnia.co/detection-and-hunting-of-golden-saml-attack?hsLang=en
- https://o365blog.com/post/aadbackdoor/
tags:
  analytic_story:
  - Office 365 Detections
  - Cloud Federated Credential Abuse
  asset_type: Office 365
  confidence: 80
  impact: 80
  message: User $user$ has added a new federated domain $new_value$
  mitre_attack_id:
  - T1136.003
  - T1136
  observable:
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Workload
  - Operation
  - ModifiedProperties{}.NewValue
  - authentication_service
  - user
  - user_agent
  - action
  risk_score: 64
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1136.003/o365_new_federated_domain_added/o365_add_federated_domain.log
    sourcetype: o365:management:activity
    source: o365
    update_timestamp: true
