author: Rod Soto, Splunk
date: '2021-01-26'
description: This search detects accounts with high number of Single Sign ON (SSO) logon errors. Excessive logon errors
  may indicate attempts to bruteforce of password or single sign on token hijack or reuse.
how_to_implement: You must install splunk Microsoft Office 365 add-on. This search
  works with o365:management:activity
id: 8158ccc4-6038-11eb-ae93-0242ac130002
known_false_positives: Logon errors may not be malicious in nature however it may indicate attempts to reuse a token or password
  obtained via credential access attack.
name: O365 Excessive SSO logon errors
references:
- https://stealthbits.com/blog/bypassing-mfa-with-pass-the-cookie/
search: '`o365_management_activity`  Workload=AzureActiveDirectory LogonError=SsoArtifactInvalidOrExpired
  | stats count min(_time) as firstTime max(_time) as lastTime by LogonError ActorIpAddress UserAgent UserId
  | where count > 5
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `o365_excessive_sso_logon_errors_filter`'
tags:
  analytics_story:
  - Office 365 Detections
  - Cloud Federated Credential Abuse
  asset_type: Office 365
  kill_chain_phases:
  - Actions on Objective
  mitre_attack_id:
  - T1556
  security_domain: threat
type: ESCU
version: 1
