name: O365 Excessive SSO logon errors
id: 8158ccc4-6038-11eb-ae93-0242ac130002
version: 3
date: '2023-08-02'
author: Rod Soto, Splunk
status: production
type: Anomaly
description: The following analytic detects accounts with high number of Single Sign ON (SSO)
  logon errors. Excessive logon errors may indicate attempts to bruteforce of password or single sign on token hijack or reuse.
data_source: []
search: '`o365_management_activity` Workload=AzureActiveDirectory LogonError=*Sso* Operation=UserLoginFailed | stats count min(_time) as firstTime max(_time) as lastTime values(user) as user by  src_ip signature user_agent authentication_service action| where count >= 5 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `o365_excessive_sso_logon_errors_filter`'
how_to_implement: You must install splunk Microsoft Office 365 add-on. This search
  works with o365:management:activity
known_false_positives: Logon errors may not be malicious in nature however it may
  indicate attempts to reuse a token or password obtained via credential access attack.
references:
- https://stealthbits.com/blog/bypassing-mfa-with-pass-the-cookie/
tags:
  analytic_story:
  - Office 365 Account Takeover
  - Cloud Federated Credential Abuse
  asset_type: Office 365
  confidence: 80
  impact: 80
  message: Excessive number of SSO logon errors from $src_ip$ using UserAgent $user_agent$.
  mitre_attack_id:
  - T1556
  observable:
  - name: src_ip
    type: IP Address
    role:
    - Attacker
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - user
  - src_ip
  - Workload
  - LogonError
  - ActorIpAddress
  - UserAgent
  - UserId
  - authentication_service
  - authentication_method
  - Operation
  risk_score: 64
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1556/o365_sso_logon_errors/o365_sso_logon_errors2.json
    sourcetype: o365:management:activity
    source: o365
