name: O365 Add App Role Assignment Grant User
id: b2c81cc6-6040-11eb-ae93-0242ac130002
version: 2
date: '2023-07-11'
author: Rod Soto, Splunk
status: production
type: TTP
description: This search is designed to detect the creation of a new Federation setting by alerting on a specific event associated with its creation. 
  By monitoring for this event, the search can identify any instances where a Federation setting is being created within the system. 
  This can help in detecting and monitoring any unauthorized or suspicious changes to the Federation settings, 
  providing an additional layer of security for your environment.
data_source: []
search: '`o365_management_activity` Workload=AzureActiveDirectory Operation="Add app role assignment grant to user." 
  | stats count min(_time) as firstTime max(_time) as lastTime values(Actor{}.ID) as Actor.ID values(Actor{}.Type) as Actor.Type values(ModifiedProperties{}.Name) as modified_properties_name by user dest ResultStatus Operation
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `o365_add_app_role_assignment_grant_user_filter`'
how_to_implement: You must install splunk Microsoft Office 365 add-on. This search
  works with o365:management:activity
known_false_positives: The creation of a new Federation is not necessarily malicious,
  however this events need to be followed closely, as it may indicate federated credential
  abuse or backdoor via federated identities at a different cloud provider.
references:
- https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/wp-m-unc2452-2021-000343-01.pdf
- https://www.cisa.gov/uscert/ncas/alerts/aa21-008a
tags:
  analytic_story:
  - Office 365 Detections
  - Cloud Federated Credential Abuse
  asset_type: Office 365
  confidence: 60
  impact: 30
  message: User $user$ has created a new federation setting $modified_properties_name$ on $dest$
  mitre_attack_id:
  - T1136.003
  - T1136
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Workload
  - Operation
  - Actor{}.ID
  - Actor{}.Type
  - UserId
  - dest
  - ResultStatus
  risk_score: 18
  security_domain: threat
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1136.003/o365_new_federation/o365_new_federation.json
    sourcetype: o365:management:activity
    source: o365
