name: O365 Disable MFA
id: c783dd98-c703-4252-9e8a-f19d9f5c949e
version: 1
date: '2020-12-16'
author: Rod Soto, Splunk
type: batch
datamodel: []
description: This search detects when multi factor authentication has been disabled,
  what entitiy performed the action and against what user
search: '`o365_management_activity` Operation="Disable Strong Authentication." | stats
  count earliest(_time) as firstTime latest(_time) as lastTime by UserType Operation
  user status signature dest ResultStatus |`security_content_ctime(firstTime)` |`security_content_ctime(lastTime)`
  | `o365_disable_mfa_filter`'
how_to_implement: You must install splunk Microsoft Office 365 add-on. This search
  works with o365:management:activity
known_false_positives: Unless it is a special case, it is uncommon to disable MFA
  or Strong Authentication
references:
- https://attack.mitre.org/techniques/T1556/
tags:
  analytic_story:
  - Office 365 Detections
  asset_type: Office 365
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1556/o365_disable_mfa/o365_disable_mfa.json
  kill_chain_phases:
  - Actions on Objective
  mitre_attack_id:
  - T1556
  product:
  - Splunk Security Analytics for AWS
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Operation
  - UserType
  - user
  - status
  - signature
  - dest
  - ResultStatus
  risk_object: dest
  risk_object_type: system
  risk_score: 25
  impact: 
  confidence: 
  # (impact * confidence)/100
  risk_score: 
  context:
  - Source: Cloud Data
  - Scope: Internal, External, Inbound, Outbound, Local, Network
  - Outcome: Blocked, Allowed
  - Stage: Recon, Initial Access, Execution, Persistence, Privilege Escalation, Defense Evasion, Credential Access, Discovery, Lateral Movement, Collection, Exfiltration, Command And Control
  - Rares: Rare Process, Rare Device, Rare Domain, Rare Network, Rare Location
  - Other: Policy Violation

  message: 
  observable:
  - name: 
    type: Other, Unknown, Device, Container, Endpoint, Hostname, IP Address, User, Username,Email, Email Address , URL , URL Domain, File , File Name ,File Hash ,Process ,Process Name, Location

    role:
    - Other, Unknown, Actor, Target, Attacker, Victim, Parent Process, Child Process, Known Bad, Data Loss

  security_domain: threat
