name: O365 Add App Role Assignment Grant User
id: b2c81cc6-6040-11eb-ae93-0242ac130002
version: 1
date: '2021-01-26'
author: Rod Soto, Splunk
type: batch
datamodel: []
description: This search detects the creation of a new Federation setting by alerting
  about an specific event related to its creation.
search: '`o365_management_activity` Workload=AzureActiveDirectory Operation="Add app
  role assignment grant to user." | stats count min(_time) as firstTime max(_time)
  as lastTime values(Actor{}.ID) as Actor.ID values(Actor{}.Type) as Actor.Type by
  ActorIpAddress dest ResultStatus | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `o365_add_app_role_assignment_grant_user_filter`'
how_to_implement: You must install splunk Microsoft Office 365 add-on. This search
  works with o365:management:activity
known_false_positives: The creation of a new Federation is not necessarily malicious,
  however this events need to be followed closely, as it may indicate federated credential
  abuse or backdoor via federated identities at a different cloud provider.
references:
- https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/wp-m-unc2452-2021-000343-01.pdf
- https://us-cert.cisa.gov/ncas/alerts/aa21-008a
tags:
  analytic_story:
  - Office 365 Detections
  - Cloud Federated Credential Abuse
  asset_type: Office 365
  automated_detection_testing: passed
  confidence: 60
  context:
  - Source:Cloud Data
  - Scope:External
  - Outcome:Allowed
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1136.003/o365_new_federation/o365_new_federation.json
  impact: 30
  kill_chain_phases:
  - Actions on Objective
  message: User $Actor.ID$ has created a new federation setting on $dest$ from IP
    Address $ActorIpAddress$
  mitre_attack_id:
  - T1136.003
  observable:
  - name: ActorIpAddress
    type: IP Address
    role:
    - Attacker
  - name: Actor.ID
    type: User
    role:
    - Attacker
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Security Analytics for AWS
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Workload
  - Operation
  - Actor{}.ID
  - Actor{}.Type
  - ActorIpAddress
  - dest
  - ResultStatus
  risk_score: 18
  security_domain: threat
