author: Rod Soto, Splunk
datamodel: []
date: '2021-01-26'
description: This search detects the creation of a new Federation setting by alerting
  about an specific event related to its creation.
how_to_implement: You must install splunk Microsoft Office 365 add-on. This search
  works with o365:management:activity
id: 1668812a-6047-11eb-ae93-0242ac130002
known_false_positives: The creation of a new Federation is not necessarily malicious,
  however these events need to be followed closely, as it may indicate federated credential
  abuse or backdoor via federated identities at a different cloud provider.
name: O365 Added Service Principal
references:
- https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/wp-m-unc2452-2021-000343-01.pdf
- https://us-cert.cisa.gov/ncas/alerts/aa21-008a
- https://www.splunk.com/en_us/blog/security/a-golden-saml-journey-solarwinds-continued.html
- https://www.sygnia.co/golden-saml-advisory
search: '`o365_management_activity` Workload=AzureActiveDirectory signature="Add service
  principal credentials." | stats min(_time) as firstTime max(_time) as lastTime values(Actor{}.ID)
  as Actor.ID values(ModifiedProperties{}.Name) as ModifiedProperties.Name values(ModifiedProperties{}.NewValue)
  as ModifiedProperties.NewValue values(Target{}.ID) as Target.ID by ActorIpAddress
  signature | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `o365_added_service_principal_filter`'
tags:
  analytic_story:
  - Office 365 Detections
  - Cloud Federated Credential Abuse
  asset_type: Office 365
  automated_detection_testing: passed
  confidence: 60
  context:
  - Source:Cloud Data
  - Scope:External
  - Outcome:Allowed
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1136.003/o365_add_service_principal/o365_add_service_principal.json
  impact: 70
  kill_chain_phases:
  - Actions on Objective
  message: User $Actor.ID$ created a new federation setting on $Target.ID$ and added
    service principal credentials from IP Address $ActorIpAddress$
  mitre_attack_id:
  - T1136.003
  - T1136
  observable:
  - name: ActorIpAddress
    role:
    - Attacker
    type: IP Address
  - name: Target.ID
    role:
    - Victim
    type: Endpoint
  product:
  - Splunk Security Analytics for AWS
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - ActorIpAddress
  - Workload
  - _time
  - signature
  risk_score: 42
  security_domain: threat
type: TTP
version: 1
