name: Windows OS Credential Dumping Security Account Manager Reg
id: e9fb4a59-c5fb-440a-9f24-191fbc6b2911
version: 6
date: '2021-09-16'
author: Patrick Bareiss, Splunk
type: TTP
description: Monitor for execution of reg.exe with parameters specifying an export
  of keys that contain hashed credentials that attackers may try to crack offline.
data_source: Sysmon Event ID 1
search: '| tstats summariesonly=false allow_old_summaries=true fillnull_value="null"
  count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process_path IN ("*cmd.exe", "*reg.exe") Processes.process IN ("*HKEY_LOCAL_MACHINE\\Security*",
  "*HKEY_LOCAL_MACHINE\\SAM*", "*HKEY_LOCAL_MACHINE\\System*", "*HKLM\\Security*",
  "*HKLM\\System*", "*HKLM\\SAM*") Processes.process="*save*" by Processes.process_guid
  Processes.process_id Processes.process_path Processes.process Processes.process_current_directory
  Processes.user Processes.process_integrity_level Processes.process_hash Processes.parent_process_guid
  Processes.parent_process_id Processes.parent_process_path Processes.parent_process
  Processes.dest | `drop_dm_object_name(Processes)` | convert timeformat="%Y-%m-%dT%H:%M:%S"
  ctime(firstTime) | convert timeformat="%Y-%m-%dT%H:%M:%S" ctime(lastTime) | `windows_os_credential_dumping_security_account_manager_reg_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: None identified.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.002/T1003.002.md#atomic-test-1---registry-dump-of-sam-creds-and-secrets
tags:
  analytic_story:
  - Credential Dumping
  - DarkSide Ransomware
  - Windows Registry Abuse
  - Industroyer2
  asset_type: Endpoint
  confidence: 100
  impact: 90
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ attempting to export the registry keys.
  mitre_attack_id:
  - T1003.002
  - T1003
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  - Splunk Behavioral Analytics
  atomic_guid:
  - 5c2571d0-1572-416d-9676-812e64ca9f44
  risk_score: 90
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.002/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
