name: Detect DGA domains using Pretrained Deep Learning Model in DLTK
id: b4aefb5f-1037-410d-a149-1e091288ba33
version: 1
date: '2022-09-15'
author: Abhinav Mishra, Kumar Sharad and Namratha Sreekanta, Splunk
type: Anomaly
datamodel:
- Network_Resolution
description: 'The following analytic uses a pretrained deep learning classifier to detect DGA domains. The model is trained independently and the model file is available in AWS S3. A domain is classified as DGA generated when the domain name consists of unusual character sequences or concatenated english words. The model uses the domain name to anlayze patterns of character sequences along with custom features to classify a domain as DGA or not. The model takes a domain name consisting of second-level and top-level domain names as input and outputs a dga_score. Higher the dga_score, the more likely the input domain is a dga domain. The threshold for flagging a domain as dga is set at 0.5.'
search: "| tstats `security_content_summariesonly` values(DNS.answer) as IPs min(_time) as firstTime from datamodel=Network_Resolution by DNS.src, DNS.query 
| `drop_dm_object_name("DNS")` | rename query AS domain | fields domain | apply dga_model_dltk | rename pred_dga_proba AS dga_score | where dga_score>0.5 | table domain, dga_score" 
how_to_implement: This detection depends on the DSDL app which can be found here - https://splunkbase.splunk.com/app/4607/ and the Network Resolution datamodel which can be found here - https://splunkbase.splunk.com/app/1621/. The dga_score threshold is set at 0.5 and this should be adjusted based on the environment. The detection uses a pre-trained deep learning model that needs to be deployed in DLTK. Steps for deployment are outlined here - ** update gist here **.
known_false_positives: False positives may be present if suspicious behavior is observed, as determined by frequent usage of risky keywords.
references:
- https://docs.splunk.com/Documentation/Splunk/latest/Security/SPLsafeguards#Commands_that_trigger_the_warning
tags:
  analytic_story:
  - Splunk Vulnerabilities
  asset_type: Web Server
  cis20:
  - CIS 3
  - CIS 6
  confidence: 40
  cve:
  - CVE-2022-32154
  context:
  - Source:Network_Resolution
  dataset:
  - https://github.com/splunk/attack_data/raw/master/datasets/attack_techniques/T1203/search_activity.txt
  impact: 50
  kill_chain_phases:
  - Actions on Objectives
  message: A potentially a DGA domain $domain$ was detected, kindly review.
  mitre_attack_id:
  - T1059
  nist:
  - DE.AE
  observable:
  - name: src
    type: src
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - DNS.query 
  risk_score: 20
  security_domain: Network_Resolution
  