name: Detect suspicious DNS TXT records using pretrained model in DSDL
id: 92f65c3a-968c-11ed-a1eb-0242ac120002
version: 1
date: "2023-01-15"  
author: Abhinav Mishra, Kumar Sharad and Namratha Sreekanta, Splunk
type: Anomaly
datamodel:
- Network_Resolution
description: The following analytic uses a pre trained deep learning model to
  detect suspicious DNS TXT records. The model is trained independently and is
  then made available for download. The DNS TXT records are categorized into
  commonly identified types like email, verification, http using regular
  expressions https://www.tide-project.nl/blog/wtmc2020/. The TXT records that
  do not match regular expressions for well known types are labeled as 1 for
  "unknown/suspicious" and otherwise 0 for "not suspicious". The deep learning
  model we have developed uses DNS TXT responses to analyze patterns of character
  sequences to predict if a DNS TXT is suspicious or not. The higher the
  pred_is_unknown_proba, the more likely the DNS TXT record is suspicious.
  The threshold for flagging a domain as suspicious is set at 0.5.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime
  max(_time) as lastTime from datamodel=Network_Resolution where
  DNS.message_type=response AND DNS.record_type=TXT by DNS.src DNS.dest
  DNS.answer DNS.record_type 
  | `drop_dm_object_name("DNS")` 
  | rename answer as text 
  | fields firstTime, lastTime, message_type,record_type,src,dest, text 
  | apply detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl 
  | rename pred_is_unknown_proba as is_suspicious_score 
  | where is_suspicious_score > 0.5 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | rename src as "Source IP", dest as  "Destination IP", text as "DNS Answer", record_type as "DNS Record Type" 
  | table "Source IP","Destination IP","DNS Answer","DNS Record Type", firstTime, lastTime,is_suspicious_score
  | `detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl_filter`'

how_to_implement: 'Steps to deploy detect suspicious DNS TXT records model into Splunk App
    DSDL. This detection depends on the Splunk app for Data Science and Deep
    Learning which can be found here - https://splunkbase.splunk.com/app/4607/
    and the Network Resolution datamodel which can be found here -
    https://splunkbase.splunk.com/app/1621/. The detection uses a pre-trained
    deep learning model that needs to be deployed in DSDL app. Follow the steps
    for deployment here - `https://github.com/splunk/security_content/wiki/How-to-deploy-pre-trained-Deep-Learning-models-for-ESCU`.\

  * Download the `artifacts .tar.gz` file from the link - TODO update link here=
    Download the `detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.ipynb`
    Jupyter notebook from https://github.com/splunk/security_content/notebooks\

  * Login to the Jupyter Lab assigned for
    detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl container.
    This container should be listed on Containers page for DSDL app.\

  * Below steps need to be followed inside Jupyter lab \

      * Upload the detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.tar.gz file
        into `app/model/data` path using the upload option in the jupyter notebook.\

      * Untar the artifact detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.tar.gz using `tar -xf app/model/data/detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.tar.gz -C app/model/data`\

      * Upload detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.pynb into Jupyter lab notebooks folder using the upload option in Jupyter lab \

      * Save the notebook using the save option in jupyter notebook. \

      * Upload `detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.json` into `notebooks/data` folder.'
known_false_positives: False positives may be present if DNS TXT record contents
  are similar to benign DNS TXT record contents.
references:
- https://attack.mitre.org/techniques/T1071/004/
- https://unit42.paloaltonetworks.com/dns-tunneling-how-dns-can-be-abused-by-malicious-actors/
- https://en.wikipedia.org/wiki/TXT_record
tags:
  analytic_story:
  - DNS Hijacking
  - Suspicious DNS Traffic
  - Command and Control
  asset_type: Endpoint
  cis20:
  - CIS 8
  - CIS 12
  - CIS 13
  confidence: 90
  context:
    - Source:Endpoint
    - Stage:Command And Control
  impact: 50
  kill_chain_phases:
  - Command & Control
  message: A suspicious DNS TXT response was detected on host $src$ , kindly review.
  mitre_attack_id:
  - T1568.002
  nist:
  - PR.DS
  - PR.PT
  - DE.AE
  - DE.CM
  observable:
  - name: answer
    type: Other
    role:
      - Attacker
  - name: src
    type: Hostname
    role:
      - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - DNS.message_type
  - DNS.record_type
  - DNS.src
  - DNS.dest
  - DNS.answer
  risk_score: 45
  security_domain: network
