name: Protocols passing authentication in cleartext
id: 6923cd64-17a0-453c-b945-81ac2d8c6db9
version: 2
date: '2020-11-04'
author: Rico Valdez, Splunk
type: batch
datamodel:
- Network_Traffic
description: This search looks for cleartext protocols at risk of leaking credentials.
  Currently, this consists of legacy protocols such as telnet, POP3, IMAP, and non-anonymous
  FTP sessions. While some of these protocols can be used over SSL, they typically
  run on different assigned ports in those cases.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Network_Traffic where All_Traffic.transport="tcp" AND
  (All_Traffic.dest_port="23" OR All_Traffic.dest_port="143" OR All_Traffic.dest_port="110"
  OR (All_Traffic.dest_port="21" AND All_Traffic.user != "anonymous")) by All_Traffic.user
  All_Traffic.src All_Traffic.dest All_Traffic.dest_port | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `drop_dm_object_name("All_Traffic")` | `protocols_passing_authentication_in_cleartext_filter`'
how_to_implement: This search requires you to be ingesting your network traffic, and
  populating the Network_Traffic data model.
known_false_positives: Some networks may use kerberized FTP or telnet servers, however,
  this is rare.
references: []
tags:
  analytic_story:
  - Use of Cleartext Protocols
  asset_type: Endpoint
  cis20:
  - CIS 9
  - CIS 14
  kill_chain_phases:
  - Reconnaissance
  - Actions on Objectives
  nist:
  - PR.PT
  - DE.AE
  - PR.AC
  - PR.DS
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: network
