name: Protocols passing authentication in cleartext
id: 6923cd64-17a0-453c-b945-81ac2d8c6db9
version: 3
date: '2021-08-19'
author: Rico Valdez, Splunk
type: TTP
datamodel:
- Network_Traffic
description: The following analytic identifies cleartext protocols at risk of leaking
  sensitive information. Currently, this consists of legacy protocols such as telnet
  (port 23), POP3 (port 110), IMAP (port 143), and non-anonymous FTP (port 21) sessions.
  While some of these protocols may be used over SSL, they typically are found on
  different assigned ports in those instances.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Network_Traffic where All_Traffic.action!=blocked AND
  All_Traffic.transport="tcp" AND (All_Traffic.dest_port="23" OR All_Traffic.dest_port="143"
  OR All_Traffic.dest_port="110" OR (All_Traffic.dest_port="21" AND All_Traffic.user
  != "anonymous")) by All_Traffic.user All_Traffic.src All_Traffic.dest All_Traffic.dest_port
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `drop_dm_object_name("All_Traffic")`
  | `protocols_passing_authentication_in_cleartext_filter`'
how_to_implement: This search requires you to be ingesting your network traffic, and
  populating the Network_Traffic data model. For more accurate result it's better
  to limit destination to organization private and public IP range, like All_Traffic.dest
  IN(192.168.0.0/16,172.16.0.0/12,10.0.0.0/8, x.x.x.x/22)
known_false_positives: Some networks may use kerberized FTP or telnet servers, however,
  this is rare.
references:
- https://www.rackaid.com/blog/secure-your-email-and-file-transfers/
- https://www.infosecmatter.com/capture-passwords-using-wireshark/
tags:
  analytic_story:
  - Use of Cleartext Protocols
  asset_type: Endpoint
  cis20:
  - CIS 9
  - CIS 14
  kill_chain_phases:
  - Reconnaissance
  - Actions on Objectives
  nist:
  - PR.PT
  - DE.AE
  - PR.AC
  - PR.DS
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Traffic.transport
  - All_Traffic.dest_port
  - All_Traffic.user
  - All_Traffic.src
  - All_Traffic.dest
  - All_Traffic.action
  security_domain: network
  confidence: 50
  impact: 50
  risk_score: 25
  context: []
  message: tbd
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
