name: Remote Desktop Network Traffic
id: 272b8407-842d-4b3d-bead-a704584003d3
version: 3
date: '2020-07-07'
author: David Dorsey, Splunk
type: Anomaly
datamodel:
- Network_Traffic
description: This search looks for network traffic on TCP/3389, the default port used
  by remote desktop. While remote desktop traffic is not uncommon on a network, it
  is usually associated with known hosts. This search will ignore common RDP sources
  and common RDP destinations so you can focus on the uncommon uses of remote desktop
  on your network.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Network_Traffic where All_Traffic.dest_port=3389 AND
  All_Traffic.dest_category!=common_rdp_destination AND All_Traffic.src_category!=common_rdp_source
  by All_Traffic.src All_Traffic.dest All_Traffic.dest_port | `drop_dm_object_name("All_Traffic")`
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `remote_desktop_network_traffic_filter` '
how_to_implement: To successfully implement this search you need to identify systems
  that commonly originate remote desktop traffic and that commonly receive remote
  desktop traffic. You can use the included support search "Identify Systems Creating
  Remote Desktop Traffic" to identify systems that originate the traffic and the search
  "Identify Systems Receiving Remote Desktop Traffic" to identify systems that receive
  a lot of remote desktop traffic. After identifying these systems, you will need
  to add the "common_rdp_source" or "common_rdp_destination" category to that system
  depending on the usage, using the Enterprise Security Assets and Identities framework.  This
  can be done by adding an entry in the assets.csv file located in SA-IdentityManagement/lookups.
known_false_positives: Remote Desktop may be used legitimately by users on the network.
references: []
tags:
  analytic_story:
  - SamSam Ransomware
  - Ryuk Ransomware
  - Hidden Cobra Malware
  - Active Directory Lateral Movement
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 9
  - CIS 16
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1021.001
  - T1021
  nist:
  - DE.AE
  - PR.AC
  - PR.IP
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Traffic.dest_port
  - All_Traffic.dest_category
  - All_Traffic.src_category
  - All_Traffic.src
  - All_Traffic.dest
  - All_Traffic.dest_port
  security_domain: network
  confidence: 50
  impact: 50
  risk_score: 25
  context: []
  message: tbd
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
