name: Unusual Volume of Data Download from Internal Server Per Entity
id: cca028f4-77dd-11ec-bc09-acde48001122
version: 1
date: '2022-01-17'
author: Xiao Lin, Splunk
type: Anomaly
datamodel:
- Network_Traffic
description: Insider might conduct information collection before data exfiltration,
  and unusual volume of data download from internal server is an indicator of such
  potential threat. This detection evaluates the total bytes downloaded from internal
  servers at specific time window per entity level, and then flagged these that are
  higher than 99.999% percentile as an anamaly. A behavior will be reported as long
  as the downloaded byte volume is unusual even though that operation is benign, which
  causes false positive. It is therefore advised to adjust threshold and time window
  based on detection performance whenever necessary. It should be noted that seasonality
  is not modeled in the current approach.
search: '| from read_ssa_enriched_events() | eval sourcetype = ucast(map_get(input_event,
  "sourcetype"), "string", null) | eval timestamp = parse_long(ucast(map_get(input_event,
  "_time"), "string", null)) | where sourcetype == "pan:traffic" | eval src_device_scope
  =ucast(map_get(input_event, "src_device_scope"), "string", null) | eval dest_device_scope=ucast(map_get(input_event,
  "dest_device_scope"), "string", null) | where src_device_scope IS NOT NULL AND dest_device_scope
  IS NOT NULL | eval dest_device = ucast(map_get(input_event, "dest_device_ips"),
  "collection<string>", [])[0] | where dest_device IS NOT NULL AND dest_device_scope
  == "INTERNAL" | eval src_device  = ucast(map_get(input_event, "src_device_ips"),
  "collection<string>", [])[0] | where src_device IS NOT NULL AND src_device_scope
  == "INTERNAL" | eval bytes_in = ucast(map_get(input_event, "bytes_in"), "integer",
  0) | eval download_bytes = cast(bytes_in, "double") | eval tenant = ucast(map_get(input_event,
  "_tenant"), "string", null) | eval event_id = ucast(map_get(input_event, "event_id"),
  "string", null) | adaptive_threshold algorithm="quantile" value="download_bytes"
  entity="dest_device" window=86400000L | where label AND quantile>0.99999 | eval
  end_time = timestamp | eval start_time = end_time - 86400000 | eval body = create_map(["event_id",
  event_id, "tenant", tenant]) | eval entities=mvappend(dest_device) | into write_ssa_detected_events();'
how_to_implement: Ingest PAN traffic logs
known_false_positives: Benign large volume data download might be flagged as (false)
  positive.
references:
- https://github.com/twitter/AnomalyDetection
tags:
  analytic_story:
  - Insider Threat
  asset_type: endpoint
  cis20:
  - CIS 13
  confidence: 50
  context:
  - Source:Endpoint
  dataset:
  - https://github.com/splunk/attack_data/blob/master/datasets/suspicious_behaviour/unusual_data_download/unusual_volume_data_download.txt
  impact: 50
  kill_chain_phases:
  - Weaponization
  message: $src_device_ip downloaded unusually amount of data from internal server
    within one day
  mitre_attack_id:
  - T1213
  - T1039
  nist:
  - DE.AE
  observable:
  - name: src_device_ip
    type: IP Address
    role:
    - Other
  product:
  - Splunk Behavioral Analytics
  required_fields:
  - _time
  - dest_device_scope
  - bytes_in
  - src_device_ips
  risk_score: 25
  risk_severity: low
  security_domain: network
