author: Bhavin Patel, Splunk
date: '2017-11-27'
description: The search is used to detect hosts that generate Windows Event ID 4663
  for successful attempts to write to or read from a removable storage and Event ID
  4656 for failures, which occurs when a USB drive is plugged in. In this scenario
  we are querying the Change_Analysis data model to look for Windows Event ID 4656
  or 4663 where the priority of the affected host is marked as high in the ES Assets
  and Identity Framework.
how_to_implement: To successfully implement this search, you must ingest Windows Security
  Event logs and track event code 4663 and 4656. Ensure that the field from the event
  logs is being mapped to the result_id field in the Change_Analysis data model. To
  minimize the alert volume, this search leverages the Assets and Identity framework
  to filter out events from those assets not marked high priority in the Enterprise
  Security Assets and Identity Framework.
id: 104658f4-afdc-499f-9719-17a43f9826f5
known_false_positives: Legitimate USB activity will also be detected. Please verify
  and investigate as appropriate.
name: Detect USB device insertion
references: []
search: '| tstats `security_content_summariesonly` count earliest(_time) AS earliest
  latest(_time) AS latest from datamodel=Change_Analysis where (nodename = All_Changes)
  All_Changes.result="Removable Storage device" (All_Changes.result_id=4663 OR All_Changes.result_id=4656)
  (All_Changes.src_priority=high) by All_Changes.dest | `drop_dm_object_name("All_Changes")`|
  `security_content_ctime(earliest)`| `security_content_ctime(latest)`  | `detect_usb_device_insertion_filter`'
tags:
  analytics_story:
  - Data Protection
  asset_type: Endpoint
  cis20:
  - CIS 13
  kill_chain_phases:
  - Installation
  - Actions on Objectives
  nist:
  - PR.PT
  - PR.DS
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
type: ESCU
version: 1
