name: Execution of File With Spaces Before Extension
id: ab0353e6-a956-420b-b724-a8b4846d5d5a
version: 3
date: '2020-11-19'
author: Rico Valdez, Splunk
status: deprecated
type: TTP
description: This search looks for processes launched from files with at least five
  spaces in the name before the extension. This is typically done to obfuscate the
  file extension by pushing it outside of the default view.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count values(Processes.process_path)
  as process_path min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process = "*     .*" by Processes.dest Processes.user Processes.process
  Processes.process_name | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `drop_dm_object_name(Processes)` | `execution_of_file_with_spaces_before_extension_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: None identified.
references: []
tags:
  analytic_story:
  - Windows File Extension and Association Abuse
  - Masquerading - Rename System Utilities
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1036.003
  observable:
  - name: field
    type: Unknown
    role:
    - Unknown
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_path
  - Processes.process
  - Processes.dest
  - Processes.user
  - Processes.process_name
  risk_score: 25
  security_domain: endpoint
