name: Reg exe used to hide files directories via registry keys
id: c77162d3-f93c-45cc-80c8-22f6b5264x9f
version: 2
date: '2019-02-27'
description: The search looks for command-line arguments used to hide a file or directory
  using the reg add command.
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
type: batch
references: []
author: Bhavin Patel, Splunk
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process_name = reg.exe Processes.process="*add*" Processes.process="*Hidden*"
  Processes.process="*REG_DWORD*" by Processes.process_name Processes.parent_process_name
  Processes.dest Processes.user| `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  |`security_content_ctime(lastTime)`| regex process = "(/d\s+2)" | `reg_exe_used_to_hide_files_directories_via_registry_keys_filter`'
known_false_positives: None at the moment
tags:
  analytics_story:
  - Windows Defense Evasion Tactics
  - Suspicious Windows Registry Activities
  - Windows Persistence Techniques
  mitre_attack_id:
  - T1564.001
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 8
  nist:
  - DE.CM
  security_domain: endpoint
  asset_type: ''
