author: Rico Valdez, Splunk
date: '2018-12-03'
description: This search looks for wmic.exe being launched with parameters to operate
  on remote systems.
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model. Deprecated because duplicate of Remote Process Instantiation via WMI.
id: 272df6de-61f1-4784-877c-1fbc3e2d0838
known_false_positives: Administrators may use this legitimately to gather info from
  remote systems.
name: Remote WMI Command Attempt
references: []
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  as process values(Processes.parent_process) as parent_process min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=wmic.exe  AND
  Processes.process= */node* by Processes.user Processes.process_name Processes.parent_process_name
  Processes.dest  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`|
  `security_content_ctime(lastTime)` | `remote_wmi_command_attempt_filter`'
tags:
  analytic_story:
  - Suspicious WMI Use
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 5
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1047
  nist:
  - PR.PT
  - PR.AT
  - PR.AC
  - PR.IP
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
type: batch
version: 2
