name: Scheduled tasks used in BadRabbit ransomware
id: 1297fb80-f42a-4b4a-9c8b-78c066437cf6
version: 3
date: '2020-07-21'
author: Bhavin Patel, Splunk
status: deprecated
type: TTP
description: This search looks for flags passed to schtasks.exe on the command-line
  that indicate that task names related to the execution of Bad Rabbit ransomware
  were created or deleted. Deprecated because we already have a similar detection
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime values(Processes.process) as process  from datamodel=Endpoint.Processes
  where Processes.process_name=schtasks.exe (Processes.process= "*create*"  OR Processes.process=
  "*delete*") by Processes.parent_process Processes.process_name Processes.user |
  `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`|`security_content_ctime(lastTime)`
  | search (process=*rhaegal* OR process=*drogon* OR *viserion_*) | `scheduled_tasks_used_in_badrabbit_ransomware_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: No known false positives
references: []
tags:
  analytic_story:
  - Ransomware
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1053.005
  observable:
  - name: field
    type: Unknown
    role:
    - Unknown
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  risk_score: 25
  security_domain: endpoint
