name: Suspicious Changes to File Associations
id: 1b989a0e-0129-4446-a695-f193a5b746fc
version: 4
date: '2020-07-22'
author: Rico Valdez, Splunk
status: deprecated
type: TTP
description: This search looks for changes to registry values that control Windows
  file associations, executed by a process that is not typical for legitimate, routine
  changes to this area.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime values(Processes.process_name) as process_name values(Processes.parent_process_name)
  as parent_process_name FROM datamodel=Endpoint.Processes where Processes.process_name!=Explorer.exe
  AND Processes.process_name!=OpenWith.exe by Processes.process_id Processes.dest
  | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | join [| tstats `security_content_summariesonly` values(Registry.registry_path)
  as registry_path count from datamodel=Endpoint.Registry where Registry.registry_path=*\\Explorer\\FileExts*
  by Registry.process_id Registry.dest | `drop_dm_object_name("Registry")` | table
  process_id dest registry_path]| `suspicious_changes_to_file_associations_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: There may be other processes in your environment that users
  may legitimately use to modify file associations. If this is the case and you are
  finding false positives, you can modify the search to add those processes as exceptions.
references: []
tags:
  analytic_story:
  - Suspicious Windows Registry Activities
  - Windows File Extension and Association Abuse
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1546.001
  observable:
  - name: field
    type: Unknown
    role:
    - Unknown
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  risk_score: 25
  security_domain: endpoint
