name: Uncommon Processes On Endpoint
id: 29ccce64-a10c-4389-a45f-337cb29ba1f7
version: 4
date: '2020-07-22'
author: David Dorsey, Splunk
status: deprecated
type: Hunting
description: This search looks for applications on the endpoint that you have marked
  as uncommon.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes by Processes.dest Processes.user Processes.process
  Processes.process_name | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `drop_dm_object_name(Processes)` | `uncommon_processes` |`uncommon_processes_on_endpoint_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: None identified
references: []
tags:
  analytic_story:
  - Windows Privilege Escalation
  - Unusual Processes
  - Hermetic Wiper
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1204.002
  observable:
  - name: field
    type: Unknown
    role:
    - Unknown
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  risk_score: 25
  security_domain: endpoint
