name: Uncommon Processes On Endpoint
id: 29ccce64-a10c-4389-a45f-337cb29ba1f7
version: 4
date: '2020-07-22'
author: David Dorsey, Splunk
status: deprecated
type: Hunting
description: This search looks for applications on the endpoint that you have marked
  as uncommon.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes by Processes.dest Processes.user Processes.process
  Processes.process_name | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `drop_dm_object_name(Processes)` | `uncommon_processes` |`uncommon_processes_on_endpoint_filter` '
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model. This search uses a lookup file `uncommon_processes_default.csv` to track
  various features of process names that are usually uncommon in most environments.
  Please consider updating `uncommon_processes_local.csv` to hunt for processes that
  are uncommon in your environment.
known_false_positives: None identified
references: []
tags:
  analytic_story:
  - Windows Privilege Escalation
  - Unusual Processes
  - Hermetic Wiper
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1204.002
  observable:
  - name: field
    type: Unknown
    role:
    - Unknown
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  risk_score: 25
  security_domain: endpoint
