name: Impacket Lateral Movement WMIExec Commandline Parameters
id: 9d07ff50-e968-456e-a3d9-c65c38ed0ab0
version: 1
status: production
detection_type: STREAMING
description: This analytic looks for the presence of suspicious commandline parameters
  typically present when using Impacket tools. Impacket is a collection of python
  classes meant to be used with Microsoft network protocols. There are multiple scripts
  that leverage impacket libraries like `wmiexec.py`, `smbexec.py`, `dcomexec.py`
  and `atexec.py` used to execute commands on remote endpoints. By default, these
  scripts leverage administrative shares and hardcoded parameters that can be used
  as a signature to detect its use. Red Teams and adversaries alike may leverage Impackets
  tools for lateral movement and remote code execution.
search: ' $main = from source  | eval timestamp = time  | eval metadata_uid = metadata.uid  |
  eval process_pid = process.pid | eval process_file = process.file | eval process_file_path
  = process_file.path | eval process_file_name = lower(process_file.name) | eval process_cmd_line
  = process.cmd_line | eval actor_user = actor.user | eval actor_user_name = actor_user.name
  | eval actor_process = actor.process | eval actor_process_pid = actor_process.pid
  | eval actor_process_file = actor_process.file | eval actor_process_file_path =
  actor_process_file.path | eval actor_process_file_name = lower(actor_process_file.name)
  | eval device_hostname = device.hostname | where actor_process_file_name="wmiprvse.exe"
  AND process_cmd_line LIKE "%\\127.0.0.1%" AND match(process_cmd_line, /(?i)__\d{1,10}\.\d{1,10}/)=true
  
  | eval devices = [{"hostname": device_hostname, "type_id": 0, "uuid": device.uuid}],
    time = timestamp,
    evidence = {"process.pid": process_pid, "process.file.path": process_file_path, "process.file.name": process_file_name, "process.cmd_line": process_cmd_line, "actor.user.name": actor_user_name, "actor.process.pid": actor_process_pid, "actor.process.file.path": actor_process_file_path, "actor.process.file.name": actor_process_file_name, "device.hostname": device_hostname, "sourceType": metadata.source_type, "source": metadata.source},
    message = "Impacket Lateral Movement WMIExec Commandline Parameters has been triggered on " + device_hostname + " by " + actor_user_name + ".",
    users = [{"name": actor_user_name, "uuid": actor_user.uuid, "uid": actor_user.uid}],
    activity_id = 1,
    cis_csc = [{"control": "CIS 10", "version": 8}], 
    analytic_stories = ["Active Directory Lateral Movement", "CISA AA22-277A", "WhisperGate", "Prestige Ransomware", "Volt Typhoon", "Graceful Wipe Out Attack", "Industroyer2", "Data Destruction"],
    class_name = "Detection Report", 
    confidence = 70,
    confidence_id = 3,
    duration = 0, 
    impact = 90,
    impact_id = 5,
    kill_chain = [{"phase": "Exploitation", "phase_id": 4}, {"phase": "Installation", "phase_id": 5}],
    nist = ["DE.AE"], 
    risk_level = "High", 
    category_uid = 2,
    class_uid = 102001,
    risk_level_id = 3,
    risk_score = 63,
    severity_id = 0,
    rule = {"name": "Impacket Lateral Movement WMIExec Commandline Parameters", "uid": "9d07ff50-e968-456e-a3d9-c65c38ed0ab0", "type": "Streaming"},
    metadata = {"customer_uid": metadata.customer_uid, "product": {"name": "Behavior Analytics", "vendor_name": "Splunk"}, "version": "1.0.0-rc.2", "logged_time": time()},
    type_uid = 10200101,
    start_time = timestamp,
    end_time = timestamp
  | fields metadata, rule, activity_id, analytic_stories, cis_csc, category_uid, class_name, class_uid, confidence, confidence_id, devices, duration, time, evidence, impact, impact_id, kill_chain, message, nist, observables, risk_level, risk_level_id, risk_score, severity_id, type_uid, users, start_time, end_time 
  | into sink; '
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Although uncommon, Administrators may leverage Impackets tools
  to start a process on remote systems for system administration or automation use
  cases.
references:
- https://attack.mitre.org/techniques/T1021/002/
- https://attack.mitre.org/techniques/T1021/003/
- https://attack.mitre.org/techniques/T1047/
- https://attack.mitre.org/techniques/T1053/
- https://attack.mitre.org/techniques/T1053/005/
- https://github.com/SecureAuthCorp/impacket
- https://vk9-sec.com/impacket-remote-code-execution-rce-on-windows-from-linux/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
tags:
  required_fields:
  - process.pid
  - process.file.path
  - process.file.name
  - process.cmd_line
  - actor.user.name
  - actor.process.pid
  - actor.process.file.path
  - actor.process.file.name
  - device.hostname
  risk_score: 63
  security_domain: endpoint
  risk_severity: medium
  research_site_url: https://research.splunk.com/endpoint/9d07ff50-e968-456e-a3d9-c65c38ed0ab0/
  event_schema: ocsf
  mappings:
  - ocsf: process.pid
    cim: process_id
  - ocsf: process.file.path
    cim: process_path
  - ocsf: process.file.name
    cim: process_name
  - ocsf: process.cmd_line
    cim: process
  - ocsf: actor.user.name
    cim: user
  - ocsf: actor.process.pid
    cim: parent_process_id
  - ocsf: actor.process.file.path
    cim: parent_process_path
  - ocsf: actor.process.file.name
    cim: parent_process_name
  - ocsf: device.hostname
    cim: dest
  annotations:
    analytic_story:
    - Active Directory Lateral Movement
    - CISA AA22-277A
    - WhisperGate
    - Prestige Ransomware
    - Volt Typhoon
    - Graceful Wipe Out Attack
    - Industroyer2
    - Data Destruction
    cis20:
    - CIS 10
    kill_chain_phases:
    - Exploitation
    - Installation
    mitre_attack_id:
    - T1021
    - T1021.002
    - T1021.003
    - T1047
    - T1543.003
    nist:
    - DE.CM
test:
  name: Impacket Lateral Movement WMIExec Commandline Parameters Unit Test
  tests:
  - name: Impacket Lateral Movement WMIExec Commandline Parameters
    attack_data:
    - file_name: windows_security_xml.log
      data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1021.002/impacket_wmiexec/windows_security_xml.log
      source: XmlWinEventLog:Security
runtime: SPL2
internalVersion: 2
