name: Windows PowerShell Disabled Kerberos Pre-Authentication Discovery With PowerView
id: dc3f2af7-ca69-47ce-a122-9f9787e19417
version: 1
description: The following analytic utilizes PowerShell Script Block Logging (EventCode=4104)
  to identify the execution of the `Get-DomainUser` commandlet with specific parameters.
  `Get-DomainUser` is part of PowerView, a PowerShell tool used to perform enumeration
  on Windows Active Directory networks. As the name suggests, `Get-DomainUser` is
  used to identify domain users and combining it with `-PreauthNotRequired` allows
  adversaries to discover domain accounts with Kerberos Pre Authentication disabled.\
  Red Teams and adversaries alike use may leverage PowerView to enumerate these accounts
  and attempt to crack their passwords offline.
search: ' | from read_ba_enriched_events() | eval timestamp = ucast(map_get(input_event,"time"),"long",
  null) | eval origin = ucast(map_get(input_event, "origin"),"map<string, any>", null)
  | eval metadata = ucast(map_get(input_event, "metadata"),"map<string, any>", null)
  | eval metadata_uid = ucast(map_get(metadata, "uid"),"string", null) | eval process=ucast(map_get(input_event,"process"),
  "map<string, any>", null) | eval process_pid=ucast(map_get(process,"pid"), "string",
  null) | eval process_file=ucast(map_get(process,"file"), "map<string, any>", null)
  | eval process_file_path=ucast(map_get(process_file,"path"), "string", null) | eval
  process_file_name=ucast(map_get(process_file,"name"), "string", null) | eval process_cmd_line=ucast(map_get(process,"cmd_line"),
  "string", null) | eval process_user=ucast(map_get(process,"user"), "map<string,
  any>", null) | eval process_user_name=ucast(map_get(process_user,"name"), "string",
  null) | eval actor=ucast(map_get(input_event,"actor"), "map<string, any>", null)
  | eval actor_process=ucast(map_get(actor,"process"), "map<string, any>", null) |
  eval actor_process_pid=ucast(map_get(actor_process,"pid"), "string", null) | eval
  actor_process_file=ucast(map_get(actor_process,"file"), "map<string, any>", null)
  | eval actor_process_file_path=ucast(map_get(actor_process_file,"path"), "string",
  null) | eval actor_process_file_name=ucast(map_get(actor_process_file,"name"), "string",
  null) | eval device=ucast(map_get(input_event,"device"), "map<string, any>", null)
  | eval device_hostname=ucast(map_get(device,"hostname"), "string", null) | where
  match_regex(process_cmd_line, /(?i)preauthnotrequired/)=true AND match_regex(process_cmd_line,
  /(?i)get-domainuser/)=true 
  | eval body=create_map(
    "devices", [
        create_map(
            "hostname", device_hostname, "type_id", 0, "uuid", ucast(map_get(device,"uuid"), "string", null)
        )
    ],
    "time", timestamp,
    "evidence", create_map("process.user.name", process_user_name, "device.hostname", device_hostname, "process.cmd_line", process_cmd_line),
    "message", concat("Windows PowerShell Disabled Kerberos Pre-Authentication Discovery With PowerView has been triggered on ", device_hostname, " by ", process_user_name, "."),
    "users", [
        create_map(
            "name", process_user_name, "uuid", ucast(map_get(process_user,"uuid"), "string", null)
        )
    ],
    "activity_id", 1,
    "category_uid", 2,
    "class_uid", 102001,
    "risk_level_id", 2,
    "risk_score", 54,
    "severity_id", 0,
    "rule", create_map("name", "Windows PowerShell Disabled Kerberos Pre-Authentication Discovery With PowerView", "version", 1, "uid", "dc3f2af7-ca69-47ce-a122-9f9787e19417", "type", "Streaming"),
    "metadata", create_map("customer_uid", ucast(map_get(origin,"customer_uid"), "string", null), "product", create_map("name", "Behavior Analytics", "vendor_name", "Splunk"), "version", "1.0.0"),
    "type_uid", 10200101,
    "start_time", timestamp,
    "end_time", timestamp
  )
  | into write_ba_finding_events();'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: Administrators or power users may use PowerView for troubleshooting
references:
- https://attack.mitre.org/techniques/T1558/004/
- https://m0chan.github.io/2019/07/31/How-To-Attack-Kerberos-101.html
- https://stealthbits.com/blog/cracking-active-directory-passwords-with-as-rep-roasting/
tags:
  required_fields:
  - process.user.name
  - device.hostname
  - process.cmd_line
  risk_score: 54
  security_domain: endpoint
  risk_severity: medium
  research_site_url: https://research.splunk.com/endpoint/dc3f2af7-ca69-47ce-a122-9f9787e19417/
  event_schema: ocsf
  mappings:
  - ocsf: process.pid
    cim: process_id
  - ocsf: process.file.path
    cim: process_path
  - ocsf: process.file.name
    cim: process_name
  - ocsf: process.cmd_line
    cim: process
  - ocsf: process.user.name
    cim: user
  - ocsf: actor.process.pid
    cim: parent_process_id
  - ocsf: actor.process.file.path
    cim: parent_process_path
  - ocsf: actor.process.file.name
    cim: parent_process_name
  - ocsf: device.hostname
    cim: dest
  annotations:
    analytic_story:
    - Active Directory Kerberos Attacks
    cis20:
    - CIS 10
    kill_chain_phases:
    - Exploitation
    mitre_attack_id:
    - T1558
    - T1558.004
    nist:
    - DE.CM
test:
  name: Windows PowerShell Disabled Kerberos Pre-Authentication Discovery With PowerView
    Unit Test
  tests:
  - name: Windows PowerShell Disabled Kerberos Pre-Authentication Discovery With PowerView
    attack_data:
    - file_name: getdomainuser.log
      data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.001/powershell_script_block_logging/getdomainuser.log
      source: XmlWinEventLog
runtime: SPL-DSP
