name: Detect RClone Command-Line Usage
id: e8b74268-5454-11ec-a799-acde48001122
version: 1
description: This analytic identifies commonly used command-line arguments used by
  `rclone.exe` to initiate a file transfer. Some arguments were negated as they are
  specific to the configuration used by adversaries. In particular, an adversary may
  list the files or directories of the remote file share using `ls` or `lsd`, which
  is not indicative of malicious behavior. During triage, at this stage of a ransomware
  event, exfiltration is about to occur or has already. Isolate the endpoint and continue
  investigating by review file modifications and parallel processes.
search: ' | from read_ba_enriched_events() | eval timestamp = ucast(map_get(input_event,"time"),"long",
  null) | eval metadata = ucast(map_get(input_event, "metadata"),"map<string, any>",
  null) | eval metadata_uid = ucast(map_get(metadata, "uid"),"string", null) | eval
  process=ucast(map_get(input_event,"process"), "map<string, any>", null) | eval process_file=ucast(map_get(process,"file"),
  "map<string, any>", null) | eval process_file_name=ucast(map_get(process_file,"name"),
  "string", null) | eval actor=ucast(map_get(input_event,"actor"), "map<string, any>",
  null) | eval actor_process=ucast(map_get(actor,"process"), "map<string, any>", null)
  | eval actor_process_file=ucast(map_get(actor_process,"file"), "map<string, any>",
  null) | eval actor_process_file_name=ucast(map_get(actor_process_file,"name"), "string",
  null) | eval actor_process_cmd_line=ucast(map_get(actor_process,"cmd_line"), "string",
  null) | eval process_cmd_line=ucast(map_get(process,"cmd_line"), "string", null)
  | eval process_file_path=ucast(map_get(process_file,"path"), "string", null) | eval
  process_user=ucast(map_get(process,"user"), "map<string, any>", null) | eval process_user_name=ucast(map_get(process_user,"name"),
  "string", null) | eval device=ucast(map_get(input_event,"device"), "map<string,
  any>", null) | eval device_hostname=ucast(map_get(device,"hostname"), "string",
  null) | where (like(process_cmd_line, "%--multi-thread-streams%") OR like(process_cmd_line,
  "%--transfers%") OR like(process_cmd_line, "%--auto-confirm%") OR like(process_cmd_line,
  "%--ignore-existing%") OR like(process_cmd_line, "%--no-check-certificate%") OR
  like(process_cmd_line, "%--progress%") OR like(process_cmd_line, "%--config%") OR
  like(process_cmd_line, "%ftp%") OR like(process_cmd_line, "%pcloud%") OR like(process_cmd_line,
  "%mega%") OR like(process_cmd_line, "%copy%")) AND process_file_name="rclone.exe"
  
  | eval body=create_map(
    "activity_id", 1,
    "analytic_stories", ["DarkSide Ransomware", "Ransomware", "Insider Threat"],
    "cis_csc", [create_map("control", "CIS 10", "version", 7)],
    "category_uid", 2,
    "class_name", "Detection Report",
    "class_uid", 102001,
    "confidence", 70,
    "confidence_id", 3,
    "devices", [
        create_map(
            "hostname", device_hostname, "type_id", 0
        )
    ],
    "duration", 0,
    "time", timestamp,
    "evidence", create_map("process_user_name", process_user_name, "device_hostname", device_hostname, "process_file_name", process_file_name, "process_cmd_line", process_cmd_line),
    "impact", 50,
    "impact_id", 3,
    "kill_chain", [create_map("phase", "Actions on Objectives", "phase_id", 7)],
    "attacks", [create_map("tactics", [create_map("name", "Exfiltration", "uid", "TA0010")], "technique", create_map("name", "Automated Exfiltration", "uid", "T1020"), "version", "12.1")],  
    "message", concat("Detect RClone Command-Line Usage has been triggered on ", device_hostname, " by ", process_user_name, "."),
    "metadata", create_map(
        "product", create_map(
            "name", "Behavioral Analytic Service",
            "vendor_name", "Splunk"
        ),
        "version", "1.0.0"
    ),
    "nist", ["DE.CM"],
    "observables", [create_map("name", "process_user_name", "type_id", 4, "value", process_user_name), create_map("name", "device_hostname", "type_id", 1, "value", device_hostname), create_map("name", "process_file_name", "type_id", 7, "value", process_file_name), create_map("name", "process_cmd_line", "type_id", 99, "value", process_cmd_line)],
    "risk_level", "Low",
    "risk_level_id", 1,
    "risk_score", 35,
    "severity_id", 3,
    "type_uid", 10200101,
    "users", [
        create_map(
            "name", process_user_name
        )
    ]
  )
  | into write_ba_finding_events();'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint_Processess` datamodel.
known_false_positives: False positives should be limited as this is restricted to
  the Rclone process name. Filter or tune the analytic as needed.
references:
- https://redcanary.com/blog/rclone-mega-extortion/
- https://www.mandiant.com/resources/shining-a-light-on-darkside-ransomware-operations
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/
tags:
  analytic_story:
  - DarkSide Ransomware
  - Ransomware
  - Insider Threat
  cis20:
  - CIS 10
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1020
  nist:
  - DE.CM
  required_fields:
  - process_user_name
  - device_hostname
  - process_file_name
  - process_cmd_line
  risk_score: 35
  security_domain: endpoint
  risk_severity: low
  research_site_url: https://research.splunk.com/endpoint/e8b74268-5454-11ec-a799-acde48001122/
  mappings:
  - ocsf: process_user_name
    cim: user
  - ocsf: device_hostname
    cim: dest
  - ocsf: process_file_name
    cim: process_name
  - ocsf: process_cmd_line
    cim: cmd_line
test:
  name: Detect RClone Command-Line Usage Unit Test
  tests:
  - name: Detect RClone Command-Line Usage
    attack_data:
    - file_name: windows-security.log
      data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1020/windows-security.log
      source: WinEventLog:Security
eventSchema: ocsf
