name: Attacker Tools On Endpoint
id: 241b1159-cf78-4201-8fad-1c21c3c96213
version: 1
status: validation
detection_type: STREAMING
description: The following analytic detects the use of tools that are commonly exploited
  by cybercriminals since these tools are usually associated with malicious activities
  such as unauthorized access, network scanning, or data exfiltration and pose a significant
  threat to an organization's security infrastructure. It also provides enhanced visibility
  into potential security threats and helps to proactively detect and respond to mitigate
  the risks associated with cybercriminal activities. This detection is made by examining
  the process activity on the host, specifically focusing on processes that are known
  to be associated with attacker tool names. This detection is important because it
  acts as an early warning system for potential security incidents that allows you
  to respond to security incidents promptly. False positives might occur due to legitimate
  administrative activities that can resemble malicious actions. You must develop
  a comprehensive understanding of typical endpoint activities and behaviors within
  the organization to accurately interpret and respond to the alerts generated by
  this analytic. This ensures a proper balance between precision and minimizing false
  positives.
search: ' $main = from source  | eval timestamp = time  | eval metadata_uid = metadata.uid  |
  eval process_pid = process.pid | eval process_file = process.file | eval process_file_path
  = process_file.path | eval process_file_name = process_file.name | eval process_cmd_line
  = process.cmd_line | eval actor_user = actor.user | eval actor_user_name = actor_user.name
  | eval actor_process = actor.process | eval actor_process_pid = actor_process.pid
  | eval actor_process_file = actor_process.file | eval actor_process_file_path =
  actor_process_file.path | eval actor_process_file_name = actor_process_file.name
  | eval device_hostname = device.hostname | where process_cmd_line LIKE "%adrecon%"
  OR process_cmd_line LIKE "%adcollector%" OR process_cmd_line LIKE "%nmap%" OR process_cmd_line
  LIKE "%pingcastle%" OR process_cmd_line LIKE "%sharphound%" OR process_cmd_line
  LIKE "%aclight%" OR process_cmd_line LIKE "%adaclscan%" OR process_cmd_line LIKE
  "%liza%" OR process_cmd_line LIKE "%lapstoolkit%" OR process_cmd_line LIKE "%rubeus%"
  OR process_cmd_line LIKE "%passthecert%" OR process_cmd_line LIKE "%responder%"
  OR process_cmd_line LIKE "%inveigh%" OR process_cmd_line LIKE "%hydra%" OR process_cmd_line
  LIKE "%mimikatz%" OR process_cmd_line LIKE "%sharpkatz%" OR process_cmd_line LIKE
  "%nanodump%" OR process_cmd_line LIKE "%powersploit%" OR process_cmd_line LIKE "%powersharppack%"
  OR process_cmd_line LIKE "%privesccheck%" OR process_cmd_line LIKE "%seatbelt%"
  OR process_cmd_line LIKE "%krbrelayup%" OR process_cmd_line LIKE "%sharpimpersonation%"
  OR process_cmd_line LIKE "%tokenvator%" OR process_cmd_line LIKE "%bloodyad%" OR
  process_cmd_line LIKE "%nimcrypt%" OR process_cmd_line LIKE "%protectmytooling%"
  OR process_cmd_line LIKE "%invoke-obfuscation%" OR process_cmd_line LIKE "%chameleon%"
  OR process_cmd_line LIKE "%covenant%" 
  | eval devices = [{"hostname": device_hostname, "type_id": 0, "uuid": device.uuid}],
    time = timestamp,
    evidence = {"process.pid": process_pid, "process.file.path": process_file_path, "process.file.name": process_file_name, "process.cmd_line": process_cmd_line, "actor.user.name": actor_user_name, "actor.process.pid": actor_process_pid, "actor.process.file.path": actor_process_file_path, "actor.process.file.name": actor_process_file_name, "device.hostname": device_hostname, "sourceType": metadata.source_type, "source": metadata.source},
    message = "Attacker Tools On Endpoint has been triggered on " + device_hostname + " by " + actor_user_name + ".",
    users = [{"name": actor_user_name, "uuid": actor_user.uuid, "uid": actor_user.uid}],
    activity_id = 1,
    cis_csc = [{"control": "CIS 10", "version": 8}], 
    analytic_stories = ["Monitor for Unauthorized Software", "XMRig", "SamSam Ransomware", "Unusual Processes", "CISA AA22-264A"],
    class_name = "Detection Report", 
    confidence = 80,
    confidence_id = 3,
    duration = 0, 
    impact = 80,
    impact_id = 5,
    kill_chain = [{"phase": "Exploitation", "phase_id": 4}, {"phase": "Reconnaissance", "phase_id": 1}],
    nist = ["DE.AE"], 
    risk_level = "High", 
    category_uid = 2,
    class_uid = 102001,
    risk_level_id = 3,
    risk_score = 64,
    severity_id = 0,
    rule = {"name": "Attacker Tools On Endpoint", "uid": "241b1159-cf78-4201-8fad-1c21c3c96213", "type": "Streaming"},
    metadata = {"customer_uid": metadata.customer_uid, "product": {"name": "Behavior Analytics", "vendor_name": "Splunk"}, "version": "1.0.0-rc.2", "logged_time": time()},
    type_uid = 10200101,
    start_time = timestamp,
    end_time = timestamp
  | fields metadata, rule, activity_id, analytic_stories, cis_csc, category_uid, class_name, class_uid, confidence, confidence_id, devices, duration, time, evidence, impact, impact_id, kill_chain, message, nist, observables, risk_level, risk_level_id, risk_score, severity_id, type_uid, users, start_time, end_time 
  | into sink; '
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Some administrator activity can be potentially triggered, please
  add those users to the filter macro.
references:
- https://github.com/Jean-Francois-C/Windows-Penetration-Testing
tags:
  required_fields:
  - process.pid
  - process.file.path
  - process.file.name
  - process.cmd_line
  - actor.user.name
  - actor.process.pid
  - actor.process.file.path
  - actor.process.file.name
  - device.hostname
  risk_score: 64
  security_domain: endpoint
  risk_severity: medium
  research_site_url: https://research.splunk.com/endpoint/241b1159-cf78-4201-8fad-1c21c3c96213/
  event_schema: ocsf
  mappings:
  - ocsf: process.pid
    cim: process_id
  - ocsf: process.file.path
    cim: process_path
  - ocsf: process.file.name
    cim: process_name
  - ocsf: process.cmd_line
    cim: process
  - ocsf: actor.user.name
    cim: user
  - ocsf: actor.process.pid
    cim: parent_process_id
  - ocsf: actor.process.file.path
    cim: parent_process_path
  - ocsf: actor.process.file.name
    cim: parent_process_name
  - ocsf: device.hostname
    cim: dest
  annotations:
    analytic_story:
    - Monitor for Unauthorized Software
    - XMRig
    - SamSam Ransomware
    - Unusual Processes
    - CISA AA22-264A
    cis20:
    - CIS 10
    kill_chain_phases:
    - Exploitation
    - Reconnaissance
    mitre_attack_id:
    - T1036.005
    - T1036
    - T1003
    - T1595
    nist:
    - DE.CM
test:
  name: Attacker Tools On Endpoint Unit Test
  tests:
  - name: Attacker Tools On Endpoint
    attack_data:
    - file_name: windows-security.log
      data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1595/attacker_scan_tools/windows-security.log
      source: XmlWinEventLog:Security
runtime: SPL2
internalVersion: 2
