name: Attempted Credential Dump From Registry via Reg exe
id: 14038953-e5f2-4daf-acff-5452062baf03
version: 2
description: The following analytic identifies the use of `reg.exe` attempting to
  export Windows registry keys that contain hashed credentials. Adversaries will utilize
  this technique to capture and perform offline password cracking.
search: ' | from read_ba_enriched_events() | eval timestamp = ucast(map_get(input_event,"time"),
  "long", null) | eval process_map = ucast(map_get(input_event, "process"), "map<string,
  any>", null) | eval file_map = ucast(map_get(process_map, "file"), "map<string,
  any>", null) | eval process_name = lower(ucast(map_get(file_map, "name"), "string",
  null)) | eval cmd_line = ucast(map_get(process_map, "cmd_line"), "string", null)
  | eval actor_map = ucast(map_get(input_event, "actor"), "map<string, any>", null)
  | eval actor_process_map = ucast(map_get(actor_map, "actor_process"), "map<string,
  any>", null) | eval actor_process_file_map = ucast(map_get(actor_process_map, "file"),
  "map<string, any>", null) | eval parent_process_name = ucast(map_get(actor_process_file_map,
  "name"), "string", null) | eval metadata_map = ucast(map_get(input_event, "metadata"),
  "map<string, any>", null) | eval metadata_uid = ucast(map_get(metadata_map, "uid"),
  "string", null) | eval disposition_id = ucast(map_get(input_event, "disposition_id"),
  "integer", null) | eval process_cmd_line_len = len(cmd_line) | where disposition_id
  = 1 | where process_name="reg.exe" OR process_name="cmd.exe" AND match_regex(cmd_line,
  /(?i)HKEY_LOCAL_MACHINE\\\\System/)=true OR match_regex(cmd_line, /(?i)HKEY_LOCAL_MACHINE\\\\SAM/)=true
  OR match_regex(cmd_line, /(?i)HKEY_LOCAL_MACHINE\\\\Security/)=true OR match_regex(cmd_line,
  /(?i)HKLM\\\\System/)=true OR match_regex(cmd_line, /(?i)HKLM\\\\SAM/)=true OR match_regex(cmd_line,
  /(?i)HKLM\\\\Security/)=true AND match_regex(cmd_line, /(?i)save/)=true  | eval
  origin_map=ucast(map_get(input_event, "origin"), "map<string, any>", null), dest_device=ucast(map_get(origin_map,
  "device"), "map<string, any>", null), dest_user=ucast(map_get(input_event, "user"),
  "map<string, any>", null), dest_device_name=ucast(map_get(dest_device, "name"),
  "string", null), dest_user_name=ucast(map_get(dest_user, "name"), "string", null),
  message=concat("An attempt to save registry keys storing credentials has been performed
  on", dest_device_name, " by ", dest_user_name, " via process ", process_name, ".")  
  | eval body=create_map(
    "activity_id", 1,
    "analytic_stories", ["Credential Dumping"],
    "cis_csc", [create_map("control", "CIS 10", "version", 7)],
    "category_uid", 2,
    "class", "Detection Report",
    "class_uid", 102001,
    "confidence", 90,
    "confidence_id", 3,
    "devices", [
        create_map(
            "uid", ucast(map_get( dest_device , "ref_uid"), "string", null), "type_id", 0)
    ],
    "duration", 0,
    "time", timestamp,
    "evidence", create_map(
        "actor.process.file.name", parent_process_name,
        "process.file.name", process_name,
        "process.cmd_line", cmd_line
    ),
    "impact", 70,
    "impact_id", 4,
    "kill_chain", [create_map("phase", "Exploitation", "phase_id", 4)],
    "attacks", [create_map("tactics", [create_map("name", "Credential Access", "uid", "TA0006")], "technique", create_map("name", "OS Credential Dumping", "uid", "T1003"), "version", "12.1"), create_map("tactics", [create_map("name", "Credential Access", "uid", "TA0006")], "technique", create_map("name", "Security Account Manager", "uid", "T1003.002"), "version", "12.1")],  
    "message", "tbd",
    "metadata", create_map(
        "product", create_map(
            "name", "Behavioral Analytic Service",
            "vendor_name", "Splunk"
        ),
        "version", "1.0.0"
    ),
    "nist", ["DE.CM"],
    "observables", [create_map("name", "dest_user_id", "type_id", 6, "value", dest_user_id), create_map("name", "dest_device_id", "type_id", 4, "value", dest_device_id), create_map("name", "process_name", "type_id", 15, "value", process_name)],
    "risk_level", "High",
    "risk_level_id", 3,
    "risk_score", 63,
    "severity_id", 4,
    "type_id", 10200101,
    "users", [
        create_map(
            "uid", ucast(map_get(dest_user, "ref_uid"),"string", null)
        )
    ]
  )
  | into write_ba_finding_events();'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: None identified.
references:
- https://github.com/splunk/security_content/blob/55a17c65f9f56c2220000b62701765422b46125d/detections/attempted_credential_dump_from_registry_via_reg_exe.yml
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.002/T1003.002.md#atomic-test-1---registry-dump-of-sam-creds-and-secrets
tags:
  analytic_story:
  - Credential Dumping
  cis20:
  - CIS 10
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1003
  - T1003.002
  nist:
  - DE.CM
  required_fields: null
  risk_score: 63
  security_domain: endpoint
  risk_severity: medium
  research_site_url: https://research.splunk.com/endpoint/14038953-e5f2-4daf-acff-5452062baf03/
  event_schema: cim
test:
  name: Attempted Credential Dump From Registry via Reg exe Unit Test
  tests:
  - name: Attempted Credential Dump From Registry via Reg exe
    attack_data:
    - file_name: windows-security.log
      data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.002/atomic_red_team/windows-security.log
      source: WinEventLog:Security
