name: Deleting Shadow Copies
id: fd40c537-53d0-4c28-9b7e-77cfd28a49c8
version: 1
status: validation
description: The vssadmin.exe utility is used to interact with the Volume Shadow Copy
  Service. Wmic is an interface to the Windows Management Instrumentation.  This search
  looks for either of these tools being used to delete shadow copies.
search: ' $main = from source  | eval timestamp = time  | eval metadata_uid = metadata.uid  |
  eval process_pid = process.pid | eval process_file = process.file | eval process_file_path
  = process_file.path | eval process_file_name = process_file.name | eval process_cmd_line
  = process.cmd_line | eval actor_user = actor.user | eval actor_user_name = actor_user.name
  | eval actor_process = actor.process | eval actor_process_pid = actor_process.pid
  | eval actor_process_file = actor_process.file | eval actor_process_file_path =
  actor_process_file.path | eval actor_process_file_name = actor_process_file.name
  | eval device_hostname = device.hostname | where (process_file_name="vssadmin.exe"
  OR process_file_name="wmic.exe") AND process_cmd_line LIKE "%delete%" AND process_cmd_line
  LIKE "%shadow%" 
  | eval devices = [{"hostname": device_hostname, "type_id": 0, "uuid": device.uuid}],
    time = timestamp,
    evidence = {"process.pid": process_pid, "process.file.path": process_file_path, "process.file.name": process_file_name, "process.cmd_line": process_cmd_line, "actor.user.name": actor_user_name, "actor.process.pid": actor_process_pid, "actor.process.file.path": actor_process_file_path, "actor.process.file.name": actor_process_file_name, "device.hostname": device_hostname},
    message = "Deleting Shadow Copies has been triggered on " + device_hostname + " by " + actor_user_name + ".",
    users = [{"name": actor_user_name, "uid": actor_user.uid}],
    activity_id = 1,
    cis_csc = [{"control": "CIS 10", "version": 8}], 
    analytic_stories = ["Clop Ransomware", "Ransomware"],
    class_name = "Detection Report", 
    confidence = 80,
    confidence_id = 3,
    duration = 0, 
    impact = 80,
    impact_id = 5,
    kill_chain = [],
    nist = ["DE.AE"], 
    risk_level = "High", 
    category_uid = 2,
    class_uid = 102001,
    risk_level_id = 3,
    risk_score = 64,
    severity_id = 0,
    rule = {"name": "Deleting Shadow Copies", "uid": "fd40c537-53d0-4c28-9b7e-77cfd28a49c8", "type": "Streaming"},
    metadata = {"customer_uid": metadata.customer_uid, "product": {"name": "Behavior Analytics", "vendor_name": "Splunk"}, "version": "1.0.0-rc.2", "logged_time": time()},
    type_uid = 10200101,
    start_time = timestamp,
    end_time = timestamp
  | fields metadata, rule, activity_id, analytic_stories, cis_csc, category_uid, class_name, class_uid, confidence, confidence_id, devices, duration, time, evidence, impact, impact_id, kill_chain, message, nist, observables, risk_level, risk_level_id, risk_score, severity_id, type_uid, users, start_time, end_time 
  | into sink; '
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product.
known_false_positives: System administrators may resize the shadowstorage for valid
  purposes. Filter as needed.
references:
- https://atomicredteam.io/impact/T1490/
- https://blogs.vmware.com/security/2022/10/lockbit-3-0-also-known-as-lockbit-black.html
tags:
  required_fields:
  - process.pid
  - process.file.path
  - process.file.name
  - process.cmd_line
  - actor.user.name
  - actor.process.pid
  - actor.process.file.path
  - actor.process.file.name
  - device.hostname
  risk_score: 64
  security_domain: endpoint
  risk_severity: medium
  research_site_url: https://research.splunk.com/endpoint/fd40c537-53d0-4c28-9b7e-77cfd28a49c8/
  event_schema: ocsf
  mappings:
  - ocsf: process.pid
    cim: process_id
  - ocsf: process.file.path
    cim: process_path
  - ocsf: process.file.name
    cim: process_name
  - ocsf: process.cmd_line
    cim: process
  - ocsf: actor.user.name
    cim: user
  - ocsf: actor.process.pid
    cim: parent_process_id
  - ocsf: actor.process.file.path
    cim: parent_process_path
  - ocsf: actor.process.file.name
    cim: parent_process_name
  - ocsf: device.hostname
    cim: dest
  annotations:
    analytic_story:
    - Clop Ransomware
    - Ransomware
    cis20:
    - CIS 10
    kill_chain_phases: []
    mitre_attack_id:
    - T1490
    nist:
    - DE.CM
test:
  name: Deleting Shadow Copies Unit Test
  tests:
  - name: Deleting Shadow Copies
    attack_data:
    - file_name: 4688_xml_windows_security_delete_shadow.log
      data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1490/atomic_red_team/4688_xml_windows_security_delete_shadow.log
      source: XmlWinEventLog:Security
runtime: SPL2
internalVersion: 2
