name: Detect RClone Command-Line Usage
id: e8b74268-5454-11ec-a799-acde48001122
version: 3
status: production
detection_type: STREAMING
description: This analytic identifies commonly used command-line arguments used by
  `rclone.exe` to initiate a file transfer. Some arguments were negated as they are
  specific to the configuration used by adversaries. In particular, an adversary may
  list the files or directories of the remote file share using `ls` or `lsd`, which
  is not indicative of malicious behavior. During triage, at this stage of a ransomware
  event, exfiltration is about to occur or has already. Isolate the endpoint and continue
  investigating by review file modifications and parallel processes.
search: ' $main = from source  | eval timestamp = time  | eval metadata_uid = metadata.uid  |
  eval process_pid = process.pid | eval process_file = process.file | eval process_file_path
  = process_file.path | eval process_file_name = lower(process_file.name) | eval process_cmd_line
  = process.cmd_line | eval actor_user = actor.user | eval actor_user_name = actor_user.name
  | eval actor_process = actor.process | eval actor_process_pid = actor_process.pid
  | eval actor_process_file = actor_process.file | eval actor_process_file_path =
  actor_process_file.path | eval actor_process_file_name = actor_process_file.name
  | eval device_hostname = device.hostname | where (process_cmd_line LIKE "%--multi-thread-streams%"
  OR process_cmd_line LIKE "%--transfers%" OR process_cmd_line LIKE "%--auto-confirm%"
  OR process_cmd_line LIKE "%--ignore-existing%" OR process_cmd_line LIKE "%--no-check-certificate%"
  OR process_cmd_line LIKE "%--progress%" OR process_cmd_line LIKE "%--config%" OR
  process_cmd_line LIKE "%ftp%" OR process_cmd_line LIKE "%pcloud%" OR process_cmd_line
  LIKE "%mega%" OR process_cmd_line LIKE "%copy%") AND process_file_name="rclone.exe"
  
  | eval devices = [{"hostname": device_hostname, "type_id": 0, "uuid": device.uuid}],
    time = timestamp,
    evidence = {"process.pid": process_pid, "process.file.path": process_file_path, "process.file.name": process_file_name, "process.cmd_line": process_cmd_line, "actor.user.name": actor_user_name, "actor.process.pid": actor_process_pid, "actor.process.file.path": actor_process_file_path, "actor.process.file.name": actor_process_file_name, "device.hostname": device_hostname, "sourceType": metadata.source_type, "source": metadata.source},
    message = "Detect RClone Command-Line Usage has been triggered on " + device_hostname + " by " + actor_user_name + ".",
    users = [{"name": actor_user_name, "uid": actor_user.uid}],
    activity_id = 1,
    cis_csc = [{"control": "CIS 10", "version": 8}], 
    analytic_stories = ["DarkSide Ransomware", "Ransomware", "Insider Threat"],
    class_name = "Detection Report", 
    confidence = 70,
    confidence_id = 3,
    duration = 0, 
    impact = 50,
    impact_id = 3,
    kill_chain = [{"phase": "Actions on Objectives", "phase_id": 7}],
    nist = ["DE.AE"], 
    risk_level = "Low", 
    category_uid = 2,
    class_uid = 102001,
    risk_level_id = 1,
    risk_score = 35,
    severity_id = 0,
    rule = {"name": "Detect RClone Command-Line Usage", "uid": "e8b74268-5454-11ec-a799-acde48001122", "type": "Streaming"},
    metadata = {"customer_uid": metadata.customer_uid, "product": {"name": "Behavior Analytics", "vendor_name": "Splunk"}, "version": "1.0.0-rc.2", "logged_time": time()},
    type_uid = 10200101,
    start_time = timestamp,
    end_time = timestamp
  | fields metadata, rule, activity_id, analytic_stories, cis_csc, category_uid, class_name, class_uid, confidence, confidence_id, devices, duration, time, evidence, impact, impact_id, kill_chain, message, nist, observables, risk_level, risk_level_id, risk_score, severity_id, type_uid, users, start_time, end_time 
  | into sink; '
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint_Processess` datamodel.
known_false_positives: False positives should be limited as this is restricted to
  the Rclone process name. Filter or tune the analytic as needed.
references:
- https://redcanary.com/blog/rclone-mega-extortion/
- https://www.mandiant.com/resources/shining-a-light-on-darkside-ransomware-operations
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/
tags:
  required_fields:
  - process.pid
  - process.file.path
  - process.file.name
  - process.cmd_line
  - actor.user.name
  - actor.process.pid
  - actor.process.file.path
  - actor.process.file.name
  - device.hostname
  risk_score: 35
  security_domain: endpoint
  risk_severity: low
  research_site_url: https://research.splunk.com/endpoint/e8b74268-5454-11ec-a799-acde48001122/
  event_schema: ocsf
  mappings:
  - ocsf: process.pid
    cim: process_id
  - ocsf: process.file.path
    cim: process_path
  - ocsf: process.file.name
    cim: process_name
  - ocsf: process.cmd_line
    cim: process
  - ocsf: actor.user.name
    cim: user
  - ocsf: actor.process.pid
    cim: parent_process_id
  - ocsf: actor.process.file.path
    cim: parent_process_path
  - ocsf: actor.process.file.name
    cim: parent_process_name
  - ocsf: device.hostname
    cim: dest
  annotations:
    analytic_story:
    - DarkSide Ransomware
    - Ransomware
    - Insider Threat
    cis20:
    - CIS 10
    kill_chain_phases:
    - Actions on Objectives
    mitre_attack_id:
    - T1020
    nist:
    - DE.CM
test:
  name: Detect RClone Command-Line Usage Unit Test
  tests:
  - name: Detect RClone Command-Line Usage
    attack_data:
    - file_name: windows-security.log
      data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1020/windows-security.log
      source: WinEventLog:Security
runtime: SPL2
internalVersion: 2
