name: Anomalous usage of Archive Tools
id: 63614a58-10e2-4c6c-ae81-ea1113681439
version: 1
description: The following detection identifies the usage of archive tools from the
  command line.
search: ' | from read_ba_enriched_events() | eval timestamp = ucast(map_get(input_event,"time"),"long",
  null) | eval metadata = ucast(map_get(input_event, "metadata"),"map<string, any>",
  null) | eval metadata_uid = ucast(map_get(metadata, "uid"),"string", null) | eval
  process=ucast(map_get(input_event,"process"), "map<string, any>", null) | eval process_file=ucast(map_get(process,"file"),
  "map<string, any>", null) | eval process_file_name=ucast(map_get(process_file,"name"),
  "string", null) | eval actor=ucast(map_get(input_event,"actor"), "map<string, any>",
  null) | eval actor_process=ucast(map_get(actor,"process"), "map<string, any>", null)
  | eval actor_process_file=ucast(map_get(actor_process,"file"), "map<string, any>",
  null) | eval actor_process_file_name=ucast(map_get(actor_process_file,"name"), "string",
  null) | eval actor_process_cmd_line=ucast(map_get(actor_process,"cmd_line"), "string",
  null) | eval process_cmd_line=ucast(map_get(process,"cmd_line"), "string", null)
  | eval process_file_path=ucast(map_get(process_file,"path"), "string", null) | eval
  process_user=ucast(map_get(process,"user"), "map<string, any>", null) | eval process_user_name=ucast(map_get(process_user,"name"),
  "string", null) | eval device=ucast(map_get(input_event,"device"), "map<string,
  any>", null) | eval device_hostname=ucast(map_get(device,"hostname"), "string",
  null) | where (process_file_name="WinRAR.exe" OR like(process_file_name, "7z%")
  OR like(process_file_name, "winzip%")) AND (like(actor_process_file_name, "%powershell.exe")
  OR like(actor_process_file_name, "%cmd.exe")) 
  | eval body=create_map(
    "activity_id", 1,
    "analytic_stories", ["Cobalt Strike", "NOBELIUM Group", "Insider Threat"],
    "cis_csc", [create_map("control", "CIS 10", "version", 7)],
    "category_uid", 2,
    "class_name", "Detection Report",
    "class_uid", 102001,
    "confidence", 60,
    "confidence_id", 2,
    "devices", [
        create_map(
            "hostname", device_hostname, "type_id", 0, "uuid", ucast(map_get(device,"uuid"), "string", null)
        )
    ],
    "duration", 0,
    "time", timestamp,
    "evidence", create_map("process.user.name", process_user_name, "device.hostname", device_hostname, "process.file.name", process_file_name, "actor.process.file.name", actor_process_file_name, "actor.process.cmd_line", actor_process_cmd_line, "process.cmd_line", process_cmd_line),
    "impact", 70,
    "impact_id", 4,
    "kill_chain", [create_map("phase", "Exploitation", "phase_id", 4)],
    "attacks", [create_map("tactics", [create_map("name", "Collection", "uid", "TA0009")], "technique", create_map("name", "Archive via Utility", "uid", "T1560.001"), "version", "12.1"), create_map("tactics", [create_map("name", "Collection", "uid", "TA0009")], "technique", create_map("name", "Archive Collected Data", "uid", "T1560"), "version", "12.1")],  
    "message", concat("Anomalous usage of Archive Tools has been triggered on ", device_hostname, " by ", process_user_name, "."),
    "metadata", create_map(
        "product", create_map(
            "name", "Behavioral Analytic Service",
            "vendor_name", "Splunk"
        ),
        "version", "1.0.0"
    ),
    "nist", ["DE.AE"],
    "observables", [create_map("name", "process.user.name", "type_id", 4, "value", process_user_name), create_map("name", "device.hostname", "type_id", 1, "value", device_hostname), create_map("name", "process.file.name", "type_id", 7, "value", process_file_name), create_map("name", "actor.process.file.name", "type_id", 7, "value", actor_process_file_name), create_map("name", "actor.process.cmd_line", "type_id", 25, "value", actor_process_cmd_line), create_map("name", "process.cmd_line", "type_id", 99, "value", process_cmd_line)],
    "risk_level", "Medium",
    "risk_level_id", 2,
    "risk_score", 42,
    "severity_id", 4,
    "type_uid", 10200101,
    "users", [
        create_map(
            "name", process_user_name, "uuid", ucast(map_get(device,"uuid"), "string", null)
        )
    ]
  )
  | into write_ba_finding_events();'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: False positives can be ligitmate usage of archive tools from
  the command line.
references:
- https://attack.mitre.org/techniques/T1560/001/
tags:
  analytic_story:
  - Cobalt Strike
  - NOBELIUM Group
  - Insider Threat
  cis20:
  - CIS 10
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1560.001
  - T1560
  nist:
  - DE.AE
  required_fields:
  - process.user.name
  - device.hostname
  - process.file.name
  - actor.process.file.name
  - actor.process.cmd_line
  - process.cmd_line
  risk_score: 42
  security_domain: endpoint
  risk_severity: low
  research_site_url: https://research.splunk.com/endpoint/63614a58-10e2-4c6c-ae81-ea1113681439/
  event_schema: ocsf
  mappings:
  - ocsf: process.user.name
    cim: user
  - ocsf: device.hostname
    cim: dest
  - ocsf: process.file.name
    cim: process_name
  - ocsf: actor.process.file.name
    cim: parent_process_name
  - ocsf: actor.process.cmd_line
    cim: parent_process
  - ocsf: process.cmd_line
    cim: process
test:
  name: Anomalous usage of Archive Tools Unit Test
  tests:
  - name: Anomalous usage of Archive Tools
    attack_data:
    - file_name: windows-security.log
      data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1560.001/archive_tools/windows-security.log
      source: WinEventLog:Security
