name: Windows System Binary Proxy Execution MSIExec Unregister DLL
id: df76a8d1-92e1-4ec9-b8f7-695b5838703e
version: 1
description: The following analytic identifies the usage of msiexec.exe using the
  /z switch parameter, which grants the ability for msiexec to unload DLLRegisterServer.
  Upon triage, review parent process and capture any artifacts for further review.
search: ' | from read_ba_enriched_events() | eval timestamp = ucast(map_get(input_event,"time"),"long",
  null) | eval origin = ucast(map_get(input_event, "origin"),"map<string, any>", null)
  | eval metadata = ucast(map_get(input_event, "metadata"),"map<string, any>", null)
  | eval metadata_uid = ucast(map_get(metadata, "uid"),"string", null) | eval process=ucast(map_get(input_event,"process"),
  "map<string, any>", null) | eval process_pid=ucast(map_get(process,"pid"), "string",
  null) | eval process_file=ucast(map_get(process,"file"), "map<string, any>", null)
  | eval process_file_path=ucast(map_get(process_file,"path"), "string", null) | eval
  process_file_name=ucast(map_get(process_file,"name"), "string", null) | eval process_cmd_line=ucast(map_get(process,"cmd_line"),
  "string", null) | eval process_user=ucast(map_get(process,"user"), "map<string,
  any>", null) | eval process_user_name=ucast(map_get(process_user,"name"), "string",
  null) | eval actor=ucast(map_get(input_event,"actor"), "map<string, any>", null)
  | eval actor_process=ucast(map_get(actor,"process"), "map<string, any>", null) |
  eval actor_process_pid=ucast(map_get(actor_process,"pid"), "string", null) | eval
  actor_process_file=ucast(map_get(actor_process,"file"), "map<string, any>", null)
  | eval actor_process_file_path=ucast(map_get(actor_process_file,"path"), "string",
  null) | eval actor_process_file_name=ucast(map_get(actor_process_file,"name"), "string",
  null) | eval device=ucast(map_get(input_event,"device"), "map<string, any>", null)
  | eval device_hostname=ucast(map_get(device,"hostname"), "string", null) | where
  (like(process_cmd_line, "%-z %") OR like(process_cmd_line, "%/z %")) AND process_file_name="msiexec.exe"
  
  | eval body=create_map(
    "devices", [
        create_map(
            "hostname", device_hostname, "type_id", 0, "uuid", ucast(map_get(device,"uuid"), "string", null)
        )
    ],
    "time", timestamp,
    "evidence", create_map("process.user.name", process_user_name, "device.hostname", device_hostname, "process.file.name", process_file_name, "process.cmd_line", process_cmd_line),
    "message", concat("Windows System Binary Proxy Execution MSIExec Unregister DLL has been triggered on ", device_hostname, " by ", process_user_name, "."),
    "users", [
        create_map(
            "name", process_user_name, "uuid", ucast(map_get(process_user,"uuid"), "string", null)
        )
    ],
    "activity_id", 1,
    "category_uid", 2,
    "class_uid", 102001,
    "risk_level_id", 1,
    "risk_score", 35,
    "severity_id", 0,
    "rule", create_map("name", "Windows System Binary Proxy Execution MSIExec Unregister DLL", "version", 1, "uid", "df76a8d1-92e1-4ec9-b8f7-695b5838703e", "type", "Streaming"),
    "metadata", create_map("customer_uid", ucast(map_get(origin,"customer_uid"), "string", null), "product", create_map("name", "Behavior Analytics", "vendor_name", "Splunk"), "version", "1.0.0"),
    "type_uid", 10200101,
    "start_time", timestamp,
    "end_time", timestamp
  )
  | into write_ba_finding_events();'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: False positives may be present, filter by destination or parent
  process as needed.
references:
- https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.007/T1218.007.md
tags:
  required_fields:
  - process.user.name
  - device.hostname
  - process.file.name
  - process.cmd_line
  risk_score: 35
  security_domain: endpoint
  risk_severity: low
  research_site_url: https://research.splunk.com/endpoint/df76a8d1-92e1-4ec9-b8f7-695b5838703e/
  event_schema: ocsf
  mappings:
  - ocsf: process.pid
    cim: process_id
  - ocsf: process.file.path
    cim: process_path
  - ocsf: process.file.name
    cim: process_name
  - ocsf: process.cmd_line
    cim: process
  - ocsf: process.user.name
    cim: user
  - ocsf: actor.process.pid
    cim: parent_process_id
  - ocsf: actor.process.file.path
    cim: parent_process_path
  - ocsf: actor.process.file.name
    cim: parent_process_name
  - ocsf: device.hostname
    cim: dest
  annotations:
    analytic_story:
    - Windows System Binary Proxy Execution MSIExec
    cis20:
    - CIS 10
    kill_chain_phases:
    - Exploitation
    mitre_attack_id:
    - T1218.007
    nist:
    - DE.CM
test:
  name: Windows System Binary Proxy Execution MSIExec Unregister DLL Unit Test
  tests:
  - name: Windows System Binary Proxy Execution MSIExec Unregister DLL
    attack_data:
    - file_name: 4688_msiexec-windows-security.log
      data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.007/atomic_red_team/4688_msiexec-windows-security.log
      source: XmlWinEventLog
runtime: SPL-DSP
