name: Windows LOLBin Binary in Non Standard Path
id: 25689101-012a-324a-94d3-08301e6c065a
version: 4
status: production
description: The following analytic identifies native living off the land binaries
  within the Windows operating system that may be abused by adversaries by moving
  it to a new directory. The list of binaries was derived from the https://lolbas-project.github.io
  site, and excluded common process names (cmd.exe, explorer.exe, csc.exe, hh.exe,
  regedit.exe) and DotNet binaries. It also does not include the category of OtherMSBinaries.
search: ' $main = from source  | eval timestamp = time  | eval metadata_uid = metadata.uid  |
  eval process_pid = process.pid | eval process_file = process.file | eval process_file_path
  = process_file.path | eval process_file_name = lower(process_file.name) | eval process_cmd_line
  = process.cmd_line | eval actor_user = actor.user | eval actor_user_name = actor_user.name
  | eval actor_process = actor.process | eval actor_process_pid = actor_process.pid
  | eval actor_process_file = actor_process.file | eval actor_process_file_path =
  actor_process_file.path | eval actor_process_file_name = actor_process_file.name
  | eval device_hostname = device.hostname | where (process_file_name IN ("bitsadmin.exe",
  "certoc.exe", "certreq.exe", "certutil.exe", "cmdkey.exe", "cmdl32.exe", "cmstp.exe",
  "configsecuritypolicy.exe", "control.exe", "cscript.exe", "datasvcutil.exe", "desktopimgdownldr.exe",
  "dfsvc.exe", "diantz.exe", "diskshadow.exe", "dllhost.exe", "dnscmd.exe", "esentutl.exe",
  "eventvwr.exe", "expand.exe", "extexport.exe", "extrac32.exe", "findstr.exe", "finger.exe",
  "fltmc.exe", "forfiles.exe", "ftp.exe", "gfxdownloadwrapper.exe", "gpscript.exe",
  "imewdbld.exe", "ie4uinit.exe", "ieexec.exe", "ilasm.exe", "infdefaultinstall.exe",
  "makecab.exe", "mavinject.exe", "microsoft.workflow.compiler.exe", "mmc.exe", "msconfig.exe",
  "msdt.exe", "mshta.exe", "msiexec.exe", "netsh.exe", "odbcconf.exe", "offlinescannershell.exe",
  "pcalua.exe", "pcwrun.exe", "pktmon.exe", "pnputil.exe", "presentationhost.exe",
  "print.exe", "printbrm.exe", "psr.exe", "rasautou.exe", "reg.exe", "regini.exe",
  "register-cimprovider.exe", "regsvr32.exe", "replace.exe", "rpcping.exe", "rundll32.exe",
  "runonce.exe", "runscripthelper.exe", "sc.exe", "schtasks.exe", "scriptrunner.exe",
  "settingsynchost.exe", "syncappvpublishingserver.exe", "ttdinject.exe", "tttracer.exe",
  "vbc.exe", "verclsid.exe", "wab.exe", "wlrmdr.exe", "wmic.exe", "workfolders.exe",
  "wscript.exe", "wsreset.exe", "wuauclt.exe", "xwizard.exe")) AND (NOT (match(process_file_path,
  /(?i)(?i)\\windows\\system32/)=true OR match(process_file_path, /(?i)(?i)\\windows\\syswow64/)=true
  OR match(process_file_path, /(?i)(?i)\\windows\\networkcontrolle/)=true OR match(process_file_path,
  /(?i)(?i)\\windows\\systemapps/)=true OR match(process_file_path, /(?i)(?i)\\winsxs/)=true
  OR match(process_file_path, /(?i)(?i)\\microsoft.net/)=true)) 
  | eval devices = [{"hostname": device_hostname, "type_id": 0, "uuid": device.uuid}],
    time = timestamp,
    evidence = {"process.pid": process_pid, "process.file.path": process_file_path, "process.file.name": process_file_name, "process.cmd_line": process_cmd_line, "actor.user.name": actor_user_name, "actor.process.pid": actor_process_pid, "actor.process.file.path": actor_process_file_path, "actor.process.file.name": actor_process_file_name, "device.hostname": device_hostname},
    message = "Windows LOLBin Binary in Non Standard Path has been triggered on " + device_hostname + " by " + actor_user_name + ".",
    users = [{"name": actor_user_name, "uid": actor_user.uid}],
    activity_id = 1,
    cis_csc = [{"control": "CIS 10", "version": 8}], 
    analytic_stories = ["Unusual Processes", "Ransomware", "WhisperGate"],
    class_name = "Detection Report", 
    confidence = 70,
    confidence_id = 3,
    duration = 0, 
    impact = 70,
    impact_id = 4,
    kill_chain = [{"phase": "Exploitation", "phase_id": 4}],
    nist = ["DE.AE"], 
    risk_level = "Medium", 
    category_uid = 2,
    class_uid = 102001,
    risk_level_id = 2,
    risk_score = 49,
    severity_id = 0,
    rule = {"name": "Windows LOLBin Binary in Non Standard Path", "uid": "25689101-012a-324a-94d3-08301e6c065a", "type": "Streaming"},
    metadata = {"customer_uid": metadata.customer_uid, "product": {"name": "Behavior Analytics", "vendor_name": "Splunk"}, "version": "1.0.0-rc.2", "logged_time": time()},
    type_uid = 10200101,
    start_time = timestamp,
    end_time = timestamp
  | fields metadata, rule, activity_id, analytic_stories, cis_csc, category_uid, class_name, class_uid, confidence, confidence_id, devices, duration, time, evidence, impact, impact_id, kill_chain, message, nist, observables, risk_level, risk_level_id, risk_score, severity_id, type_uid, users, start_time, end_time 
  | into sink; '
how_to_implement: Collect endpoint data such as sysmon or 4688 events.
known_false_positives: False positives may be present and filtering may be required.
  Certain utilities will run from non-standard paths based on the third-party application
  in use.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1036.003/T1036.003.yaml
- https://attack.mitre.org/techniques/T1036/003/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.004/T1218.004.md
tags:
  required_fields:
  - process.pid
  - process.file.path
  - process.file.name
  - process.cmd_line
  - actor.user.name
  - actor.process.pid
  - actor.process.file.path
  - actor.process.file.name
  - device.hostname
  risk_score: 49
  security_domain: endpoint
  risk_severity: low
  research_site_url: https://research.splunk.com/endpoint/25689101-012a-324a-94d3-08301e6c065a/
  event_schema: ocsf
  mappings:
  - ocsf: process.pid
    cim: process_id
  - ocsf: process.file.path
    cim: process_path
  - ocsf: process.file.name
    cim: process_name
  - ocsf: process.cmd_line
    cim: process
  - ocsf: actor.user.name
    cim: user
  - ocsf: actor.process.pid
    cim: parent_process_id
  - ocsf: actor.process.file.path
    cim: parent_process_path
  - ocsf: actor.process.file.name
    cim: parent_process_name
  - ocsf: device.hostname
    cim: dest
  annotations:
    analytic_story:
    - Unusual Processes
    - Ransomware
    - WhisperGate
    cis20:
    - CIS 10
    kill_chain_phases:
    - Exploitation
    mitre_attack_id:
    - T1036
    - T1036.003
    - T1218
    - T1218.004
    nist:
    - DE.AE
test:
  name: Windows LOLBin Binary in Non Standard Path Unit Test
  tests:
  - name: Windows LOLBin Binary in Non Standard Path
    attack_data:
    - file_name: dotnet_lolbin-windows-security.log
      data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1036/system_process_running_unexpected_location/dotnet_lolbin-windows-security.log
      source: WinEventLog:Security
runtime: SPL2
internalVersion: 2
