name: Executable File Written in Administrative SMB Share
id: d3bba9cb-c066-4e49-a81e-29eeb8e8506b
version: 1
status: validation
detection_type: STREAMING
description: The following analytic identifies executable files (.exe or .dll) being
  written to Windows administrative SMB shares (Admin$, IPC$, C$). This represents
  suspicious behavior as its commonly used by tools like PsExec/PaExec and others
  to stage service binaries before creating and starting a Windows service on remote
  endpoints. Red Teams and adversaries alike may abuse administrative shares for lateral
  movement and remote code execution. The Trickbot malware family also implements
  this behavior to try to infect other machines in the infected network.
search: ' $main = from source  | eval timestamp = time  | eval metadata_uid = metadata.uid  |
  eval file_type = lower(file.type) | eval actor_user = actor.user | eval actor_user_domain
  = actor_user.domain | eval src_endpoint_ip = src_endpoint.ip | eval file_path =
  file.path | eval src_endpoint_port = src_endpoint.port | eval actor_user_name =
  actor_user.name | eval actor_session = actor.session | eval actor_session_uid =
  actor_session.uid | eval actor_user_uid = actor_user.uid | eval device_hostname
  = device.hostname | where (file_path LIKE "%.exe" OR file_path LIKE "%.dll") AND
  file_type="file" AND (share LIKE "\\%\\c$" OR share LIKE "\\%\\ipc$" OR share LIKE
  "\\%\\admin$") AND access_mask=2 
  | eval devices = [{"hostname": device_hostname, "type_id": 0, "uuid": device.uuid}],
    time = timestamp,
    evidence = {, "sourceType": metadata.source_type, "source": metadata.source},
    message = "Executable File Written in Administrative SMB Share has been triggered on " + device_hostname + " by " + actor_user_name + ".",
    users = [{"name": actor_user_name, "uuid": actor_user.uuid, "uid": actor_user.uid}],
    activity_id = 1,
    cis_csc = [{"control": "CIS 10", "version": 8}], 
    analytic_stories = ["Active Directory Lateral Movement", "Prestige Ransomware", "Graceful Wipe Out Attack", "Industroyer2", "IcedID", "Data Destruction", "Hermetic Wiper", "Trickbot"],
    class_name = "Detection Report", 
    confidence = 100,
    confidence_id = 3,
    duration = 0, 
    impact = 70,
    impact_id = 4,
    kill_chain = [],
    nist = ["DE.AE"], 
    risk_level = "High", 
    category_uid = 2,
    class_uid = 102001,
    risk_level_id = 3,
    risk_score = 70,
    severity_id = 0,
    rule = {"name": "Executable File Written in Administrative SMB Share", "uid": "d3bba9cb-c066-4e49-a81e-29eeb8e8506b", "type": "Streaming"},
    metadata = {"customer_uid": metadata.customer_uid, "product": {"name": "Behavior Analytics", "vendor_name": "Splunk"}, "version": "1.0.0-rc.2", "logged_time": time()},
    type_uid = 10200101,
    start_time = timestamp,
    end_time = timestamp
  | fields metadata, rule, activity_id, analytic_stories, cis_csc, category_uid, class_name, class_uid, confidence, confidence_id, devices, duration, time, evidence, impact, impact_id, kill_chain, message, nist, observables, risk_level, risk_level_id, risk_score, severity_id, type_uid, users, start_time, end_time 
  | into sink; '
how_to_implement: To successfully implement this search, you need to be ingesting
  Windows Security Event Logs with 5145 EventCode enabled. The Windows TA is also
  required. Also enable the object Audit access success/failure in your group policy.
known_false_positives: System Administrators may use looks like PsExec for troubleshooting
  or administrations tasks. However, this will typically come only from certain users
  and certain systems that can be added to an allow list.
references:
- https://attack.mitre.org/techniques/T1021/002/
- https://www.rapid7.com/blog/post/2013/03/09/psexec-demystified/
- https://labs.vipre.com/trickbot-and-its-modules/
- https://whitehat.eu/incident-response-case-study-featuring-ryuk-and-trickbot-part-2/
- https://thedfirreport.com/2023/05/22/icedid-macro-ends-in-nokoyawa-ransomware/
tags:
  required_fields:
  - share
  - file.type
  - access_mask
  - actor.user.domain
  - src_endpoint.ip
  - access_result
  - file.path
  - src_endpoint.port
  - actor.user.name
  - actor.session.uid
  - actor.user.uid
  - access_list
  - device.hostname
  risk_score: 70
  security_domain: endpoint
  risk_severity: medium
  research_site_url: https://research.splunk.com/endpoint/d3bba9cb-c066-4e49-a81e-29eeb8e8506b/
  event_schema: ocsf
  mappings:
  - ocsf: access_list
    cim: access_list
  - ocsf: access_mask
    cim: access_mask
  - ocsf: access_result
    cim: access_result
  - ocsf: file.path
    cim: relative_target_name
  - ocsf: src_endpoint.ip
    cim: src_ip
  - ocsf: src_endpoint.port
    cim: src_port
  - ocsf: actor.user.name
    cim: user
  - ocsf: share
    cim: share
  - ocsf: file.type
    cim: object_type
  - ocsf: actor.user.domain
    cim: user_domain
  - ocsf: actor.session.uid
    cim: user_logon_id
  - ocsf: actor.user.uid
    cim: user_sid
  - ocsf: device.hostname
    cim: dest
  annotations:
    analytic_story:
    - Active Directory Lateral Movement
    - Prestige Ransomware
    - Graceful Wipe Out Attack
    - Industroyer2
    - IcedID
    - Data Destruction
    - Hermetic Wiper
    - Trickbot
    cis20:
    - CIS 10
    kill_chain_phases: []
    mitre_attack_id:
    - T1021
    - T1021.002
    nist:
    - DE.CM
test:
  name: Executable File Written in Administrative SMB Share Unit Test
  tests:
  - name: Executable File Written in Administrative SMB Share
    attack_data:
    - file_name: windows-xml.log
      data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/trickbot/exe_smbshare/windows-xml.log
      source: XmlWinEventLog:Security
runtime: SPL2
internalVersion: 2
