creation_date: '2017-08-22'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search provides the process information for the parent process
  of the process that is being investigated.
entities:
  - parent_process_id
  - dest
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your systems. This data must be CIM compliant
  for it to populate the Endpoint data model.
id: fecf2918-670d-4f1c-872b-3d7317a41bf9
investigate:
  splunk:
    fields_required:
      - parent_process_id
      - dest
    schedule:
      earliest_time: '43200'
      latest_time: '0'
    search: '| tstats `summariesonly` values(Processes.process) as parent_process,
      values(Processes.process_name) as parent_process_name,
      values(Processes.parent_process_name) as grandparent_process_name,
      values(Processes.parent_process_id) as grandparent_process_id
      earliest(_time) as parent_process_start_time FROM datamodel=Endpoint.Processes where
      Processes.process_id={parent_process_id} AND Processes.dest={dest} by
      Processes.process_id, Processes.dest, Processes.user
      | `drop_dm_object_name("Processes")`
      | `ctime(firstTime)`| `ctime(lastTime)`
      | table process_id, dest, user, parent_process_name, parent_process,
      grandparent_process_id, grandparent_process_name'
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
modification_date: '2019-11-23'
name: Get Parent Process Info
original_authors:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
spec_version: 2
type: splunk
version: '3.0'
