creation_date: '2019-11-06'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search returns the registry activity for a specific process on a specific endpoint
entities:
  - process_id
  - dest
how_to_implement: To successfully implement this search you must be ingesting endpoint
  data and populating the Endpoint data model.
id: d8362a34-b78a-4364-9733-59b505f5b8d5
investigate:
  splunk:
    fields_required:
      - process_id
      - dest
    schedule:
      cron_schedule: ''
      earliest_time: '7200'
      latest_time: '7200'
    search: '| tstats `security_content_summariesonly` values(Registry.registry_key_name) as registry_key_name,
            values(Registry.dest) as dest, values(Registry.process_id) as process_id from
            datamodel=Endpoint.Registry where Registry.process_id={process_id} AND Registry.dest={dest}
            by Registry.registry_path, Registry.action, _time
            | `drop_dm_object_name(Registry)` | sort _time
            | table _time, process_id, dest, action, registry_key_name, registry_path'
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
modification_date: '2019-11-06'
name: Get Process Registry Activity
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
spec_version: 2
type: splunk
version: '2.0'
