creation_date: '2018-10-23'
data_metadata:
  data_source:
    - Endpoint Intel
  data_sourcetypes:
    - XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  providing_technologies:
    - Sysmon
description: This search queries Sysmon WMI events for the host of interest.
entities:
  - process
  - dest
how_to_implement: To successfully implement this search, you must be collecting Sysmon
  data using Sysmon version 6.1 or greater and have Sysmon configured to generate
  events for WMI activity. In addition, you must have at least version 6.0.4 of the
  Sysmon TA installed to properly parse the fields.
id: 155e0571-7db6-42f2-aa62-9a3a4cf35c94
investigate:
  splunk:
    fields_required:
      - process
      - dest
    schedule:
      cron_schedule: ''
      earliest_time: '7200'
      latest_time: '7200'
    search: sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode>18
      EventCode<22 host={dest} | rename host as dest | table _time, dest, user, Name,
      Operation, EventType, Type, Query, Consumer, Filter
maintainers:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
modification_date: '2018-10-23'
name: Get Sysmon WMI Activity for Host
original_authors:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
spec_version: 2
type: splunk
version: '1.0'
