creation_date: '2019-11-06'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search returns the file activity for a specific process on a specific endpoint
entities:
  - process_id
  - dest
how_to_implement: To successfully implement this search you must be ingesting endpoint
  data and populating the Endpoint data model.
id: 6a9ad4d9-6ef2-4b85-953f-a37ab256acd5
investigate:
  splunk:
    fields_required:
      - process_id
      - dest
    schedule:
      cron_schedule: ''
      earliest_time: '7200'
      latest_time: '7200'
    search: '| tstats `security_content_summariesonly` values(Filesystem.file_name) as file_name values(Filesystem.dest) as dest,
            values(Filesystem.process_id) as process_id from
            datamodel=Endpoint.Filesystem where Filesystem.dest={dest} Filesystem.process_id={process_id}
            by Filesystem.file_path, Filesystem.action, _time 
            | `drop_dm_object_name(Filesystem)`  | sort _time
            | table _time, process_id, dest, action, file_name, file_path'
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
modification_date: '2019-11-06'
name: Get Process File Activity
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
spec_version: 2
type: splunk
version: '2.0'
