creation_date: "2020-03-24"
data_metadata:
  data_source:
    - "GCP Stackdriver logs"
  data_sourcetypes:
    - "google:gcp:pubsub:message"
  providing_technologies:
    - GCP
description: This search provides investigation data about requests via user agent, authentication request URI, resource path and cluster name data against Kubernetes cluster from a specific IP address
entities:
  - src_user
how_to_implement: "You must install the GCP App for Splunk (version 2.0.0 or later), then configure stackdriver and set a Pub/Sub subscription to be imported to Splunk. You must also install Cloud Infrastructure data model.Customize the macro kubernetes_gcp_scan_fingerprint_attack_detection to filter out FPs."
id: c00e7626-92cc-4e06-9a51-b6db0a50bd1f
investigate:
  splunk:
    fields_required:
      - src_user
    schedule:
      cron_schedule: "0 * * * *"
      earliest_time: "-70m@m"
      latest_time: "-10m@m"
    search: sourcetype="google:gcp:pubsub:message" data.protoPayload.requestMetadata.callerIp={src_ip} | rename data.protoPayload.requestMetadata.callerIp as src_ip | stats count min(_time) as firstTime max(_time) as lastTime values(data.protoPayload.methodName) as method_names values(data.protoPayload.resourceName) as resource_name values(data.protoPayload.requestMetadata.callerSuppliedUserAgent) as http_user_agent values(data.protoPayload.authenticationInfo.principalEmail) as user values(data.protoPayload.status.message) by src_ip data.resource.labels.cluster_name data.resource.type
maintainers:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
modification_date: "2020-04-13"
name: GCP Kubernetes activity by src_ip
original_authors:
  - company: Splunk
    email: rsoto@splunk.com
    name: "Rod Soto"
spec_version: 2
type: splunk
version: "1.0"
