creation_date: "2020-03-24"
data_metadata:
  data_source:
    - AWS CloudWatch EKS Logs
  data_sourcetypes:
    - aws:cloudwatchlogs:eks
  providing_technologies:
    - AWS
description: This search provides investigation data about requests via user agent, authentication request URI, verb and cluster name data against Kubernetes cluster from a specific IP address
entities:
  - src_ip
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later) and Splunk Add-on for AWS (version 4.4.0 or later), then configure your Cloud Watch EKS inputs.
id: a636cca4-7434-4a15-a278-c70734938e39
investigate:
  splunk:
    fields_required:
      - src_ip
    schedule:
      cron_schedule: 0 * * * *
      earliest_time: -70m@m
      latest_time: -10m@m
    search: sourcetype="aws:cloudwatchlogs:eks" sourceIPs{}={src_ip} | stats count min(_time) as firstTime max(_time) as lastTime values(user.username) values(requestURI) values(verb) values(userAgent) by source annotations.authorization.k8s.io/decision src_ip
maintainers:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
modification_date: "2020-04-13"
name: Amazon EKS Kubernetes activity by src_ip
original_authors:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
references: []
security_domain: threat
spec_version: 2
type: splunk
version: "1.0"
