asset_type: Amazon EKS Kubernetes cluster Pod
confidence: medium
creation_date: '2020-03-24'
data_metadata:
  data_source:
    - AWS CloudWatch EKS Logs
  data_sourcetypes:
    - aws:cloudwatchlogs:eks
  providing_technologies:
    - AWS
description: This search provides investigation data on unauthenticated requests against Kubernetes' Pods API and resources
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: user.username, sourceIPs, verb, http_user_agent, group_name, requestURI
        rule_description: Detect EKS Pod fingerprint scan
        rule_title: Kubernetes Pod fingerprint detection scan
      risk:
        risk_object: k8s_cluster_name
        risk_object_type:
          - other
        risk_score: 70
      macros:
        - kubernetes_pods_aws_scan_fingerprint_detection
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: index=aws_k8s sourcetype="aws:cloudwatchlogs:eks" "user.username"="system:anonymous" verb=* objectRef.resource=pods requestURI="/api/v1/pods" | table src_ip user.username verb objectRef.resource requestURI userAgent status annotations.authorization.k8s.io/decision stage
eli5: In this search we can detect unauthenticated web requests against an EKS cluster Pod, by looking at k8s authentication data, user agent and source IPs and API direct request.
entities:
  - user.username
how_to_implement:  You must install the AWS App for Splunk (version 5.1.0 or later) and Splunk Add-on forAWS (version 4.4.0 or later), then configure your AWS CloudWatch EKS Logs.Please also customize the `kubernetes_pods_aws_scan_fingerprint_detection` macro to filter out the false positives.
id: 895558ca-ad87-44ae-94b7-5c659bdfc7a9
known_false_positives: Not all unauthenticated requests are malicious, but frequency, UA and source IPs and direct request to API and POD resources provides context.
maintainers:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
mappings:
  mitre_attack:
    - Discovery
  kill_chain_phases:
    - Reconnaissance
  mitre_technique_id:
    - T1190
modification_date: '2020-04-13'
name: Amazon EKS Kubernetes Pod fingerprint scan investigation
original_authors:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
references: []
security_domain: threat
spec_version: 2
type: splunk
version: '1.0'
