name: Detect Remote Access Software Usage (URL)
id: 9296f515-073c-43a5-88ec-eda5a4626654
version: 1
date: '2024-02-22'
author: Steven Dick
status: production
type: TTP
description: The following analytic detects when a known remote access software is executed with the environment. Adversaries use these utilities to retain remote access capabilities to the environment. Utilities in the lookup include AnyDesk, GoToMyPC, LogMeIn, TeamViewer and much more. Review the lookup for the entire list and add any others.
data_source:
- Palo Alto NextGen Firewall
search: '| tstats count min(_time) as firstTime max(_time) as lastTime latest(Web.http_method) as http_method latest(Web.http_user_agent) as http_user_agent latest(Web.url) as url latest(Web.user) as user latest(Web.dest) as dest from datamodel=Web by Web.action Web.src Web.category Web.url_domain
| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)` 
| `drop_dm_object_name("Web")`
| lookup remote_access_software remote_domain AS url_domain OUTPUT isutility, description as app, comment_reference as desc, category
| search isutility = True
| `detect_remote_access_software_usage_url_filter`'
how_to_implement: The following analytic requires url filtering logs to be imported and normalized to CIM datamodels.
known_false_positives: Known or approved applications used by the organization or usage of built-in functions.
references:
- https://attack.mitre.org/techniques/T1219/
- https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
- https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
tags:
  analytic_story:
  - Insider Threat
  - Command And Control
  - Ransomware
  asset_type: Network
  confidence: 50
  impact: 50
  message: A known remote access software [$app$] domain was contacted by $src$
  mitre_attack_id:
  - T1219
  observable:
  - name: src
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  - name: url_domain
    type: Hostname
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Web.action
  - Web.src
  - Web.category 
  - Web.url_domain
  risk_score: 25
  security_domain: network
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1219/screenconnect/screenconnect_palo.log
    source: screenconnect_palo
    sourcetype: pan:threat