name: Detect Windows DNS SIGRed via Zeek
id: c5c622e4-d073-11ea-87d0-0242ac130003
version: 1
date: '2020-07-28'
author: Shannon Davis, Splunk
status: experimental
type: TTP
description: |-
  The following analytic detects the presence of SIGRed, a critical DNS vulnerability, using Zeek DNS and Zeek Conn data. SIGRed vulnerability allows attackers to run remote code on Windows DNS servers. By detecting SIGRed early, you can prevent further damage and protect the organization's network infrastructure. The detection is made by identifying specific DNS query types (SIG and KEY) in the Zeek DNS data and checks for high data transfer in the Zeek Conn data. If multiple instances of these indicators are found within a flow, it suggests the presence of SIGRed. The detection is important because it indicates a potential compromise of Windows DNS servers that suggests that an attacker might have gained unauthorized access to the DNS server and can run arbitrary code. The impact of this attack can be severe, leading to data exfiltration, unauthorized access, or disruption of critical services. Next steps include investigating the affected flow and taking immediate action to mitigate the vulnerability. This can involve patching the affected DNS server, isolating the server from the network, or conducting a forensic analysis to determine the extent of the compromise.
data_source: []
search: '| tstats `security_content_summariesonly` count from datamodel=Network_Resolution
  where DNS.query_type IN (SIG,KEY) by DNS.flow_id | rename DNS.flow_id as flow_id
  | append [| tstats  `security_content_summariesonly` count from datamodel=Network_Traffic
  where All_Traffic.bytes_in>65000 by All_Traffic.flow_id | rename All_Traffic.flow_id
  as flow_id] | `detect_windows_dns_sigred_via_zeek_filter` | stats count by flow_id
  | where count>1 | fields - count '
how_to_implement: You must be ingesting Zeek DNS and Zeek Conn data into Splunk. Zeek
  data should also be getting ingested in JSON format.  We are detecting SIG and KEY
  records via bro:dns:json and TCP payload over 65KB in size via bro:conn:json.  The
  Network Resolution and Network Traffic datamodels are in use for this search.
known_false_positives: unknown
references: []
tags:
  analytic_story:
  - Windows DNS SIGRed CVE-2020-1350
  asset_type: Endpoint
  confidence: 50
  cve:
  - CVE-2020-1350
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1203
  observable:
  - name: dest
    type: Other
    role:
    - Other
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - DNS.query_type
  - DNS.flow_id
  - All_Traffic.bytes_in
  - All_Traffic.flow_id
  risk_score: 25
  security_domain: endpoint
