name: Detect Software Download To Network Device
id: cc590c66-f65f-48f2-986a-4797244762f8
version: 2
date: '2024-05-20'
author: Mikael Bjerkeland, Splunk
status: experimental
type: TTP
description: The following analytic identifies unauthorized software downloads to
  network devices via TFTP, FTP, or SSH/SCP. It detects this activity by analyzing
  network traffic events on specific ports (69, 21, 22) from devices categorized as
  network, router, or switch. This activity is significant because adversaries may
  exploit netbooting to load unauthorized operating systems, potentially compromising
  network integrity. If confirmed malicious, this could lead to unauthorized control
  over network devices, enabling further attacks, data exfiltration, or persistent
  access within the network.
data_source: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Network_Traffic where (All_Traffic.transport=udp AND
  All_Traffic.dest_port=69) OR (All_Traffic.transport=tcp AND All_Traffic.dest_port=21)
  OR (All_Traffic.transport=tcp AND All_Traffic.dest_port=22) AND All_Traffic.dest_category!=common_software_repo_destination
  AND All_Traffic.src_category=network OR All_Traffic.src_category=router OR All_Traffic.src_category=switch
  by All_Traffic.src All_Traffic.dest All_Traffic.dest_port | `drop_dm_object_name("All_Traffic")`
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `detect_software_download_to_network_device_filter`'
how_to_implement: This search looks for Network Traffic events to TFTP, FTP or SSH/SCP
  ports from network devices. Make sure to tag any network devices as network, router
  or switch in order for this detection to work. If the TFTP traffic doesn't traverse
  a firewall nor packet inspection, these events will not be logged. This is typically
  an issue if the TFTP server is on the same subnet as the network device. There is
  also a chance of the network device loading software using a DHCP assigned IP address
  (netboot) which is not in the Asset inventory.
known_false_positives: This search will also report any legitimate attempts of software
  downloads to network devices as well as outbound SSH sessions from network devices.
references: []
tags:
  analytic_story:
  - Router and Infrastructure Security
  asset_type: Infrastructure
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1542.005
  - T1542
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Traffic.transport
  - All_Traffic.dest_port
  - All_Traffic.dest_category
  - All_Traffic.src_category
  - All_Traffic.src
  - All_Traffic.dest
  risk_score: 25
  security_domain: network
