name: Detect suspicious DNS TXT records using pretrained model in DSDL
id: 92f65c3a-968c-11ed-a1eb-0242ac120002
version: 2
date: '2024-05-13'
author: Abhinav Mishra, Kumar Sharad and Namratha Sreekanta, Splunk
status: experimental
type: Anomaly
description: The following analytic identifies suspicious DNS TXT records using a
  pre-trained deep learning model. It leverages DNS response data from the Network
  Resolution data model, categorizing TXT records into known types via regular expressions.
  Records that do not match known patterns are flagged as suspicious. This activity
  is significant as DNS TXT records can be used for data exfiltration or command-and-control
  communication. If confirmed malicious, attackers could use these records to covertly
  transfer data or receive instructions, posing a severe threat to network security.
data_source: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Network_Resolution where DNS.message_type=response AND
  DNS.record_type=TXT by DNS.src DNS.dest DNS.answer DNS.record_type | `drop_dm_object_name("DNS")`
  | rename answer as text | fields firstTime, lastTime, message_type,record_type,src,dest,
  text | apply detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl |
  rename predicted_is_unknown as is_suspicious_score | where is_suspicious_score >
  0.5 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` |
  table src,dest,text,record_type, firstTime, lastTime,is_suspicious_score | `detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl_filter`'
how_to_implement: 'Steps to deploy detect suspicious DNS TXT records model into Splunk
  App DSDL. This detection depends on the Splunk app for Data Science and Deep Learning
  which can be found here - `https://splunkbase.splunk.com/app/4607/` and the Network
  Resolution datamodel which can be found here - `https://splunkbase.splunk.com/app/1621/`.
  The detection uses a pre-trained deep learning model that needs to be deployed in
  DSDL app. Follow the steps for deployment here - `https://github.com/splunk/security_content/wiki/How-to-deploy-pre-trained-Deep-Learning-models-for-ESCU`.

  * Download the `artifacts .tar.gz` file from the link - `https://seal.splunkresearch.com/detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.tar.gz`.

  * Download the `detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.ipynb`
  Jupyter notebook from `https://github.com/splunk/security_content/notebooks`.

  * Login to the Jupyter Lab assigned for  `detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl`
  container. This container should be listed on Containers page for DSDL app.

  * Below steps need to be followed inside Jupyter lab.

  * Upload the `detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.tar.gz`
  file into `app/model/data` path using the upload option in the jupyter notebook.

  * Untar the artifact `detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.tar.gz`
  using `tar -xf app/model/data/detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.tar.gz
  -C app/model/data`.

  * Upload detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.ipynb`
  into Jupyter lab notebooks folder using the upload option in Jupyter lab.

  * Save the notebook using the save option in Jupyter notebook.

  * Upload `detect_suspicious_dns_txt_records_using_pretrained_model_in_dsdl.json`
  into `notebooks/data` folder.'
known_false_positives: False positives may be present if DNS TXT record contents are
  similar to benign DNS TXT record contents.
references:
- https://attack.mitre.org/techniques/T1071/004/
- https://unit42.paloaltonetworks.com/dns-tunneling-how-dns-can-be-abused-by-malicious-actors/
- https://en.wikipedia.org/wiki/TXT_record
tags:
  analytic_story:
  - DNS Hijacking
  - Suspicious DNS Traffic
  - Command And Control
  asset_type: Endpoint
  confidence: 90
  impact: 50
  message: A suspicious DNS TXT response was detected on host $src$ , kindly review.
  mitre_attack_id:
  - T1568.002
  observable:
  - name: answer
    type: Other
    role:
    - Attacker
  - name: src
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - DNS.message_type
  - DNS.record_type
  - DNS.src
  - DNS.dest
  - DNS.answer
  risk_score: 45
  security_domain: network
