name: Detect Outbound LDAP Traffic
id: 5e06e262-d7cd-4216-b2f8-27b437e18458
version: 1
date: '2021-12-13'
author: Bhavin Patel, Johan Bjerke, Splunk
type: Hunting
datamodel:
- Network_Traffic
description: Malicious actors often abuse misconfigured LDAP servers or applications
  that use the LDAP servers in organizations. Outbound LDAP traffic should not be
  allowed outbound through your perimeter firewall.  This search will help determine
  if you have any LDAP connections to IP addresses outside of private (RFC1918) address
  space.
search: '| tstats earliest(_time) as earliest_time latest(_time) as latest_time values(All_Traffic.dest_ip)
  as dest_ip from datamodel=Network_Traffic.All_Traffic where All_Traffic.dest_port
  = 389 OR All_Traffic.dest_port = 636 AND NOT (All_Traffic.dest_ip = 10.0.0.0/8 OR
  All_Traffic.dest_ip=192.168.0.0/16 OR All_Traffic.dest_ip = 172.16.0.0/12) by All_Traffic.src_ip
  All_Traffic.dest_ip |`drop_dm_object_name("All_Traffic")` | where src_ip != dest_ip
  | `security_content_ctime(latest_time)`  | `security_content_ctime(earliest_time)`
  |`detect_outbound_ldap_traffic_filter`'
how_to_implement: You must be ingesting Zeek DNS and Zeek Conn data into Splunk. Zeek
  data should also be getting ingested in JSON format and should be mapped to the
  Network Traffic datamodels that are in use for this search.
known_false_positives: Unknown at this moment. Outbound LDAP traffic should not be
  allowed outbound through your perimeter firewall. Please check those servers to
  verify if the activity is legitimate.
references:
- https://www.govcert.ch/blog/zero-day-exploit-targeting-popular-java-library-log4j/
tags:
  analytic_story:
  - Log4Shell CVE-2021-44228
  asset_type: Endpoint
  cis20:
  - CIS 12
  - CIS 13
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Initial Access
  cve:
  - CVE-2021-44228
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1190/outbound_ldap/bro_conn.json
  impact: 70
  kill_chain_phases:
  - Command & Control
  - Actions on Objectives
  message: An outbound LDAP connection from $src_ip$ in your infrastructure connecting
    to dest ip $dest_ip$
  mitre_attack_id:
  - T1190
  - T1059
  nist:
  - PR.DS
  - PR.PT
  - DE.AE
  - DE.CM
  observable:
  - name: src_ip
    type: IP Address
    role:
    - Victim
  - name: dest_ip
    type: IP Address
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Traffic.dest_ip
  - All_Traffic.dest_port
  - All_Traffic.src_ip
  risk_score: 56
  security_domain: network
