name: Plain HTTP POST Exfiltrated Data
id: e2b36208-a364-11eb-8909-acde48001122
version: 1
date: '2021-04-22'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Network_Traffic
description: This search is to detect potential plain http post method data exfiltration.
  This network traffic is commonly used by trickbot, trojanspy, keylogger or APT attacker where they send a plain txt file 
  C2 server through http post method as part of data exfiltration.
search: '`stream_http` http_method=POST 
  form_data IN ("*wermgr.exe*","*svchost.exe*", "*name=\"proclist\"*","*ipconfig*", "*name=\"sysinfo\"*", "*net view*")
  |stats values(form_data) as http_request_body min(_time) as firstTime max(_time) as lastTime count 
  by http_method http_user_agent uri_path url bytes_in bytes_out 
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `plain_http_post_exfiltrated_data_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the stream HTTP logs or network logs that catch network traffic.
  Make sure that the http-request-body, payload, or request field is enabled.
known_false_positives: unknown
references:
- https://blog.talosintelligence.com/2020/03/trickbot-primer.html
tags:
  analytic_story:
  - Command and Control
  kill_chain_phases:
  - Exfiltration
  mitre_attack_id:
  - T1048.003
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - http_method
  - http_user_agent
  - uri_path
  - url
  - bytes_in
  - bytes_out
  security_domain: network