name: Plain HTTP POST Exfiltrated Data
id: e2b36208-a364-11eb-8909-acde48001122
version: 1
date: '2021-04-22'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Network_Traffic
description: This search is to detect potential plain HTTP POST method data exfiltration.
  This network traffic is commonly used by trickbot, trojanspy, keylogger or APT adversary
  where arguments or commands are sent in plain text to the remote C2 server using
  HTTP POST method as part of data exfiltration.
search: '`stream_http` http_method=POST form_data IN ("*wermgr.exe*","*svchost.exe*",
  "*name=\"proclist\"*","*ipconfig*", "*name=\"sysinfo\"*", "*net view*") |stats values(form_data)
  as http_request_body min(_time) as firstTime max(_time) as lastTime count by http_method
  http_user_agent uri_path url bytes_in bytes_out | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `plain_http_post_exfiltrated_data_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the stream HTTP logs or network logs that catch network traffic. Make
  sure that the http-request-body, payload, or request field is enabled.
known_false_positives: unknown
references:
- https://blog.talosintelligence.com/2020/03/trickbot-primer.html
tags:
  analytic_story:
  - Command and Control
  - Data Exfiltration
  automated_detection_testing: passed
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Exfiltration
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1048.003/plain_exfil_data/stream_http_events.log
  impact: 70
  kill_chain_phases:
  - Exfiltration
  message: A http post $http_method$ sending packet with plain text of information
    $form_data$ in uri path $uri_path$
  mitre_attack_id:
  - T1048.003
  observable:
  - name: uri_path
    type: UriPath
    role:
    - Attacker
  - name: form_data
    type: formdata
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - http_method
  - http_user_agent
  - uri_path
  - url
  - bytes_in
  - bytes_out
  risk_score: 63
  security_domain: network
