name: Prohibited Network Traffic Allowed
id: ce5a0962-849f-4720-a678-753fe6674479
version: 3
date: '2024-05-11'
author: Rico Valdez, Splunk
status: production
type: TTP
description: The following analytic detects instances where network traffic, identified
  by port and transport layer protocol as prohibited in the "lookup_interesting_ports"
  table, is allowed. It uses the Network_Traffic data model to cross-reference traffic
  data against predefined security policies. This activity is significant for a SOC
  as it highlights potential misconfigurations or policy violations that could lead
  to unauthorized access or data exfiltration. If confirmed malicious, this could
  allow attackers to bypass network defenses, leading to potential data breaches and
  compromising the organization's security posture.
data_source: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Network_Traffic where All_Traffic.action = allowed by
  All_Traffic.src_ip All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.action
  | lookup update=true interesting_ports_lookup dest_port as All_Traffic.dest_port
  OUTPUT app is_prohibited note transport | search is_prohibited=true | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `drop_dm_object_name("All_Traffic")` | `prohibited_network_traffic_allowed_filter`'
how_to_implement: In order to properly run this search, Splunk needs to ingest data
  from firewalls or other network control devices that mediate the traffic allowed
  into an environment. This is necessary so that the search can identify an 'action'
  taken on the traffic of interest. The search requires the Network_Traffic data model
  be populated.
known_false_positives: None identified
references: []
tags:
  analytic_story:
  - Prohibited Traffic Allowed or Protocol Mismatch
  - Ransomware
  - Command And Control
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1048
  observable:
  - name: src_ip
    type: IP Address
    role:
    - Victim
  - name: dest_ip
    type: IP Address
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Traffic.action
  - All_Traffic.src_ip
  - All_Traffic.dest_ip
  - All_Traffic.dest_port
  risk_score: 25
  security_domain: network
  manual_test: This detection uses builtin lookup from Enterprise Security.
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1048/ftp_connection/zeek_conn.log
    sourcetype: bro:conn:json
    source: conn.log
