author: Jose Hernandez, Splunk
date: '2020-07-21'
description: This search looks for RDP application network traffic and filters any
  source/destination pair generating more than twice the standard deviation of the
  average traffic.
how_to_implement: You must ensure that your network traffic data is populating the
  Network_Traffic data model.
id: a98727cc-286b-4ff2-b898-41df64695923
known_false_positives: RDP gateways may have unusually high amounts of traffic from
  all other hosts' RDP applications in the network.
name: Remote Desktop Network Bruteforce
references: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Network_Traffic where All_Traffic.app=rdp by All_Traffic.src
  All_Traffic.dest All_Traffic.dest_port | eventstats stdev(count) AS stdev avg(count)
  AS avg p50(count) AS p50 | where count>(avg + stdev*2) | rename All_Traffic.src
  AS src All_Traffic.dest AS dest | table firstTime lastTime src dest count avg p50
  stdev | `remote_desktop_network_bruteforce_filter`'
tags:
  analytics_story:
  - SamSam Ransomware
  - Ryuk Ransomware
  asset_type: Endpoint
  cis20:
  - CIS 12
  - CIS 9
  - CIS 16
  kill_chain_phases:
  - Reconnaissance
  - Delivery
  mitre_attack_id:
  - T1021.001
  nist:
  - DE.AE
  - PR.AC
  - PR.IP
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: network
type: batch
version: 2
