name: Remote Desktop Network Traffic
id: 272b8407-842d-4b3d-bead-a704584003d3
version: 4
date: '2024-02-27'
author: David Dorsey, Splunk
status: production
type: Anomaly
description: The following analytic detects unusual Remote Desktop Protocol (RDP) traffic on TCP/3389, the default RDP port. 
  It identifies this activity by filtering out traffic from known RDP sources and destinations, focusing on atypical RDP connections within the network. 
  This detection is crucial for a Security Operations Center (SOC) as unauthorized RDP access can indicate an attacker's attempt to gain control over 
  networked systems, potentially leading to data theft, ransomware deployment, or further network compromise. 
  The impact of such unauthorized access can be significant, ranging from data breaches to complete system and network control loss.
data_source: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Network_Traffic where All_Traffic.dest_port=3389 AND
  All_Traffic.dest_category!=common_rdp_destination AND All_Traffic.src_category!=common_rdp_source
  AND All_Traffic.action="allowed" by All_Traffic.src All_Traffic.dest All_Traffic.dest_port
  | `drop_dm_object_name("All_Traffic")` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `remote_desktop_network_traffic_filter` '
how_to_implement: To successfully implement this search you need to identify systems
  that commonly originate remote desktop traffic and that commonly receive remote
  desktop traffic. You can use the included support search "Identify Systems Creating
  Remote Desktop Traffic" to identify systems that originate the traffic and the search
  "Identify Systems Receiving Remote Desktop Traffic" to identify systems that receive
  a lot of remote desktop traffic. After identifying these systems, you will need
  to add the "common_rdp_source" or "common_rdp_destination" category to that system
  depending on the usage, using the Enterprise Security Assets and Identities framework.  This
  can be done by adding an entry in the assets.csv file located in SA-IdentityManagement/lookups.
known_false_positives: Remote Desktop may be used legitimately by users on the network.
references: []
tags:
  analytic_story:
  - SamSam Ransomware
  - Ryuk Ransomware
  - Hidden Cobra Malware
  - Active Directory Lateral Movement
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1021.001
  - T1021
  observable:
  - name: src
    type: IP Address
    role:
    - Victim
  - name: dest
    type: IP Address
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Traffic.dest_port
  - All_Traffic.dest_category
  - All_Traffic.src_category
  - All_Traffic.src
  - All_Traffic.dest
  - All_Traffic.dest_port
  risk_score: 25
  security_domain: network
  manual_test: This detection uses builtin lookup from Enterprise Security.
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1021.001/remote_desktop_connection/zeek_conn.log
    sourcetype: bro:conn:json
    source: conn.log