name: SMB Traffic Spike
id: 7f5fb3e1-4209-4914-90db-0ec21b936378
version: 3
date: '2020-07-22'
author: David Dorsey, Splunk
status: experimental
type: Anomaly
description: |-
  The following analytic detects spikes in the number of Server Message Block (SMB) traffic connections. SMB is a network protocol used for sharing files, printers, and other resources between computers. This detection is made by a Splunk query that looks for SMB traffic connections on ports 139 and 445, as well as connections using the SMB application. The query calculates the average and standard deviation of the number of SMB connections over the past 70 minutes, and identifies any sources that exceed two standard deviations from the average. This helps to filter out false positives caused by normal fluctuations in SMB traffic. This detection is important because it identifies potential SMB-based attacks, such as ransomware or data theft, which often involve a large number of SMB connections. This  suggests that an attacker is attempting to exfiltrate data or spread malware within the network. Next steps include investigating the source of the traffic and determining if it is malicious. This can involve reviewing network logs, capturing and analyzing any relevant network packets, and correlating with other security events to identify the attack source and mitigate the risk.
data_source: []
search: '| tstats `security_content_summariesonly` count from datamodel=Network_Traffic
  where All_Traffic.dest_port=139 OR All_Traffic.dest_port=445 OR All_Traffic.app=smb
  by _time span=1h, All_Traffic.src | `drop_dm_object_name("All_Traffic")` | eventstats
  max(_time) as maxtime | stats count as num_data_samples max(eval(if(_time >= relative_time(maxtime,
  "-70m@m"), count, null))) as count avg(eval(if(_time<relative_time(maxtime, "-70m@m"),
  count, null))) as avg stdev(eval(if(_time<relative_time(maxtime, "-70m@m"), count,
  null))) as stdev by src | eval upperBound=(avg+stdev*2), isOutlier=if(count > upperBound
  AND num_data_samples >=50, 1, 0) | where isOutlier=1 | table src count | `smb_traffic_spike_filter` '
how_to_implement: This search requires you to be ingesting your network traffic logs
  and populating the `Network_Traffic` data model.
known_false_positives: A file server may experience high-demand loads that could cause
  this analytic to trigger.
references: []
tags:
  analytic_story:
  - Emotet Malware DHS Report TA18-201A
  - Hidden Cobra Malware
  - Ransomware
  - DHS Report TA18-074A
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1021.002
  - T1021
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Traffic.dest_port
  - All_Traffic.app
  - All_Traffic.src
  risk_score: 25
  security_domain: network
