name: Access LSASS Memory for Dump Creation
id: fb4c31b0-13e8-4155-8aa5-24de4b8d6717
version: 2
data_metadata:
  data_eventtypes:
    - wineventlog_sysmon
  data_source:
    - Windows Event Logs
  providing_technologies:
    - Microsoft Windows
date: '2019-12-06'
description: dbgcore.dll is a specifc DLL for Windows core debugging. It is used to obtain a memory dump of a process.
  This search detects the usage of this DLL for creating a memory dump of LSASS process. Memory dumps of the LSASS process
  can be created with tools such as Windows Task Manager or procdump.
references:
  - https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
author: Patrick Bareiss, Splunk
search: '`sysmon` EventCode=10 TargetImage=*lsass.exe CallTrace=*dbgcore.dll*
  | stats count min(_time) as firstTime max(_time) as lastTime by Computer, TargetImage, TargetProcessId, SourceImage, SourceProcessId
  | rename Computer as dest
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `access_lsass_memory_for_dump_creation_filter` '
known_false_positives: Administrators can create memory dumps for debugging purposes, but memory dumps of the LSASS process would be unusual.
tags:
  - T1003
  - story_credential_dumping
  - apt1
  - mitre_top10
  - mimikatz
