name: Attempt To Set Default PowerShell Execution Policy To Unrestricted or Bypass
id: c2590137-0b08-4985-9ec5-6ae23d92f63d
version: 4
date: '2019-12-02'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Sysmon
description: This search looks for changes of the ExecutionPolicy in the registry. The ExecutionPolicy
  is a safety feature that controls the conditions under which PowerShell loads configuration
  files and runs scripts. Usually, the ExecutionPolicy is "Restricted" for Windows clients and
  "RemoteSigned" for Windows Servers, allowing only certain scripts to run. This search detects
  when an attacker sets the ExecutionPolicy to "Unrestricted" or "Bypass."
references: []
author: Rico Valdez
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Registry
  where Registry.registry_path=*Software\\Microsoft\\Powershell\\1\\ShellIds\\Microsoft.PowerShell*
  Registry.registry_key_name=ExecutionPolicy (Registry.registry_value_name=Unrestricted OR Registry.registry_value_name=Bypass)
  by Registry.registry_path Registry.registry_key_name Registry.registry_value_name Registry.dest
  | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `attempt_to_set_default_powershell_execution_policy_to_unrestricted_or_bypass_filter` '
known_false_positives: Administrators may attempt to change the default execution
  policy on a system for a variety of reasons. However, setting the policy to "unrestricted" or "bypass"
  as this search is designed to identify, would be unusual. Hits should be reviewed
  and investigated as appropriate.
tags:
  - T1003
  - story_credential_dumping
  - story_malicious_powershell
  - mitre_top10
