name: Attempted Credential Dump From Registry via Reg.exe
id: 14038953-e5f2-4daf-acff-5452062baf03
version: 4
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Sysmon
date: '2019-12-02'
description: This search looks for the process reg.exe with the "save" parameter, which specifies
  a binary export from the registry. In addition, it looks for the keys that contain
  the hashed credentials, which attackers may retrieve and use for brute-force attacks
  in order to harvest legitimate credentials.
references: []
author: Rico Valdez, Patrick Bareiss, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where (Processes.process_name=reg.exe OR Processes.process_name=cmd.exe) Processes.process=*save*
  (Processes.process=*HKEY_LOCAL_MACHINE\\Security* OR Processes.process=*HKEY_LOCAL_MACHINE\\SAM* OR
  Processes.process=*HKEY_LOCAL_MACHINE\\System* OR Processes.process=*HKLM\\Security* OR
  Processes.process=*HKLM\\System* OR Processes.process=*HKLM\\SAM*)
  by Processes.user Processes.process_name Processes.process Processes.dest
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `attempted_credential_dump_from_registry_via_reg_filter`'
known_false_positives: None identified.
tags:
  - T1003
  - story_credential_dumping
  - apt1
  - mitre_top10
