name: Creation of Shadow Copy
id: eb120f5f-b879-4a63-97c1-93352b5df844
version: 1
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Sysmon
date: '2019-12-10'
description: The ntds.dit file contains the Active Directory (AD) database. This file can't be copied directly.
  That's why attackers will first create a shadow copy before exfiltrating the file. This search detects the creation
  of a shadow copy using Ntdsutil, Vssadmin, or Wmic.
references:
  - https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
author: Patrick Bareiss, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where (Processes.process_name=ntdsutil.exe Processes.process=*ntds* Processes.process=*create*) OR (Processes.process_name=vssadmin.exe Processes.process=*create* Processes.process=*shadow*)
  OR (Processes.process_name=wmic.exe Processes.process=*shadowcopy* Processes.process=*create*)
  by Processes.dest Processes.user Processes.process_name Processes.process  Processes.parent_process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `creation_of_shadow_copy_filter`'
known_false_positives: Legtimate administrator usage of Ntdsutil, Vssadmin, or Wmic will create false positives.
tags:
  - T1003
  - story_credential_dumping
  - apt1
  - mitre_top10
