name: Detect Credential Dumping through LSASS access
id: 2c365e57-4414-4540-8dc0-73ab10729996
version: 3
data_metadata:
  data_eventtypes:
    - wineventlog_sysmon
  data_source:
    - Windows Event Logs
  providing_technologies:
    - Microsoft Windows
date: '2019-12-03'
description: This search looks for LSASS access using Credential Dumping tools by detecting Process access with
  Sysmon logs (EventCode 10), TargetImage lsass.exe and GrantedAccess 0x1410 or 0x1010.
  This will for example detect the use of sekurlsa::logonpasswords in Mimikatz.
references: []
author: Rico Valdez, Patrick Bareiss, Splunk
search: '`sysmon` EventCode=10 TargetImage=*lsass.exe (GrantedAccess=0x1010 OR GrantedAccess=0x1410)
  | stats count min(_time) as firstTime max(_time) as lastTime by Computer, SourceImage, SourceProcessId, TargetImage, TargetProcessId, EventCode, GrantedAccess
  | rename Computer as dest
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `detect_credential_dumping_through_LSASS_access_filter`'
known_false_positives: The activity may be legitimate. Other tools can access lsass
  for legitimate reasons, and it's possible this event could be generated
  in those cases. In these cases, false positives should be fairly obvious and you
  may need to tweak the search to eliminate noise.
tags:
  - T1003
  - story_credential_dumping
  - apt1
  - mitre_top10
  - mimikatz
