name: Unsigned Image Loaded by LSASS
id: 56ef054c-76ef-45f9-af4a-a634695dcd65
version: 1
data_metadata:
  data_eventtypes:
    - wineventlog_sysmon
  data_source:
    - Windows Event Logs
  providing_technologies:
    - Microsoft Windows
date: '2019-12-06'
description: This search detects unsigned images loaded by LSASS (Local Security Authrity Subsystem Service).
  Normally, LSASS only loads signed images. Therefore, it is a malicious indicator when unsigned images are loaded by LSASS.
  This can be an indicator for credential dumping using tools like Windows Credential Editor.
references:
  - https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
author: Patrick Bareiss, Splunk
search: '`sysmon` EventID=7 Image=*lsass.exe Signed=false
  | stats count min(_time) as firstTime max(_time) as lastTime by Computer, Image, ImageLoaded, Signed, SHA1
  | rename Computer as dest
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `unsigned_image_loaded_by_LSASS_filter`'
known_false_positives: Other tools could load images into LSASS for legitimate reason. But enterprise tools should always use signed DLLs.
tags:
  - T1003
  - story_credential_dumping
  - apt1
  - mitre_top10
  - mimikatz
