name: AWS IAM List Instance Profiles
id: d3d91870-77a1-11eb-8bac-acde48001122
version: 1
date: '2021-02-25'
author: Rod Soto
type: batch
datamodel:
- Endpoint
- Authentication
description: Statistics of List Instance Profiles command by account, IP address and region
search: '`cloudtrail` eventSource=iam.amazonaws.com eventName=ListInstanceProfiles | stats count min(_time) as firstTime max(_time) as lastTime by awsRegion eventName sourceIPAddress userAgent userIdentity.accessKeyId userName command | `aws_iam_list_instance_profiles_filter`'
how_to_implement: N/A
known_false_positives: This is an investigation search.
references:
tags:
  analytic_story:
  - N/A
  dataset:
  - N/A
  kill_chain_phases:
  - Lateral Movement
  mitre_attack_id:
  - T1526
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
