name: AWS IAM List Users
id: df11dda2-779d-11eb-8b13-acde48001122
version: 1
date: '2021-02-25'
author: Rod Soto
type: batch
datamodel:
- Authentication
description: Stats for AWS IAM List Users command
search: '`cloudtrail` eventSource=iam.amazonaws.com eventName=ListUsers | stats count min(_time) as firstTime max(_time) as lastTime by eventName eventType sourceIPAddress userAgent userIdentity.accessKeyId userIdentity.arn userIdentity.type userName | `aws_iam_list_users_filter`'
how_to_implement: N/A
known_false_positives: This is an investigation search
references:
tags:
  analytic_story:
  - N/A
  dataset:
  - N/A
  kill_chain_phases:
  - Reconnaissance
  mitre_attack_id:
  - T1087.004
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
