name: AWS IAM Describe Account
id: b4a8c950-77a6-11eb-9589-acde48001122
version: 1
date: '2021-02-25'
author: Rod Soto
type: batch
datamodel:
- Authentication
description: Describe account command search.
search: '`cloudtrail` eventSource=organizations.amazonaws.com eventName=DescribeAccount | stats count min(_time) as firstTime max(_time) as lastTime by awsRegion errorCode errorMessage eventName sourceIPAddress userAgent userIdentity.accessKeyId userIdentity.arn userName command | `aws_iam_describe_account_filter`'
how_to_implement: N/A
known_false_positives: This is an investigation search
references:
tags:
  analytic_story:
  - N/A
  dataset:
  - N/A
  kill_chain_phases:
  - Lateral Movement
  mitre_attack_id:
  - T1087.004
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
