name: AWS IAM List Roots
id: 7acd4d9c-77a5-11eb-8936-acde48001122
version: 1
date: '2021-02-25'
author: Rod Soto
type: batch
datamodel:
- Authentication
description: Statistics for List Roots command.
search: '`cloudtrail` eventSource=organizations.amazonaws.com eventName=ListRoots | stats count min(_time) as firstTime max(_time) as lastTime by awsRegion eventName errorCode errorMessage sourceIPAddress userAgent userIdentity.accessKeyId userIdentity.arn userName command | `aws_iam_list_roots_filter`'
how_to_implement: N/A
known_false_positives: This is an investigation search
references:
tags:
  analytic_story:
  - N/A
  dataset:
  - N/A
  kill_chain_phases:
  - Lateral Movement
  mitre_attack_id:
  - T1087.004
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
