name: AWS IAM Get Group Policy
id: b7e180d8-77a3-11eb-a837-acde48001122
version: 1
date: '2021-02-25'
author: Rod Soto
type: batch
datamodel:
- Authentication
description: Get Group Policy command statistics by user.
search: 'sourcetype=aws:cloudtrail eventSource=iam.amazonaws.com eventName=GetGroupPolicy | stats count min(_time) as firstTime max(_time) as lastTime by awsRegion eventName errorCode errorMessage requestParameters.groupName requestParameters.policyName sourceIPAddress userAgent userIdentity.accessKeyId userName command | `aws_iam_get_group_policy_filter`'
how_to_implement: N/A
known_false_positives: This is an investigation search.
references:
tags:
  analytic_story:
  - N/A
  dataset:
  - N/A
  kill_chain_phases:
  - Lateral Movement
  mitre_attack_id:
  - T1069
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
