name: AWS IAM List Groups
id: 62559684-77a0-11eb-86ce-acde48001122
version: 1
date: '2021-02-25'
author: Rod Soto
type: batch
datamodel:
- Authentication
description:
search: '`cloudtrail`  eventSource=iam.amazonaws.com eventName=ListGroups | stats count min(_time) as firstTime max(_time) as lastTime by eventName awsRegion eventType userAgent userIdentity.accessKeyId userIdentity.arn userIdentity.type userName command | `aws_iam_list_groups_filter`'
how_to_implement: N/A
known_false_positives: This is an investation search
references:
tags:
  analytic_story:
  - N/A
  dataset:
  - N/A
  kill_chain_phases:
  - Lateral Movement
  mitre_attack_id:
  - T1087.004
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
