name: Get Account Authorization Details
id: cdafcea0-77a4-11eb-9815-acde48001122
version: 1
date: '2021-02-25'
author: Rod Soto
type: batch
datamodel:
- Authentication
description: Stats for AWS IAM Get Account Authorization Details
search: '`cloudtrail` eventSource=iam.amazonaws.com eventName=GetAccountAuthorizationDetails userName!=AWSConfig-Describe | stats count min(_time) as firstTime max(_time) as lastTime by awsRegion eventName sourceIPAddress userAgent userIdentity.accessKeyId userName command | `get_account_authorization_details_filter`'
how_to_implement: N/A
known_false_positives: This is an investigation search
references:
tags:
  analytic_story:
  - N/A
  dataset:
  - N/A
  kill_chain_phases:
  - Lateral Movement
  mitre_attack_id:
  - T1069
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
