name: Get Parent Process Info
id: fecf2918-670d-4f1c-872b-3d7317a41bf9
version: 2
date: '2019-02-28'
description: This search queries the Endpoint data model to give you details about
  the parent process of a process running on a host which is under investigation.
  Enter the values of the process name in question and the dest
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
author: Bhavin Patel, Splunk
inputs:
- process_name
- dest
search: '| tstats `summariesonly` count values(Processes.process) as process min(_time)
  as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes where Processes.process_name
  = {process_name} Processes.dest = {dest} by Processes.user Processes.parent_process_name  Processes.process_name  |
  `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`'
