name: Investigate AWS activities via region name
id: bc91a8cd-35e7-4bb2-6140-e756cc46fd11
version: 1
date: '2018-02-09'
description: This search lists all the user activities logged by CloudTrail for a
  specific region in question and will create a table of the values of parameters
  requested, the type of the event and the response from the AWS API by each user
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs.
author: Bhavin Patel, Splunk
inputs:
- vendor_region
search: '| search sourcetype=aws:cloudtrail vendor_region=$vendor_region$| rename requestParameters.instancesSet.items{}.instanceId
  as instanceId | stats values(eventName) by user instanceId vendor_region'
tags:
  analytics_story:
  - AWS Cryptomining
  - Cloud Cryptomining
  - Suspicious AWS EC2 Activities
  - Suspicious AWS S3 Activities
