name: List Entities Policy
id: f2581ebc-77a2-11eb-a931-acde48001122
version: 1
date: '2021-02-25'
author: Rod Soto
type: batch
datamodel:
- Authentication
description: Statistics for AWS IAM List Entities Policy command.
search: 'sourcetype=aws:cloudtrail eventSource=iam.amazonaws.com eventName=ListEntitiesForPolicy | stats count min(_time) as firstTime max(_time) as lastTime by awsRegion eventName requestParameters.policyArn sourceIPAddress userAgent userIdentity.accessKeyId userName | `list_entities_policy_filter`'
how_to_implement: N/A
known_false_positives: This is an investigation search
references:
tags:
  analytic_story:
  - N/A
  dataset:
  - N/A
  kill_chain_phases:
  - Lateral Movement
  mitre_attack_id:
  - T1069
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
