name: Abnormally High Number Of Cloud Instances Launched
id: f2361e9f-3928-496c-a556-120cd4223a65
version: 2
date: '2020-08-21'
description: This search finds for the number successfully launched cloud instances for every hour
  of the week, then applies the probability densitiy function to that distrubtion, and stores that
  model.
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs. The threshold value should be tuned to your environment.
type: ESCU
references: []
author: Rico Valdez, Splunk

search: '| tstats count as instances_launched values(All_Changes.object_id) as object_id from datamodel=Change where
   (All_Changes.action=created OR All_Changes.action=started)
   AND All_Changes.status=success AND All_Changes.object_category=instance
   by All_Changes.user _time span=1h
   | `drop_dm_object_name("All_Changes")`
   | eval HourOfDay=strftime(_time, "%H") | eval DayOfWeek=strftime(_time, "%w")
   | lookup cloud_instances_enough_data filter as instances_launced output enough_data
   | apply cloud_excessive_instances_v1 | rename "IsOutlier(instances_launched)" as isOutlier
   | where isOutlier=1
   | eval expected_upper_threshold = mvindex(split(mvindex(BoundaryRanges, -1), ":"), 0)
   | eval distance_from_threshold = instances_launched - expected_upper_threshold
   | table _time, user, instances_launched, expected_upper_threshold, distance_from_threshold, object_id'
known_false_positives: Many service accounts configured within an AWS infrastructure
  are known to exhibit this behavior. Please adjust the threshold values and filter
  out service accounts from the output. Always verify if this search alerted on a
  human user.
tags:
  analytics_story:
  - Cloud Cryptomining
  - Suspicious AWS EC2 Activities
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1078.004
  cis20:
  - CIS 13
  nist:
  - DE.DP
  - DE.AE
  security_domain: Cloud
  asset_type: Cloud Instance
