name: Abnormally High Cloud Instances Terminated by User - Change
id: ada0f478-84a8-4641-s3f3-d82362dff555
version: 1
date: '2020-07-23'
description: This search looks for CloudTrail events where an abnormally high number
  of instances were successfully terminated by a user in a 10-minute window
how_to_implement: You must install the the latest AWS, GCP or Azure TA and ingest the logs into
  the Change Datamodel. The threshold value should be tuned to your environment.
type: ESCU
references: []
author: Bhavin Patel, Splunk
search: '| tstats `security_content_summariesonly` count as instances_terminated from datamodel=Change
    where All_Changes.action= terminate
    by _time span=10m, All_Changes.user 
| `drop_dm_object_name("All_Changes")` 
| eventstats avg(instances_terminated) as total_terminated_avg, stdev(instances_terminated) as total_terminated_stdev 
| eval threshold_value = 4 
| eval isOutlier=if(instances_terminated > total_terminated_avg+(total_terminated_stdev * threshold_value), 1, 0) 
| search isOutlier=1 
| table _time, user, instances_terminated |`abnormally_high_cloud_instances_terminated_by_user___change_filter`'
known_false_positives: Many service accounts configured with your Cloud infrastructure
  are known to exhibit this behavior. Please adjust the threshold values and filter
  out service accounts from the output. Always verify whether this search alerted
  on a human user.
tags:
  analytics_story:
  - AWS Cryptomining
  - Suspicious AWS EC2 Activities
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1078
  cis20:
  - CIS 13
  nist:
  - DE.DP
  - DE.AE
  security_domain: network
  asset_type: AWS Instance
