name: Abnormally High AWS Instances Terminated by User - MLTK
id: 1c02b86a-cd85-473e-a50b-014a9ac8fe3e
version: 1
date: '2019-11-14'
description: This search looks for CloudTrail events where a user successfully terminates
  an abnormally high number of instances.
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs. The threshold value should be tuned to your environment.
type: ESCU
references: []
author: Jason Brewer, Splunk
search: sourcetype=aws:cloudtrail eventName=TerminateInstances errorCode=success `ec2_excessive_terminateinstances_mltk_input_filter`
  | bucket span=10m _time  | stats count as instances_terminated by _time src_user  |
  apply ec2_excessive_terminateinstances_v1  | rename "IsOutlier(instances_terminated)"
  as isOutlier  | where isOutlier=1
known_false_positives: Many service accounts configured within an AWS infrastructure
  are known to exhibit this behavior. Please adjust the threshold values and filter
  out service accounts from the output. Always verify if this search alerted on a
  human user.
tags:
  analytics_story:
  - Suspicious AWS EC2 Activities
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 13
  nist:
  - DE.DP
  - DE.AE
