name: Abnormally High AWS Instances Launched by User - MLTK - DM
id: f2361e9f-3928-496c-a556-120cd4223a65
version: 2
date: '2020-08-21'
description: This search looks for CloudTrail events where a user successfully launches
  an abnormally high number of instances.
XXXhow_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs. The threshold value should be tuned to your environment.
type: ESCU
references: []
author: Rico Valdez, Splunk

search: '| tstats count as instances_launched from datamodel=Change where (All_Changes.action=created  OR All_Changes.action=started) 
  All_Changes.status=success All_Changes.object_category=instance by All_Changes.user _time span=10m
  | apply ec2_excessive_runinstances_v1 | rename "IsOutlier(instances_launched)" as isOutlier | where isOutlier=1  `abnormally_high_aws_instances_launched_by_user___mltk_filter`'

known_false_positives: Many service accounts configured within an AWS infrastructure
  are known to exhibit this behavior. Please adjust the threshold values and filter
  out service accounts from the output. Always verify if this search alerted on a
  human user.
tags:
  analytics_story:
  - Cloud Cryptomining
  - Suspicious AWS EC2 Activities
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1078.004
  cis20:
  - CIS 13
  nist:
  - DE.DP
  - DE.AE
  security_domain: network
  asset_type: AWS Instance
