asset_type: Endpoint
confidence: high
creation_date: '2016-09-13'
data_metadata:
  data_eventtypes:
    - wineventlog_security
  data_source:
    - Authentication
  providing_technologies:
    - Microsoft Windows
description: This search looks for specific authentication events from the Windows
  Security Event logs to detect potential attempts at using the Pass-the-Hash technique.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: src_ip, dest, user
        rule_description: This search looks for Authentication log events from the
          Windows Security Audit logs to detect potential attempts for Passing the
          Hash
        rule_title: Detect Activity Related to Pass the Hash
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 10
      macros:
        - wineventlog_security
        - detect_activity_related_to_pass_the_hash_attacks_filter
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '`wineventlog_security` EventCode=4624 (Logon_Type=3 LogonProcessName=NtLmSsp WorkstationName=WORKSTATION NOT AccountName="ANONYMOUS LOGON") OR
        (EventCode=4624 Logon_Type=9 LogonProcessName=seclogo)
        | stats count min(_time) as firstTime max(_time) as lastTime by EventCode, Logon_Type, WorkstationName, user, dest
        | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
        | `detect_activity_related_to_pass_the_hash_attacks_filter` '
      suppress:
        suppress_fields: dest
        suppress_period: 86400s
eli5: To detect pass the hash activity, we look at all events with event code 4624
  that specify a logon type 3 (network logons) for remote pass the hash attacks and
  logon type 9 for local pass the hash attacks. The search also filters out
  events with an account name of 'Anonymous' to help reduce false positives.
entities:
  - dest
how_to_implement: To successfully implement this search, you must ingest your Windows
  Security Event logs and leverage the latest TA for Windows.
id: f5939373-8054-40ad-8c64-cec478a22a4b
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: Legitimate logon activity by authorized NTLM systems may be
  detected by this search. Please investigate as appropriate.
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
  - company: Splunk
    email: pbareiss@splunk.com
    name: Patrick Bareiss
mappings:
  cis20:
    - CIS 3
    - CIS 5
    - CIS 16
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Lateral Movement
    - Pass the Hash
  mitre_technique_id:
    - T1075
  nist:
    - PR.PT
    - PR.AT
    - PR.AC
    - PR.IP
modification_date: '2020-01-09'
name: Detect Activity Related to Pass the Hash Attacks
original_authors:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
references: []
security_domain: access
spec_version: 2
type: splunk
version: '3.0'
