asset_type: Endpoint
confidence: high
creation_date: '2018-04-09'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: Attempt to add a certificate to the untrusted certificate store
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, user, process_name
        rule_description: Attempt to add a certificate to the untrusted certificate
          store
        rule_title: Attempt To Add Certificate to Untrusted Store
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 50
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count min(_time) values(Processes.process)
        as process max(_time) as lastTime from datamodel=Endpoint.Processes where
        Processes.process_name=certutil.exe (Processes.process=*-addstore* AND Processes.process=*disallowed*
        ) by Processes.parent_process Processes.process_name Processes.user | `drop_dm_object_name("Processes")`
        | `ctime(firstTime)`|`ctime(lastTime)`'
      suppress:
        suppress_fields: process, dest
        suppress_period: 86400s
eli5: Attackers will often attempt to disable security tools in order to evade detection.
  It is also possible for end users to attempt to disable anti-virus or other security
  tools to circumvent restrictions they encounter while trying to execute other programs.
  One way malware may accomplish this is by adding the legitimate certificate used
  to sign the security software to the untrusted certificate store. This will cause
  the system to no longer trust the software signed with this certificate and disallow
  it from executing. This search simply looks for the execution of **certutil.exe**
  with the parameters `-addcert` and `disallowed`, which add a certification to the
  "untrusted" certificate store.
entities:
  - dest
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
id: 6bc5243e-ef36-45dc-9b12-f4a6be131159
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: There may be legitimate reasons for administrators to add a
  certificate to the untrusted certificate store. In such cases, this will typically
  be done on a large number of systems.
maintainers:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
mappings:
  cis20:
    - CIS 3
    - CIS 5
    - CIS 8
  kill_chain_phases:
    - Installation
    - Actions on Objectives
  mitre_attack:
    - Defense Evasion
    - Disabling Security Tools
  nist:
    - PR.PT
    - DE.CM
    - PR.IP
modification_date: '2018-11-15'
name: Attempt To Add Certificate To Untrusted Store
original_authors:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '4.0'
