asset_type: Web Server
confidence: medium
creation_date: '2016-10-04'
data_metadata:
  data_models:
    - Web
  data_source:
    - Network Communications
    - Web Server
  providing_technologies:
    - Splunk Stream
    - Palo Alto Firewall
    - Apache
    - Bro
description: This search looks for specific GET or HEAD requests to web servers that
  are indicative of reconnaissance attempts to identify vulnerable JBoss servers.
  JexBoss is described as the exploit tool of choice for this malicious activity.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: ''
        rule_description: This search looks for specific GET/HEAD requests to web
          servers that are indicative of reconnaissance attempts to identify vulnerable
          JBoss servers.
        rule_title: Detect attackers scanning for vulnerable JBoss servers
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 20
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count min(_time) as firstTime max(_time) as
        lastTime from datamodel=Web where (Web.http_method="GET" OR Web.http_method="HEAD")
        AND (Web.url="*/web-console/ServerInfo.jsp*" OR Web.url="*web-console*" OR
        Web.url="*jmx-console*" OR Web.url = "*invoker*") by Web.http_method, Web.url,
        Web.src, Web.dest | `drop_dm_object_name("Web")` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
      suppress:
        suppress_fields: dest,url
        suppress_period: 86400s
eli5: This search returns the number of times a URL associated with this type of JexBoss
  probe is observed.
entities:
  - dest
how_to_implement: You must be ingesting data from the web server or network traffic
  that contains web specific information, and populating the Web data model.
id: 104658f4-afdc-499e-9719-17243f982681
investigations:
  - id: df7a7f50-30f2-4cde-8448-69d2d5f9b3c5
    name: Get Vulnerability Logs For Endpoint
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd22
    name: Investigate Web Activity From Host
    type: splunk
known_false_positives: It's possible for legitimate HTTP requests to be made to URLs
  containing the suspicious paths.
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
mappings:
  kill_chain_phases:
    - Reconnaissance
  mitre_attack:
    - Discovery
    - System Information Discovery
modification_date: '2017-09-23'
name: Detect attackers scanning for vulnerable JBoss servers
original_authors:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
references: []
security_domain: network
spec_version: 2
type: splunk
version: '1.0'
