name: Attempt To Add Certificate To Untrusted Store
id: 6bc5243e-ef36-45dc-9b12-f4a6be131159
version: '4.0'
date: '2018-11-15'
description: Attempt to add a certificate to the untrusted certificate store
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
type: ESCU
references: []
author: Rico Valdez, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime values(Processes.process)
  as process max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=certutil.exe
  (Processes.process=*-addstore* AND Processes.process=*disallowed* ) by Processes.parent_process
  Processes.process_name Processes.user | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`|`security_content_ctime(lastTime)`'
known_false_positives: There may be legitimate reasons for administrators to add a
  certificate to the untrusted certificate store. In such cases, this will typically
  be done on a large number of systems.
tags:
  analytics_story:
  - Disabling Security Tools
  mitre_attack_id:
  - T1089
  kill_chain_phases:
  - Installation
  - Actions on Objectives
  cis20:
  - CIS 3
  - CIS 5
  - CIS 8
  nist:
  - PR.PT
  - DE.CM
  - PR.IP
