asset_type: Endpoint
confidence: high
creation_date: '2018-08-28'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Sysmon
description: This search looks for execution of reg.exe with parameters specifying
  an export of keys that contain hashed credentials that attackers may try to crack
  offline.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: user, process_name, process
        rule_description: An attempt to save registry keys holding credentials was
          identified by $user$.
        rule_title: Attempted Credential Dump From Registry from $user$
      risk:
        risk_object: user
        risk_object_type:
          - user
        risk_score: 80
      macros:
        - attempted_credential_dump_from_registry_via_reg_filter
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime
        from datamodel=Endpoint.Processes where (Processes.process_name=reg.exe OR Processes.process_name=cmd.exe) Processes.process=*save*
        (Processes.process=*HKEY_LOCAL_MACHINE\\Security* OR Processes.process=*HKEY_LOCAL_MACHINE\\SAM* OR
        Processes.process=*HKEY_LOCAL_MACHINE\\System* OR Processes.process=*HKLM\\Security* OR
        Processes.process=*HKLM\\System* OR Processes.process=*HKLM\\SAM*)
        by Processes.user Processes.process_name Processes.process Processes.dest
        | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
        | `attempted_credential_dump_from_registry_via_reg_filter`'
      suppress:
        suppress_fields: process_name, dest
        suppress_period: 86400s
eli5: This search looks for the process reg.exe with the "save" parameter, which specifies
  a binary export from the registry. In addition, it looks for the keys that contain
  the hashed credentials, which attackers may retrieve and use for brute-force attacks
  in order to harvest legitimate credentials.
entities:
  - dest
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
id: 14038953-e5f2-4daf-acff-5452062baf03
investigations:
  - id: 5de385bf-4f1e-404e-9b67-92d162ff8938ad
    name: Investigate Previous Unseen User
    type: splunk
  - id: 097e8030-8662-4254-a735-bf0bdda696e3
    name: Investigate Failed Logins for Multiple Destinations
    type: splunk
  - id: ed3fff45-cba6-4990-983f-6fac72bee659
    name: Investigate Pass the Hash Attempts
    type: splunk
  - id: 990007ad-d798-4b29-ab2f-f0034144c937
    name: Investigate Pass the Ticket Attempts
    type: splunk
known_false_positives: None identified.
maintainers:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
  - company: Splunk
    email: pbareiss@splunk.com
    name: Patrick Bareiss
mappings:
  cis20:
    - CIS 3
    - CIS 5
    - CIS 16
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Credential Access
    - Credential Dumping
  nist:
    - DE.CM
modification_date: '2019-12-02'
name: Attempted Credential Dump From Registry via Reg.exe
original_authors:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
  - company: Splunk
    email: pbareiss@splunk.com
    name: Patrick Bareiss
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '4.0'
