name: AWS Cross Account Activity From Previously Unseen Account - DM
id: 21193641-cb96-4a2c-a707-d9b9a7f7792b
version: 1
date: '2020-05-28'
description: This search looks for AssumeRole events where an IAM role in a different
  account is requested for the first time.
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs. Run the `Previously Seen AWS Cross Account Activity` support search only
  once to create the baseline of previously seen cross account activity. Thanks to
  Pablo Vega at Recurly for suggesting improvements to the search.
type: ESCU
references: []
author: Rico Valdez, Splunk
search: | tstats earliest(_time) as firstTime latest(_time) as lastTime from datamodel=Authentication_test
  where Authentication.signature=AssumeRole  by Authentication.vendor_account Authentication.user Authentication.src
  Authentication.user_role | rex field=Authentication.user_role "arn:aws:sts:*:(?<dest_account>.*):"
  | where 'Authentication.vendor_account'!='dest_account' | rename Authentication.vendor_account as
  requestingAccountId dest_account as requestedAccountId | lookup previously_seen_aws_cross_account_activity
  requestingAccountId, requestedAccountId, OUTPUTNEW firstTime as earliest
  | eval firstTime=(if (firstTime>earliest, earliest,firstTime)) | multireport [| table requestingAccountId,
  requestedAccountId, firstTime, lastTime | outputlookup rvtest.csv | where fact=fiction][|
  where firstTime >= relative_time(now(), "-70m@m")] | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `aws_cross_account_activity_from_new_account_filter`
  | rename Authentication.user as src_user Authentication.src as src_ip | table requestingAccountId,
  requestedAccountId, src_user, src_ip, Authentication.user_role, firstTime, lastTime
known_false_positives: Using multiple AWS accounts and roles is perfectly valid behavior.
  It's suspicious when an account requests privileges of an account it hasn't before.
  You should validate with the account owner that this is a legitimate request.
tags:
  analytics_story:
  - Suspicious Cloud Authentication Activites 
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 16
  nist:
  - PR.AC
  - PR.DS
  - DE.AE
  security_domain: network
  asset_type: AWS Instance
