name: AWS Network Access Control List Deleted
id: ada0f478-84a8-4641-a3f1-d82362d6fd75
version: 1
date: '2017-01-10'
description: Enforcing network-access controls is one of the defensive mechanisms
  used by cloud administrators to restrict access to a cloud instance. After the attacker
  has gained control of the AWS console by compromising an admin account, they can
  delete a network ACL and gain access to the instance from anywhere. This search
  will query the CloudTrail logs to detect users deleting network ACLs.
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs.
type: ESCU
references: []
author: Bhavin Patel, Splunk; Peter Gael, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Change.All_Changes where All_Changes.object_category="firewall" AND All_Changes.action="deleted" by All_Changes.command All_Changes.status All_Changes.user All_Changes.user_agent All_Changes.user_type All_Changes.object_id All_Changes.vendor_account
  | `drop_dm_object_name("All_Changes")`
  | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` | `aws_network_access_control_list_deleted_filter`'
known_false_positives: It's possible that a user has legitimately deleted a network
  ACL.
tags:
  analytics_story:
  - AWS Network ACL Activity
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 11
  nist:
  - DE.DP
  - DE.AE
  security_domain: network
  asset_type: AWS Instance
