tag
asset_type: AWS Instance
baselines:
  - id: 0de7ce99-ab0a-41fe-9624-345df83f08cc
    name: Previously Seen AWS Cross Account Activity - DM
    type: splunk
confidence: medium
creation_date: '2020-05-04'
data_metadata:
  data_source:
    - AWS CloudTrail logs
  data_model
    - Authentication
  providing_technologies:
    - AWS
description: This search looks for AssumeRole events where an IAM role in a different
  account is requested for the first time.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: requestingAccountId, requestedAccountId, src_user
        rule_description: Access to $dest_user$ was requested for the first time by
          $src_user$
        rule_title: AWS Account $requestedAccountId$ access by $requestingAccountId$
      risk:
        risk_object: src_user
        risk_object_type:
          - user
        risk_score: 20
      schedule:
        cron_schedule: 5 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: | tstats earliest(_time) as firstTime latest(_time) as lastTime from datamodel=Authentication_test 
        where Authentication.signature=AssumeRole  by Authentication.vendor_account Authentication.user Authentication.src 
        Authentication.user_role | rex field=Authentication.user_role "arn:aws:sts:*:(?<dest_account>.*):" 
        | where 'Authentication.vendor_account'!='dest_account' | rename Authentication.vendor_account as 
        requestingAccountId dest_account as requestedAccountId | lookup previously_seen_aws_cross_account_activity 
        requestingAccountId, requestedAccountId, OUTPUTNEW firstTime as earliest 
        | eval firstTime=(if (firstTime>earliest, earliest,firstTime)) | multireport [| table requestingAccountId, 
        requestedAccountId, firstTime, lastTime | outputlookup rvtest.csv | where fact=fiction][| 
        where firstTime >= relative_time(now(), "-70m@m")] | `security_content_ctime(firstTime)` 
        | `security_content_ctime(lastTime)` | `aws_cross_account_activity_from_new_account_filter` 
        | rename Authentication.user as src_user Authentication.src as src_ip | table requestingAccountId, 
        requestedAccountId, src_user, src_ip, Authentication.user_role, firstTime, lastTime

      suppress:
        suppress_fields: requestingAccountId, requestedAccountId
        suppress_period: 14400s

eli5: 'This search\

  1. Retrieves the **AssumeRole** event\

  1. Verifies that the log entry contains a value for the account ID of the requesting
  account\

  1. Ensures that the requesting account ID does not match the account ID of the requested
  account\

  1. Pulls in the previously seen requesting and requested account IDs\
 
  1. Ensures that firstTime contains the earliest time the activity is seen.\

  1. Splits up and executes multiple search paths at the same.\

  1. The first path determines the **firstTime** and **lastTime** entries for the
  cache file\

  1. Outputs the data to the cache file.\

  1. Creates a conditional statement that is always false (both because we don''t
  want these values to exit the search pipeline and because we think we''re clever).The
  second pipeline adds the **firstTime** and **lastTime** entries to search results.
  Next, it filters out any account pairs that haven''t been seen for the first time
  within the last hour. The `isnotnull(_time)` will remove the entries from the cache
  file.\

  The search finishes by gathering the data that it will display to the user.'
entities:
  - src_user
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs. Run the `Previously Seen AWS Cross Account Activity` support search only
  once to create the baseline of previously seen cross account activity. Thanks to
  Pablo Vega at Recurly for suggesting improvements to the search.
id: 21193641-cb96-4a2c-a707-d9b9a7f7792b
investigations:
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: b0d2e6a8-75fa-4b1b-9486-3d32acadf891
    name: AWS Investigate User Activities By Source User
    type: splunk
known_false_positives: Using multiple AWS accounts and roles is perfectly valid behavior.
  It's suspicious when an account requests privileges of an account it hasn't before.
  You should validate with the account owner that this is a legitimate request.
maintainers:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
mappings:
  cis20:
    - CIS 16
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Credential Access
  nist:
    - PR.AC
    - PR.DS
    - DE.AE
modification_date: '2020-05-04'
name: AWS Cross Account Activity From Previously Unseen Account - DM
original_authors:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
references: []
security_domain: network
spec_version: 2
type: splunk
version: '1.0'
