name: Cloud Compute Instance Created With Previously Unseen Image
id: bc24922d-987c-4645-b288-f8c73ec194c4
version: 1
date: '2018-10-12'
description: This search looks for cloud compute instances being created with previously
  unseen image IDs.
how_to_implement: You must be ingesting the appropriate cloud-infrastructure logs
  and have the Security Research cloud data model (https://github.com/splunk/cloud-datamodel-security-research/)
  installed. Run the "Previously Seen Cloud Compute Images" support search to create
  a baseline of previously seen images.
type: ESCU
references: []
author: David Dorsey, Splunk
search: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime values(All_Changes.object_id)
  as dest from datamodel=Change where All_Changes.action=created `cloud_compute_instance_created_with_previously_unseen_image_filter`
  by All_Changes.Instance_Changes.image_id, All_Changes.user | `drop_dm_object_name("Change")` | inputlookup
  append=t previously_seen_cloud_compute_images | stats min(firstTime) as firstTime
  max(lastTime) as lastTime, values(dest) as dest by image_id, user'
known_false_positives: After a new image is created, the first systems created with
  that image will cause this alert to fire.  Verify that the image being used was
  created by a legitimate user.
tags:
  analytics_story:
  - Cloud Cryptomining
  cis20:
  - CIS 1
  nist:
  - ID.AM
  security_domain: endpoint
  asset_type: Cloud Compute Instance
  risk_score: 10
  risk_object_type: user
  risk_object: user
