name: Cloud Compute Instance Created With Previously Unseen Image
id: bc24922d-987c-4645-b288-f8c73ec194c4
version: 1
date: '2018-10-12'
description: This search looks for cloud compute instances being created with previously
  unseen image IDs.
how_to_implement: "You must be ingesting your cloud infrastructure logs from your
  cloud provider. You should run the baseline search `Previously Seen Cloud Compute Images - Initial`
  to build the initial table of images observed and times. You must also enable the second
  baseline search `Previously Seen Cloud Compute Images - Update` to keep this table up to date and
  to age out old data. You can also provide additional filtering for this search by
  customizing the `cloud_compute_instance_created_with_previously_unseen_image_filter` macro."
type: ESCU
references: []
author: David Dorsey, Splunk
search: '| tstats earliest(_time) as firstTimeSeen, latest(_time) as lastTimeSeen values(All_Changes.object_id) as dest, count
  from datamodel=Change where All_Changes.action=created `previously_seen_cloud_compute_instance_types_input_filter`
  by All_Changes.Instance_Changes.image_id, All_Changes.user
  | `drop_dm_object_name("All_Changes")` | `drop_dm_object_name("Instance_Changes")`
  | lookup previously_seen_cloud_compute_images image_id as image_id OUTPUT firstTime
  | where isnull(firstTime) OR firstTime > relative_time(now(), "-70m@m")
  | `security_content_ctime(firstTimeSeen)`
  | table firstTimeSeen, user, image_id, count, dest
  | `cloud_compute_instance_created_with_previously_unseen_image_filter`'
known_false_positives: After a new image is created, the first systems created with
  that image will cause this alert to fire.  Verify that the image being used was
  created by a legitimate user.
tags:
  analytics_story:
  - Cloud Cryptomining
  cis20:
  - CIS 1
  nist:
  - ID.AM
  security_domain: endpoint
  asset_type: Cloud Compute Instance
  risk_score: 10
  risk_object_type: user
  risk_object: user
