asset_type: Cloud Compute Instance
baselines:
  - id: 9fa1c205-4e08-4681-bb1b-d0943e734b85
    name: Previously Seen Cloud Compute Creations By User
    type: splunk
confidence: medium
creation_date: '2019-10-03'
data_metadata:
  data_models:
    - Cloud_Infrastructure
  data_source:
    - Cloud Infrastructure Logs
  providing_technologies:
    - AWS
    - Azure
    - GCP
description: This search looks for cloud compute instances created by users
  who have not created them before.
detect:
  splunk:
    correlation_rule:
      lookups:
        - previously_seen_cloud_compute_creations_by_user
      macros:
        - previously_seen_cloud_compute_creations_by_user_input_filter
        - previously_seen_cloud_compute_creations_by_user_search_window_begin_offset
      notable:
        drilldown_name: Show all instances created by $src_user$
        drilldown_search: '| from datamodel:Cloud_Infrastructure.Compute | action=run src_user=$src_user$'
        nes_fields: src_user, dest
        rule_description: The compute instance $dest$ was created by $src_user$. This
          is the first time $src_user$ has created a compute instance.
        rule_title: Cloud Compute Instance Created By Previously Unseen User $src_user$
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 30
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime values(Compute.dest)
        as dest from datamodel=Cloud_Infrastructure.Compute where Compute.action=run by
        Compute.src_user | `drop_dm_object_name("Compute")` | inputlookup append=t
        previously_seen_cloud_compute_creations_by_user  | stats min(firstTime) as
        firstTime max(lastTime) as lastTime, values(dest) as dest by src_user | multireport
        [| table src_user, firstTime, lastTime | outputlookup previously_seen_cloud_compute_creations_by_user
        | where fact=fiction][| eval new_user=if(firstTime >= relative_time(now(),
        `previously_seen_cloud_compute_creations_by_user_search_window_begin_offset`), 1, 0)
        | where new_user=1 | convert security_content_ctime(firstTime) security_content_ctime(lastTime)]
        | table src_user, dest, firstTime, lastTime'
      suppress:
        suppress_fields: src_user, dest
        suppress_period: 14400s
eli5: For each user, the search returns the first time seen, last time seen, and the systems. It then appends the historical data and merges it into the data. The
  search then splits and outputs the updated times for each user back to the lookup
  file and then clears out any output. The other part of the search limits the results
  to when the user was seen for the first time within the previous 70 minutes.
  It then displays the new user, the instances created by that user, and the associated times.
entities:
  - dest
  - src_user
how_to_implement: You must be ingesting the appropriate cloud-infrastructure logs
  and have the Security Research cloud data model (https://github.com/splunk/cloud-datamodel-security-research/)
  installed. Run the "Previously Seen Cloud Compute Creations By User" support search to create of
  baseline of previously seen users.
id: 76988f6a-3935-48f6-a9e5-6fca8b3ed843
investigations:
  - id: 2ef6310f-8e79-42af-b20b-b4eeaba9608a
    name: Investigate User Activities In All Cloud Regions
    type: splunk
  - id: 33a95cf2-900c-4636-8fca-5c5f71474720
    name: Investigate Cloud Compute Instance Activities
    type: splunk
known_false_positives: It's possible that a user will start to create compute instances
  for the first time, for any number of reasons. Verify with the user launching instances that this is the intended behavior.
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
mappings:
  cis20:
    - CIS 1
  nist:
    - ID.AM
modification_date: '2018-03-12'
name: Cloud Compute Instance Created By Previously Unseen User
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '1.0'
