asset_type: Cloud Compute Instance
baselines:
  - id: 0ef13d46-164e-4cf5-816e-b3c0df170d00
    name: Previously Seen Cloud Compute Instance Types
    type: splunk
confidence: medium
creation_date: '2019-10-03'
data_metadata:
  data_models:
    - Cloud_Infrastructure
  data_source:
    - Cloud Infrastructure Logs
  providing_technologies:
    - AWS
    - Azure
    - GCP
description: Find EC2 instances being created with previously unseen
  instance types.
detect:
  splunk:
    correlation_rule:
      lookups:
        - previously_seen_cloud_compute_instance_types
      macros:
        - previously_seen_cloud_compute_instance_types_input_filter
        - previously_seen_cloud_compute_instance_types_search_window_begin_offset
      notable:
        drilldown_name: Find all compute instances of type $instance_type$
        drilldown_search: '| from datamodel:Cloud_Infrastructure.Compute | instance_type=$instance_type$'
        nes_fields: instance_type
        rule_description: The instance type $instance_type$ was used for the first
          time to create $dest$.
        rule_title: New Cloud Compute Instance Type $instance_type$ detected
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 30
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime values(Compute.dest)
        as dest from datamodel=Cloud_Infrastructure.Compute where Compute.event_name=RunInstances
        `previously_seen_cloud_compute_instance_types_input_filter` by Compute.instance_type,
        Compute.src_user | `drop_dm_object_name("Compute")` | inputlookup append=t
        previously_seen_cloud_compute_instance_types | stats min(firstTime) as firstTime
        max(lastTime) as lastTime, values(dest) as dest by instance_type, src_user
        | multireport [| table instance_type, firstTime, lastTime | outputlookup previously_seen_cloud_compute_instance_types
        | where fact=fiction][| eval new_type=if(firstTime >= relative_time(now(),
        `previously_seen_cloud_compute_instance_types_search_window_begin_offset`), 1, 0)
        | where new_type=1 | convert ctime(firstTime) ctime(lastTime)]
        | table instance_type, dest, src_user, firstTime, lastTime'
      suppress:
        suppress_fields: dest
        suppress_period: 14400s
eli5: For each instance type and user, the search returns the first time seen, last time seen, and the system. It then appends the historical data and merges it into
  the data. The search then splits and outputs the updated times for each instance
  type back to the lookup file and clears out any output. The other part of the
  search limits the results to when the instance type was seen for the first time
  within the previous 70 minutes. It then displays the new instance type, the
  instances created using it, the user who created them, and the times associated.
entities:
  - dest
  - src_user
how_to_implement: You must be ingesting the appropriate cloud-infrastructure logs
  and have the Security Research cloud data model installed. Run the "Previously Seen
  Cloud Regions" support search to create a baseline of previously seen regions.
id: c6ddbf53-9715-49f3-bb4c-fb2e8a309cda
investigations:
  - id: 2ef6310f-8e79-42af-b20b-b4eeaba9608a
    name: Investigate User Activities In All Cloud Regions
    type: splunk
  - id: 33a95cf2-900c-4636-8fca-5c5f71474720
    name: Investigate Cloud Compute Instance Activities
    type: splunk
known_false_positives: It is possible that an admin will create a new system using
  a new instance type that has never been used before. Verify with the creator that they intended
  to create the system with the new instance type.
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
mappings:
  cis20:
    - CIS 1
  nist:
    - ID.AM
modification_date: '2018-03-12'
name: Cloud Compute Instance Created With Previously Unseen Instance Type
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '1.0'
