name: Cloud Compute Instance Created With Previously Unseen Instance Type
id: c6ddbf53-9715-49f3-bb4c-fb2e8a309cda
version: 1
date: '2020-09-12'
description: Find EC2 instances being created with previously unseen instance types.
how_to_implement: You must be ingesting the appropriate cloud-infrastructure logs
  and have the Security Research cloud data model (https://github.com/splunk/cloud-datamodel-security-research/)
  installed. Run the "Previously Seen Cloud Compute Instance Types" support search
  to create a baseline of previously seen regions.
type: ESCU
references: []
author: David Dorsey, Splunk
search: '| tstats earliest(_time) as firstTimeSeen, latest(_time) as lastTimeSeen values(All_Changes.object_id) as dest, count from datamodel=Change where All_Changes.action=created by All_Changes.Instance_Changes.instance_type, All_Changes.user | `drop_dm_object_name("All_Changes")` | `drop_dm_object_name("Instance_Changes")` | lookup previously_seen_cloud_compute_instance_types instance_type as instance_type OUTPUT firstTime | where isnull(firstTime) OR firstTime > relative_time(now(), "-70m@m") | `security_content_ctime(firstTimeSeen)` | table firstTimeSeen, user, instance_type, count, dest'
known_false_positives: It is possible that an admin will create a new system using
  a new instance type that has never been used before. Verify with the creator that
  they intended to create the system with the new instance type.
tags:
  analytics_story:
  - Cloud Cryptomining
  cis20:
  - CIS 1
  nist:
  - ID.AM
  security_domain: endpoint
  asset_type: Cloud Compute Instance
  risk_score: 10
  risk_object_type: user
  risk_object: user
