name: Cloud Provisioning Activity From Previously Unseen IP Address
id: e7ecc5e0-88df-48b9-91af-51104c68f02f
version: 1
date: '2020-08-16'
description: 'This search looks for cloud provisioning activities from previously unseen
  IP addresses. Provisioning activities are defined broadly as any event that runs or
  creates something.'
XXXhow_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs. This search works best when you run the "Previously Seen AWS Provisioning
  Activity Sources" support search once to create a history of previously seen locations
  that have provisioned AWS resources.
type: ESCU
references: []
author: Rico Valdez, Splunk
search: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime from datamodel=Change 
  where (All_Changes.action=started OR All_Changes.action=created) All_Changes.status=success 
  by All_Changes.src, All_Changes.user, All_Changes.object, All_Changes.command | `drop_dm_object_name("All_Changes")`
  | iplocation src | where isnotnull(Country)
  | lookup stuff.csv src as src OUTPUT firstTimeSeen, enough_data
  | where enough_data=1
  | eval firstTimeSeenSrc=min(firstTimeSeen)
  | where isnull(firstTimeSeenSrc) OR firstTime > relative_time(now(), "-70m@m")
  | table firstTime, src, user, object, command
  | `cloud_provisioning_from_previously_unseen_ip_address_filter`'

known_false_positives: "This is a strictly behavioral search, so we define \"false\
  \ positive\" slightly differently. Every time this fires, it will accurately reflect\
  \ the first occurrence in the time period you're searching within, plus what is\
  \ stored in the cache feature. But while there are really no \"false positives\"\
  \ in a traditional sense, there is definitely lots of noise.\\\n This search will\
  \ fire any time a new IP address is seen in the **GeoIP** database for any kind\
  \ of provisioning activity. If you typically do all provisioning from tools inside\
  \ of your country, there should be few false positives. If you are located in countries\
  \ where the free version of **MaxMind GeoIP** that ships by default with Splunk\
  \ has weak resolution (particularly small countries in less economically powerful\
  \ regions), this may be much less valuable to you."
tags:
  analytics_story:
  - AWS Suspicious Provisioning Activities
  cis20:
  - CIS 1
  nist:
  - ID.AM
  security_domain: endpoint
  asset_type: AWS Instance
