name: Cloud Instance Modified By Previously Unseen User
id: 7fb15084-b14e-405a-bd61-a6de15a40722
version: 1
date: '2020-07-29'
description: This search looks for EC2 instances being modified by users who have
  not previously modified them.
###how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs. This search works best when you run the "Previously Seen EC2 Launches By
  User" support search once to create a history of previously seen ARNs. To add or
  remove APIs that modify an EC2 instance, edit the macro `ec2_modification_api_calls`.
type: ESCU
references: []
author: Rico Valdez, Splunk

search: '| tstats `security_content_summariesonly` earliest(_time) as firstTime, latest(_time)
  as lastTime values(All_Changes.object) as Objects from datamodel=Change.All_Changes
  where All_Changes.action=modified by All_Changes.user | `drop_dm_object_name("All_Changes")`
  | inputlookup append=t previously_seen_cloud_instance_modifications_by_user  | stats
  min(firstTime) as firstTime max(lastTime) as lastTime, values(Objects) as Objects by user
  | eval new_user=if(firstTime >= relative_time(now(), `previously_seen_cloud_compute_creations_by_user_search_window_begin_offset`),
  1, 0) | where new_user=1 | `security_content_ctime(firstTime)`|`security_content_ctime(lastTime)`]
  | table src_user, dest, firstTime, lastTime | `cloud_instance_modified_by_previously_unseen_user_filter`'


known_false_positives: It's possible that a new user will start to modify EC2 instances
  when they haven't before for any number of reasons. Verify with the user that is
  modifying instances that this is the intended behavior.
tags:
  analytics_story:
  - Suspicious Cloud Change Activity 
  mitre_attack_id:
  - T1078.004
  cis20:
  - CIS 1
  nist:
  - ID.AM
  security_domain: endpoint
  asset_type: AWS Instance
