asset_type: GCP GCR Container
confidence: medium
creation_date: '2020-02-20'
data_metadata:
  data_models:
    - Vulnerabilities
  data_source:
    - google:gcp:pubsub:messages
  providing_technologies:
    - GCP
description: This search show information on uploaded containers including source user, account, action, bucket name event name, http user agent, message and destination path.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: awsRegion
        rule_description: An AWS instance is started in a new, previously unseen,
          region
        rule_title: AWS instance is started in a new region
      risk:
        risk_object: awsRegion
        risk_object_type:
          - other
        risk_score: 30
      macros:
        - container_implant_gcp_detection_filter  
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '|tstats count min(_time) as firstTime max(_time) as lastTime  FROM datamodel=Cloud_Infrastructure.Storage where Storage.event_name=storage.objects.create by Storage.src_user Storage.account Storage.action Storage.bucket_name Storage.event_name Storage.http_user_agent Storage.msg Storage.object_path | `drop_dm_object_name("Storage")`  | `container_implant_gcp_detection_filter`' 
eli5: In this search we can detect if a new container has been uploaded to Google Container Registry,
   operator can monitor users uploading containers, object paths of new uploaded containers.
entities:
  - src_user
how_to_implement: You must install the GCP App for Splunk (version 2.0.0 or later), then configure stackdriver and set a subpub subscription to be imported to Splunk. You must also install Cloud Infrastructure data model.
id: 4f00ca88-e766-4605-ac65-ae51c9fd185b
known_false_positives: Uploading container is a normal behavior from developers or users with access to container registry. GCP GCR registers container upload as a Storage event, this search must be considered under the context of CONTAINER upload creation which automatically generates a bucket entry for destination path.
maintainers:
  - company: Splunk
    email: rsoto@splunk.com, rvaldez@splunk.com
    name: Rod Soto, Rico Valdez
mappings:
  mitre_attack:
    - Persistence
  kill_chain_phases:
    - Weaponization
  mitre_technique_id:
    - T1525
modification_date: '2020-02-20'
name: Container uploaded to GCP GCR
original_authors:
  - company: Splunk
    email: rsoto@splunk.com, rvaldez@splunk.com
    name: Rod Soto, Rico Valdez
references:
  - https://github.com/splunk/cloud-datamodel-security-research
security_domain: threat
spec_version: 2
type: splunk
version: '1.0'
