asset_type: AWS ECR container
confidence: medium
creation_date: '2020-02-20'
data_metadata:
  data_models:
    - Cloud_Infrastructure
  data_source:
    - AWS Cloud Trail logs
  data_sourcetypes:
    - aws:cloudtrail
  providing_technologies:
    - AWS
description: This searches show information on uploaded containers including source user, image id, source IP
  user type, http user agent, region, first time, last time of operation (PutImage). These searches
  are based on Cloud Infrastructure Data Model.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: image_id, src_user, region, user_type
        rule_description: A new container with image id $image_id$ uploaded to AWS ECR by user $src_user$
        rule_title: New container uploaded to AWS ECR
      risk:
        risk_object: src_user
        risk_object_type:
          - user
        risk_score: 30
      macros:
        - container_implant_aws_detection_filter
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Cloud_Infrastructure.Compute where Compute.user_type!="AssumeRole" AND Compute.http_user_agent="AWS Internal" AND Compute.event_name="PutImage" by Compute.image_id Compute.src_user Compute.src Compute.region Compute.msg Compute.user_type | `drop_dm_object_name("Compute")` | `container_implant_aws_detection_filter`'
eli5: In this search we can detect if a new container has been uploaded to Amazon Elastic Container Registry, operator can monitor users uploading containers, image ids of new uploaded containers.
entities:
  - src_user
how_to_implement:  You must install the AWS App for Splunk (version 5.1.0 or later) and Splunk Add-on for
 AWS (version 4.4.0 or later), then configure your CloudTrail inputs. You must also install Cloud Infrastructure data model. Customize the macro container_implant_aws_filter to filter out FPs
id: f0f70b40-f7ad-489d-9905-23d149da8099
known_false_positives: Uploading container is a normal behavior from developers or users with access to container registry.
investigations:
  - id: 6027623f-7d10-4847-af3b-8d7e87970451
    name: Investigate AWS ECR container listing activity
    type: splunk
maintainers:
  - company: Splunk
    email: rsoto@splunk.com, rvaldez@splunk.com
    name: Rod Soto, Rico Valdez
mappings:
  mitre_attack:
    - Persistence
  kill_chain_phases:
    - N/A
  mitre_technique_id:
    - T1525
modification_date: '2020-02-20'
name: New container uploaded to AWS ECR
original_authors:
  - company: Splunk
    email: rsoto@splunk.com, rvaldez@splunk.com
    name: Rod Soto, Rico Valdez
references: []
security_domain: threat
spec_version: 2
type: splunk
version: '1.0'
