asset_type: Endpoint
confidence: high
creation_date: '2019-12-10'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Sysmon
description: This search detects the use of Ntdsutil, Vssadmin or Wmic to create a shadow copy.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: user, dest, process_name, process
        rule_description: An attempt to create a shadow copy with Ntdsutil, Vssadmin or Wmic was detected on $dest$.
        rule_title: Attempted Credential Dump of ntds.dit from $user$
      risk:
        risk_object: user
        risk_object_type:
          - user
        risk_score: 60
      macros:
        - creation_of_shadow_copy
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
        where (Processes.process_name=ntdsutil.exe Processes.process=*ntds* Processes.process=*create*) OR (Processes.process_name=vssadmin.exe Processes.process=*create* Processes.process=*shadow*)
        OR (Processes.process_name=wmic.exe Processes.process=*shadowcopy* Processes.process=*create*)
        by Processes.dest Processes.user Processes.process_name Processes.process  Processes.parent_process Processes.process_id Processes.parent_process_id
        | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
        | `creation_of_shadow_copy`'
      suppress:
        suppress_fields: process_name, dest
        suppress_period: 86400s
eli5: The ntds.dit file contains the Active Directory (AD) database. This file can't be copied directly.
  That's why attackers will first create a shadow copy and then exfiltrate the file. This search detects the creation
  of a shadow copy using Ntdsutil, Vssadmin or Wmic.
entities:
  - dest
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints, to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
id: eb120f5f-b879-4a63-97c1-93352b5df844
investigations:
  - id: 5de385bf-4f1e-404e-9b67-92d162ff8938ad
    name: Investigate Previous Unseen User
    type: splunk
  - id: 097e8030-8662-4254-a735-bf0bdda696e3
    name: Investigate Failed Logins for Multiple Destinations
    type: splunk
  - id: ed3fff45-cba6-4990-983f-6fac72bee659
    name: Investigate Pass the Hash Attempts
    type: splunk
  - id: 990007ad-d798-4b29-ab2f-f0034144c937
    name: Investigate Pass the Ticket Attempts
    type: splunk
known_false_positives: Legtimate administrator usage of Ntdsutil, Vssadmin or Wmic will create false positives.
maintainers:
  - company: Splunk
    email: pbareiss@splunk.com
    name: Patrick Bareiss
mappings:
  cis20:
    - CIS 8
    - CIS 16
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Credential Access
    - Credential Dumping
  nist:
    - DE.CM
modification_date: '2019-12-10'
name: Creation of Shadow Copy
original_authors:
  - company: Splunk
    email: pbareiss@splunk.com
    name: Patrick Bareiss
references:
  - https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
security_domain: endpoint
spec_version: 2
type: splunk
version: '1.0'
