asset_type: Endpoint
confidence: medium
creation_date: '2018-03-28'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search looks for the creation of local administrator accounts using
  net.exe.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest
        rule_description: Net.exe was used to create local administrator accounts
          on $dest$.
        rule_title: Local administrator account created on $dest$
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 50
      schedule:
        cron_schedule: 0 8 * * *
        earliest_time: -1440m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count values(Processes.user) as user values(Processes.parent_process)
        as parent_process min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
        where (Processs.process_name=net.exe OR Processes.process_name=net1.exe) by
        Processes.process Processes.process_name Processes.dest | `drop_dm_object_name(Processes)`
        | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`  | search (process=*localgroup* OR
        process=*/add* OR process=*user*)'
      suppress:
        suppress_fields: dest
        suppress_period: 86400s
eli5: Net.exe is a built-in Windows command-line tool that can be used to add, display,
  or modify user accounts. While Microsoft administrators use this tool to manage
  user groups, threat actors often leverage it to create local admin accounts to maintain
  persistence. In this search, we are looking for the execution of process net.exe
  with command-line parameters such as `localgroup`, `add`, or `user` that may correspond
  to the creation of local admin accounts or setting user/group properties.
entities:
  - dest
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
id: b89919ed-fe5f-492c-b139-151bb162040e
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: Administrators often leverage net.exe to create admin accounts.
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
mappings:
  cis20:
    - CIS 8
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Execution
    - Command-Line Interface
    - Persistence
  nist:
    - PR.PT
    - DE.CM
modification_date: '2018-11-15'
name: Create local admin accounts using net.exe
original_authors:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '2.0'
