name: Creation of Shadow Copy with wmic and powershell
id: 2ed8b538-d284-449a-be1d-82ad1dbd186b
version: 1
date: '2019-12-10'
description: This search detects the use of wmic and Powershell to create a shadow
  copy.
how_to_implement: You must enable Powershell scriptblock logging in order to detect
  this attack.This search uses an input macro named `sysmon`. We strongly recommend
  that you specify your environment-specific configurations (index, source, sourcetype,
  etc.) for Windows Sysmon logs. Replace the macro definition with configurations
  for your Splunk environment. The search also uses a post-filter macro designed to
  filter out known false positives.
type: ESCU
references:
- https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
author: Patrick Bareiss, Splunk
search: '`sysmon` Message=*win32_shadowcopy* Message=*Create* | stats count min(_time)
  as firstTime max(_time) as lastTime by dvc User EventCode Message | rename User
  as user, dvc as dest | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `creation_of_shadow_copy_with_wmic_and_powershell_filter` '
known_false_positives: Legtimate administrator usage of wmic to create a shadow copy.
tags:
  analytics_story:
  - Credential Dumping
  mitre_attack_id:
  - T1003
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 8
  - CIS 16
  nist:
  - DE.CM
  security_domain: endpoint
