asset_type: Endpoint
confidence: high
creation_date: '2019-12-10'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search detects the creation of a symlink to a shadow copy.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: user, dest, process_name, process
        rule_description: credential dumping using symlink on $dest$.
        rule_title: Attempted Credential Dump using symlink from $user$
      risk:
        risk_object: user
        risk_object_type:
          - system
        risk_score: 40
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats summariesonly=true count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
        where Processes.process_name=cmd.exe Processes.process=*mklink* Processes.process=*HarddiskVolumeShadowCopy*
        by Processes.dest Processes.user Processes.process_name Processes.process  Processes.parent_process Processes.process_id Processes.parent_process_id
        | `drop_dm_object_name(Processes)` | `ctime(firstTime)`| `ctime(lastTime)`'
      suppress:
        suppress_fields: user, dest, process
        suppress_period: 86400s
eli5: The files system, security, sam and ntds.dit containing sensitive credentials. Normally, the files can't be easily copied.
  But it is possible by creating first a shadowcopy and then create a symlink to the shadowcopy. This search will detect this attack of
  credential dumping.
entities:
  - dest
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
id: c5eac648-fae0-4263-91a6-773df1f4c903
known_false_positives: unknown
maintainers:
  - company: Splunk
    email: pbareiss@splunk.com
    name: Patrick Bareiss
mappings:
  cis20:
    - CIS 8
    - CIS 16
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Credential Access
    - Credential Dumping
  nist:
    - DE.CM
modification_date: '2019-12-10'
name: Credential Dumping via Symlink to Shadowcopy
original_authors:
  - company: Splunk
    email: pbareiss@splunk.com
    name: Patrick Bareiss
references:
  - https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
security_domain: endpoint
spec_version: 2
type: splunk
version: '1.0'
