asset_type: Endpoint
confidence: medium
creation_date: '2017-02-17'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: The vssadmin.exe utility is used to interact with the Volume Shadow Copy
  Service.  Wmic is an interface to the Windows Management Instrumentation.  This
  search looks for either of these tools being used to delete shadow copies.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, user, process_name
        rule_description: Using $process_name$ to delete shadow copies is common behavior
          by ransomware. This activity was observed on $dest$
        rule_title: Deleting Shadow Copies on $dest$ with $process_name$
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 75
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count values(Processes.process) as process
        values(Processes.parent_process) as parent_process min(_time) as firstTime
        max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name=vssadmin.exe
        OR Processes.process_name=wmic.exe)  by Processes.user Processes.process_name
        Processes.parent_process_name Processes.dest  | `drop_dm_object_name(Processes)`
        | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | search process=*delete* AND process=*shadow*'
      suppress:
        suppress_fields: dest, user
        suppress_period: 14400s
eli5: This search looks for execution of vssadmin or wmic with both the "delete" and
  "shadows" parameters passed on the command-line. The two arguments are searched
  for separately because we can't predict the number of spaces between the words on
  the command-line. The search will return the number of times this activity was observed,
  and the times of the first and last event.
entities:
  - dest
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
id: b89919ed-ee5f-492c-b139-95dbb162039e
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd22
    name: Investigate Web Activity From Host
    type: splunk
known_false_positives: vssadmin.exe and wmic.exe are standard applications shipped
  with modern versions of windows. They may be used by administrators to legitimately
  delete old backup copies, although this is typically rare.
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
mappings:
  cis20:
    - CIS 8
    - CIS 10
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Execution
  nist:
    - PR.PT
    - DE.CM
    - PR.IP
modification_date: '2018-12-03'
name: Deleting Shadow Copies
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '2.0'
