asset_type: AWS Instance
baselines:
  - id: 0a87ecf9-dc6a-43af-861a-205e75a09bf5
    name: Previously seen users in CloudTrail
    type: splunk
  - id: 66ff71c2-7e01-47dd-a041-906688c9d322
    name: Update previously seen users in CloudTrail
    type: splunk
confidence: medium
creation_date: '2020-04-28'
data_metadata:
  data_source:
    - AWS CloudTrail logs
  data_model:
    - Authentication
  providing_technologies:
    - AWS
description: This search looks for CloudTrail events wherein a console login event
  by a user was recorded within the last hour, then compares the event to a lookup
  file of previously seen users (by ARN values) who have logged into the console.
  The alert is fired if the user has logged into the console for the first time within
  the last hour
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: user
        rule_description: A new user has logged into the AWS console
        rule_title: AWS Console Login by New User
      risk:
        risk_object: user
        risk_object_type:
          - user
        risk_score: 30
      schedule:
        cron_schedule: 5 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: | tstats earliest(_time) as firstTime latest(_time) as lastTime from
        datamodel=Authentication where Authentication.signature=ConsoleLogin by
        Authentication.user | rename Authentication.user as user | inputlookup append=t
        previously_seen_users_console_logins.csv | stats min(firstTime) as firstTime
        max(lastTime) as lastTime by user | eval userStatus=if(firstTime >= 
        relative_time(now(), "-70m@m"), "First Time Logging into AWS Console","Previously Seen User")
        | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
        | `detect_new_user_aws_console_login_filter`
      suppress:
        suppress_fields: user
        suppress_period: 86400s
eli5: In this search, we query CloudTrail logs to look for events that indicate that
  a user has attempted to log in to the AWS console and group the events using ARN
  value. Using the `previously_seen_users_console_logins.csv` lookup file created
  using the support search, we compare the ARN to all the previously seen users logging
  into the AWS console. The `eval` and `if` functions determine whether the earliest
  time we see this user ARN was seen within the last hour. The alert will be fired
  only when a user is seen for first time in the last hour.
entities:
  - user
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs. Run the "Previously seen users in CloudTrail" support search only once to
  create a baseline of previously seen IAM users within the last 30 days. Run "Update
  previously seen users in CloudTrail" hourly (or more frequently depending on how
  often you run the detection searches) to refresh the baselines.
id: 1212b18e-583e-4fe8-87c6-e27b3171f99f
investigations:
  - id: bc91a8cd-35e7-4bb2-6140-e756cc46fd71
    name: AWS Investigate User Activities By ARN
    type: splunk
known_false_positives: When a legitimate new user logins for the first time, this
  activity will be detected. Check how old the account is and verify that the user
  activity is legitimate.
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
mappings:
  cis20:
    - CIS 16
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Credential Access
  nist:
    - DE.DP
    - DE.AE
modification_date: '2018-04-30'
name: Detect New User AWS Console Login
original_authors:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
security_domain: network
spec_version: 2
type: splunk
version: '1.0'
