name: Detect Activity Related to Pass the Hash Attacks
id: f5939373-8054-40ad-8c64-cec478a22a4b
version: 3
date: '2020-01-09'
description: This search looks for specific authentication events from the Windows
  Security Event logs to detect potential attempts at using the Pass-the-Hash technique.
how_to_implement: To successfully implement this search, you must ingest your Windows
  Security Event logs and leverage the latest TA for Windows.
type: ESCU
references: []
author: Bhavin Patel, Splunk
search: '`wineventlog_security` EventCode=4624 (Logon_Type=3 LogonProcessName=NtLmSsp
  WorkstationName=WORKSTATION NOT AccountName="ANONYMOUS LOGON") OR (EventCode=4624
  Logon_Type=9 LogonProcessName=seclogo) | stats count min(_time) as firstTime max(_time)
  as lastTime by EventCode, Logon_Type, WorkstationName, user, dest | `security_content_ctime(firstTime)`|
  `security_content_ctime(lastTime)` | `detect_activity_related_to_pass_the_hash_attacks_filter` '
known_false_positives: Legitimate logon activity by authorized NTLM systems may be
  detected by this search. Please investigate as appropriate.
tags:
  analytics_story:
  - Lateral Movement
  mitre_attack_id:
  - T1075
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  nist:
  - PR.PT
  - PR.AT
  - PR.AC
  - PR.IP
  security_domain: access
  asset_type: Endpoint
