name: Detect Path Interception By Creation Of program.exe
id: c77162d3-f93c-45cc-80c8-22f6v5264g9f
version: '2.0'
date: '2018-11-15'
description: 'The search is looking for the creation of program.exe in the C: drive.  The
  creation of this file in that location may be driven by a motive to perform path
  interception.'
how_to_implement: You must be ingesting data that records the file-system activity
  from your hosts to populate the Endpoint file-system data model node. This is typically
  populated via endpoint detection-and-response products, such as Carbon Black, or
  other endpoint data sources, such as Sysmon. The data used for this search is typically
  generated via logs that report file system reads and writes.
type: ESCU
references: []
author: Bhavin Patel, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime values(Filesystem.user) as user values(Filesystem.dest) as dest values(Filesystem.file_hash)
  as file_hash values(Filesystem.file_path) as file_path from datamodel=Endpoint.Filesystem
  where Filesystem.file_path="C:\\program.exe" by Filesystem.file_name | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)`'
known_false_positives: 'It is unlikely that a normal user may create and place this
  file in the C: drive.  Confirm with the user.'
tags:
  analytics_story:
  - Windows Persistence Techniques
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 8
  nist:
  - PR.PT
  - DE.CM
