asset_type: Windows
confidence: high
creation_date: '2019-12-03'
data_metadata:
  data_eventtypes:
    - wineventlog_sysmon
  data_source:
    - Windows Event Logs
  providing_technologies:
    - Microsoft Windows
description: This search looks for reading loaded Images unique to credential dumping with Mimikatz.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest
        rule_description: Possible attempt at credential dumping was detected on $dest$.
        rule_title: Detect Mimikatz using loaded images on $dest$.
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 40
      macros:
        - detect_mimikatz_using_loaded_images_input_filter
        - detect_mimikatz_using_loaded_images_output_filter
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '`detect_mimikatz_using_loaded_images_input_filter` source="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=7 | stats values(ImageLoaded) as ImageLoaded values(ProcessId) as ProcessId by Computer, Image
        | search ImageLoaded=*WinSCard.dll ImageLoaded=*cryptdll.dll ImageLoaded=*hid.dll ImageLoaded=*samlib.dll ImageLoaded=*vaultcli.dll
        | rename Computer as dest
        | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
        | `detect_mimikatz_using_loaded_images_output_filter`'
      suppress:
        suppress_fields: dest, Image
        suppress_period: 86400s
eli5: This search looks for loaded images (dll) unique for Mimikatz using Sysmon EventCode 7 logs.
entities:
  - dest
how_to_implement: 'This search needs Sysmon Logs and a sysmon configuration, which includes EventCode 7 with powershell.exe'
id: 29e307ba-40af-4ab2-91b2-3c6b392bbba0
investigations:
  - id: 5de385bf-4f1e-404e-9b67-92d162ff8938ad
    name: Investigate Previous Unseen User
    type: splunk
  - id: 097e8030-8662-4254-a735-bf0bdda696e3
    name: Investigate Failed Logins for Multiple Destinations
    type: splunk
  - id: ed3fff45-cba6-4990-983f-6fac72bee659
    name: Investigate Pass the Hash Attempts
    type: splunk
  - id: 990007ad-d798-4b29-ab2f-f0034144c937
    name: Investigate Pass the Ticket Attempts
    type: splunk
known_false_positives: Other tools can import the same DLLs. These tools should be
    part of a whtelist.
maintainers:
  - company: Splunk
    email: pbareiss@splunk.com
    name: Patrick Bareiss
mappings:
  cis20:
    - CIS 6
    - CIS 8
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Credential Access
    - Credential Dumping
  nist:
    - DE.AE
    - DE.CM
modification_date: '2019-12-03'
name: Detect Mimikatz Using Loaded Images
original_authors:
  - company: Splunk
    email: pbareiss@splunk.com
    name: Patrick Bareiss
references:
  - https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for.html
security_domain: endpoint
spec_version: 2
type: splunk
version: "1"
