name: Detect new user AWS Console Login - DM
id: bc91a8cd-35e7-4bb2-6140-e756cc46fd71
version: 1
date: '2020-05-28'
description: This search looks for CloudTrail events wherein a console login event
  by a user was recorded within the last hour, then compares the event to a lookup
  file of previously seen users (by ARN values) who have logged into the console.
  The alert is fired if the user has logged into the console for the first time within
  the last hour
how_to_implement: You must install and configure the Splunk Add-on for AWS (version 5.1.0 or later)
  and Enterprise Security 6.2, which contains the required updates to the Authentication data model
  for cloud use cases. Run the "Previously seen users in CloudTrail" support search only once to
  create a baseline of previously seen IAM users within the last 30 days. Run "Update
  previously seen users in CloudTrail" hourly (or more frequently depending on how
  often you run the detection searches) to refresh the baselines.
type: ESCU
author: Rico Valdez, Splunk
search: "| tstats earliest(_time) as firstTime latest(_time) as lastTime from datamodel=Authentication where Authentication.signature=ConsoleLogin by Authentication.user | `drop_dm_object_name(Authentication)` | inputlookup append=t previously_seen_users_console_logins.csv | stats min(firstTime) as firstTime max(lastTime) as lastTime by user | eval userStatus=if(firstTime >=relative_time(now(), '-70m@m'), 'First Time Logging into AWS Console','Previously Seen User')| `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| `detect_new_user_aws_console_login___dm_filter`"
known_false_positives: When a legitimate new user logins for the first time, this
  activity will be detected. Check how old the account is and verify that the user
  activity is legitimate.
tags:
  analytics_story:
  - Suspicious Cloud Authentication Activities
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 16
  nist:
  - DE.DP
  - DE.AE
  security_domain: network
  asset_type: AWS Instance
