asset_type: Endpoint
baselines:
  - id: c914844c-0ff5-4efc-8d44-c063443129ba
    name: Baseline of DNS Query Length - MLTK
    type: splunk
confidence: medium
creation_date: '2019-05-08'
data_metadata:
  data_models:
    - Network_Resolution
  data_source:
    - DNS
  providing_technologies:
    - Splunk Stream
    - Bro
description: This search allows you to identify DNS requests that are unusually large
  for the record type being requested in your environment.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: src
        rule_description: Identify DNS traffic with unusual query lengths by record
          type
        rule_title: DNS query length outliers
      risk:
        risk_object: src
        risk_object_type:
          - system
        risk_score: 40
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count min(_time) as start_time max(_time)
        as end_time values(DNS.src) as src values(DNS.dest) as dest from datamodel=Network_Resolution
        by DNS.query DNS.record_type | search DNS.record_type=* |  `drop_dm_object_name(DNS)`
        | `ctime(firstTime)` | `ctime(lastTime)` | eval query_length = len(query)
        | apply dns_query_pdfmodel threshold=0.01 | rename "IsOutlier(query_length)"
        as isOutlier | search isOutlier > 0 | sort -query_length | table start_time
        end_time query record_type count src dest query_length'
      suppress:
        suppress_fields: query
        suppress_period: 43200s
eli5: Attackers often use random, long domain names for components of their attack
  infrastructure. This search leverages the probability distribution function algorithm
  provided by the Machine Learning Toolkit (MLTK) to identify outliers in the length
  of the DNS query for each record type observed. The companion search "Baseline of
  DNS Query Length - MLTK" creates a machine-learning (ML) model built over the historical
  data used by this search. The determination of what is considered an outlier may
  be adjusted via the threshold parameter in the search. More information on the algorithm
  used can be found at `https://docs.splunk.com/Documentation/MLApp/4.2.0/User/Algorithms#DensityFunction`.
entities:
  - src
how_to_implement: 'To successfully implement this search, you will need to ensure
  that DNS data is populating the Network_Resolution data model. In addition, the
  Machine Learning Toolkit (MLTK) version 4.2 or greater must be installed on your
  search heads, along with any required dependencies. Finally, the support search
  "Baseline of DNS Query Length - MLTK" must be executed before this detection search,
  because it builds a machine-learning (ML) model over the historical data used by
  this search. It is important that this search is run in the same app context as
  the associated support search, so that the model created by the support search is
  available for use. You should periodically re-run the support search to rebuild
  the model with the latest data available in your environment.\

  This search produces fields (`query`,`query_length`,`count`) that are not yet supported
  by ES Incident Review and therefore cannot be viewed when a notable event is raised.
  These fields contribute additional context to the notable. To see the additional
  metadata, add the following fields, if not already present, to Incident Review -
  Event Attributes (Configure > Incident Management > Incident Review Settings > Add
  New Entry):\\n1. **Label:** DNS Query, **Field:** query\

  1. \

  1. **Label:** DNS Query Length, **Field:** query_length\

  1. \

  1. **Label:** Number of events, **Field:** count\

  Detailed documentation on how to create a new field within Incident Review may be
  found here: `https://docs.splunk.com/Documentation/ES/5.3.0/Admin/Customizenotables#Add_a_field_to_the_notable_event_details`'
id: 85fbcfe8-9718-4911-adf6-7000d077a3a9
investigations:
  - id: 910e6512-edc9-4f93-ba24-5b786f47a672
    name: Get Process Responsible For The DNS Traffic
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd73
    name: Get DNS traffic ratio
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd72
    name: Get DNS Server History for a host
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: If you are seeing more results than desired, you may consider
  reducing the value for threshold in the search. You should also periodically re-run
  the support search to re-build the ML model on the latest data.
maintainers:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
mappings:
  cis20:
    - CIS 8
    - CIS 12
  kill_chain_phases:
    - Command and Control
  mitre_attack:
    - Command and Control
    - Exfiltration
    - Commonly Used Port
  nist:
    - PR.PT
    - DE.AE
    - DE.CM
modification_date: '2019-05-08'
name: DNS Query Length Outliers - MLTK
original_authors:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
references: []
security_domain: network
spec_version: 2
type: splunk
version: '1.0'
