asset_type: Endpoint
confidence: medium
creation_date: '2018-03-19'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search looks for flags passed to schtasks.exe on the command-line
  that indicate a task name associated with the Dragonfly threat actor was created
  or deleted.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, user, process_name
        rule_description: This search looks for flags passed to schtasks.exe on the
          command line that indicate that a task--whose name is associated with the
          Dragonfly threat actor--has been created or deleted
        rule_title: Scheduled task used by Dragonfly threat actor detected on $dest$
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 80
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count values(Processes.process) as process
        values(Processes.parent_process) as parent_process min(_time) as firstTime
        max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=schtasks.exe  by
        Processes.user Processes.process_name Processes.parent_process_name Processes.dest  |
        `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` |
        search (process=*delete* OR process=*create*) process=*reset*'
      suppress:
        suppress_fields: dest, process_name, process
        suppress_period: 28800s
eli5: The search looks for execution of schtasks.exe with parameters that indicate
  that a specific task "reset," whose name is associated with the Dragonfly threat
  actor--has been created or deleted. Schtasks.exe is a native Windows program that
  is used to schedule tasks on local or remote systems. Attackers often leverage this
  capability to schedule the execution of commands or establish persistence.
entities:
  - dest
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
id: d5af132c-7c17-439c-9d31-13d55340f36c
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: No known false positives
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
mappings:
  cis20:
    - CIS 3
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Execution
    - Scheduled Task
  nist:
    - PR.IP
modification_date: '2018-12-03'
name: Scheduled Task Name Used by Dragonfly Threat Actors
original_authors:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '2.0'
