asset_type: Endpoint
baselines:
  - id: fc0edc95-ff2b-48b0-9f6f-63da3789fd23
    name: Previously seen command line arguments
    type: splunk
confidence: medium
creation_date: '2018-04-09'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search looks for command-line arguments that use a `/c` parameter
  to execute a command that has not previously been seen.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, user, process
        rule_description: The system $dest$ executed a command-line argument, $process$,
          that has not previously been seen.
        rule_title: First-time seen command-line argument was detected on $dest$.
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 50
      macros:
        - first_time_seen_cmd_line_filter
      schedule:
        cron_schedule: 30 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `security_content_summariesonly` min(_time) as firstTime max(_time) as lastTime
        from datamodel=Endpoint.Processes where Processes.process_name = cmd.exe Processes.process
        = "* /c *" by Processes.process Processes.process_name Processes.parent_process_name
        Processes.dest| `drop_dm_object_name(Processes)`| `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
        | search [| tstats `security_content_summariesonly` earliest(_time) as firstTime latest(_time)
        as lastTime from datamodel=Endpoint.Processes where Processes.process_name
        = cmd.exe Processes.process = "* /c *" by Processes.process | `drop_dm_object_name(Processes)`
        | inputlookup append=t previously_seen_cmd_line_arguments | stats min(firstTime)
        as firstTime, max(lastTime) as lastTime by process | outputlookup previously_seen_cmd_line_arguments
        | eval newCmdLineArgument=if(firstTime >= relative_time(now(), "-70m@m"),
        1, 0) | where newCmdLineArgument=1 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
        | table process] | `first_time_seen_cmd_line_filter` '
      suppress:
        suppress_fields: dest, process
        suppress_period: 86400s
eli5: The subsearch returns all events where `cmd.exe` was used with a `/c` parameter
  in the command-line arguments to execute other commands/programs. It appends the
  historical data to those results in the lookup file. Next, it recalculates the `firstTime`
  and `lastTime` field for command-line execution and outputs this data to the lookup
  file to update the local cache. It returns only those events that have first been
  seen in the past one hour. This is combined with the main search to return the time,
  user, destination, process, parent process, and value of the command-line argument.
entities:
  - dest
  - process_name
  - user
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must be ingesting
  logs with both the process name and command line from your endpoints. The complete
  process name with command-line arguments are mapped to the "process" field in the
  Endpoint data model. Please make sure you run the support search "Previously seen
  command line arguments,"&#151;which creates a lookup file called `previously_seen_cmd_line_arguments.csv`&#151;a
  historical baseline of all command-line arguments. You must also validate this list.
  For the search to do accurate calculation, ensure the search scheduling is the same
  value as the `relative_time` evaluation function.
id: 9be56c82-b1cc-4318-87eb-q138afaaqa39
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd22
    name: Investigate Web Activity From Host
    type: splunk
known_false_positives: Legitimate programs can also use command-line arguments to
  execute. Please verify the command-line arguments to check what command/program
  is being executed.
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
mappings:
  cis20:
    - CIS 3
    - CIS 8
  kill_chain_phases:
    - Command and Control
    - Actions on Objectives
  mitre_attack:
    - Execution
    - Scripting
    - Persistence
    - Command-Line Interface
  mitre_technique_id:
    - T1059
    - T1117
    - T1202
  nist:
    - PR.PT
    - DE.CM
    - PR.IP
modification_date: '2020-01-22'
name: First time seen command line argument
original_authors:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '4.0'
