asset_type: Amazon EKS Kubernetes cluster
confidence: high
creation_date: '2020-03-24'
data_metadata:
  data_source:
    - AWS CloudWatch EKS Logs
  data_sourcetypes:
    - aws:cloudwatchlogs:eks
  providing_technologies:
    - AWS
description: This search provides information of unauthenticated requests via user agent, and authentication data against Kubernetes cluster in AWS
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: src_ip, cluster_name, http_user_agent
        rule_description: This search provides information of unauthenticated requests via user agent, and authentication data against Kubernetes cluster in AWS
        rule_title: Amazon EKS Kubernetes cluster scan detection
      risk:
        risk_object: cluster_name
        risk_object_type:
          - other
        risk_score: 70
      macros:
        - kubernetes_aws_scan_fingerprint_detection
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: 'sourcetype="aws:cloudwatchlogs:eks" "user.username"="system:anonymous" userAgent!="AWS Security Scanner" | rename sourceIPs{} as src_ip | stats count min(_time) as firstTime max(_time) as lastTime values(responseStatus.reason) values(source) as cluster_name values(responseStatus.code) values(userAgent) as http_user_agent values(verb) values(requestURI) by src_ip user.username user.groups{} | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` |`kubernetes_aws_scan_fingerprint_detection`'
eli5: In this search we can detect unauthenticated web requests against an EKS cluster, by looking at k8s authentication data, user agent and source IPs.
entities:
  - cluster_name
  - src_ip
how_to_implement:  You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudWatch EKS Logs
  inputs.
id: 294c4686-63dd-4fe6-93a2-ca807626704a
investigations:
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: a636cca4-7434-4a15-a278-c70734938e39
    name: Amazon EKS Kubernetes activity by src_ip
    type: splunk
known_false_positives: Not all unauthenticated requests are malicious, but frequency, UA and source IPs will provide context.
maintainers:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
mappings:
  mitre_attack:
    - Discovery
  kill_chain_phases:
    - Reconnaissance
  mitre_technique_id:
    - T1190
modification_date: '2020-04-15'
name: Amazon EKS Kubernetes cluster scan detection
original_authors:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
references: []
security_domain: threat
spec_version: 2
type: splunk
version: '1.0'
