asset_type: Amazon EKS Kubernetes cluster Pod
confidence: medium
creation_date: '2020-03-24'
data_metadata:
  data_models:
    - Cloud_Infrastructure
  data_source:
    - AWS Cloud Trail logs
  data_sourcetypes:
    - aws:cloudtrail
  providing_technologies:
    - AWS
description: This search provides detection information on unauthenticated requests against Kubernetes' Pods API
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: user.username, sourceIPs, verb, http_user_agent, group_name, requestURI
        rule_description: Detect EKS Pod fingerprint scan
        rule_title: Kubernetes Pod fingerprint detection scan
      risk:
        risk_object: user.username
        risk_object_type:
          - user.groups
        risk_score: 70
      macros:
        - kubernetes_pods_aws_scan_fingerprint_detection
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: index=aws_k8s "user.username"="system:anonymous" sourceIPs{}=* verb=list http_user_agent=* group_name=pods requestURI="/api/v1/pods" | table user.username sourceIPs{} verb http_user_agent group_name requestURI
eli5: In this search we can detect unauthenticated web requests against an EKS cluster Pod, by looking at k8s authentication data, user agent and source IPs and API direct request.
entities:
  - src_ip
how_to_implement:  You must install the AWS App for Splunk (version 5.1.0 or later) and Splunk Add-on forAWS (version 4.4.0 or later), then configure your CloudTrail inputs. You must also install Cloud Infrastructure data model. Customize the macro container_implant_aws_filter to filter out FPsAWS (version 4.4.0 or later), then configure your CloudTrail inputs. You must also install Cloud Infrastructure data model. Please also customize the `container_implant_aws_detection_filter` macro to filter out the false positives.
id: dbfca1dd-b8e5-4ba4-be0e-e565e5d62002
known_false_positives: Not all unauthenticated requests are malicious, but frequency, UA and source IPs and direct request to API provide context.
maintainers:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
mappings:
  mitre_attack:
    - Discovery
  kill_chain_phases:
    - Reconnaissance
  mitre_technique_id:
    - T1190
modification_date: '2020-03-24'
name: Amazon EKS Kubernetes Pod fingerprint scan detection
original_authors:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
references: []
security_domain: threat
spec_version: 2
type: splunk
version: '1.0'
