asset_type: Amazon EKS Kubernetes cluster
confidence: high
creation_date: '2020-03-24'
data_metadata:
  data_source:
    - AWS CloudWatch EKS Logs
  data_sourcetypes:
    - aws:cloudwatchlogs:eks
  providing_technologies:
    - AWS
description: This search provides information of unauthenticated requests via user agent, and authentication data against Kubernetes cluster
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: user.username, user.groups, sourceIPs, k8s_cluster_name, userAgent
        rule_description: Detect Amazon EKS cluster fingerprint scan
        rule_title: Kubernetes fingerprint detection scan
      risk:
        risk_object: k8s_cluster_name
        risk_object_type:
          - other
        risk_score: 70
      macros:
        - kubernetes_aws_scan_fingerprint_detection
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: 'sourcetype="aws:cloudwatchlogs:eks" "user.username"="system:anonymous" "user.groups{}"="system:unauthenticated"   | table  user.username user.groups{} sourceIPs{} responseStatus.reason k8s_cluster_name responseStatus.code userAgent verb | `kubernetes_aws_scan_fingerprint_detection`'
eli5: In this search we can detect unauthenticated web requests against an EKS cluster, by looking at k8s authentication data, user agent and source IPs.
entities:
  - k8s_cluster_name
how_to_implement:  You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs. The threshold value should be tuned to your environment.
id: 294c4686-63dd-4fe6-93a2-ca807626704a
known_false_positives: Not all unauthenticated requests are malicious, but frequency, UA and source IPs will provide context.
maintainers:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
mappings:
  mitre_attack:
    - Discovery
  kill_chain_phases:
    - Reconnaissance
  mitre_technique_id:
    - T1190
modification_date: '2020-03-24'
name: Amazon EKS Kubernetes cluster fingerprint scan detection
original_authors:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
references: []
security_domain: threat
spec_version: 2
type: splunk
version: '1.0'
