asset_type: GCP Kubernetes cluster
confidence: high
creation_date: '2020-03-24'
data_metadata:
  data_source:
    - GCP Stackdriver logs
  data_sourcetypes:
    - google:gcp:pubsub:message
  providing_technologies:
    - GCP
description: This search provides information of unauthenticated requests via user agent, and authentication data against Kubernetes cluster
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: src_ip, 
        rule_description: Detect scanning attempts against a GCP Kubernetes cluster
        rule_title: GCP Kubernetes cluster scan detection
      risk:
        risk_object: k8s_cluster_name
        risk_object_type:
          - other
        risk_score: 70
      macros:
        - kubernetes_gcp_scan_fingerprint_detection
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: sourcetype="google:gcp:pubsub:message" data.protoPayload.requestMetadata.callerIp!=127.0.0.1 data.protoPayload.requestMetadata.callerIp!=::1 "data.labels.authorization.k8s.io/decision"=forbid "data.protoPayload.status.message"=PERMISSION_DENIED data.protoPayload.authenticationInfo.principalEmail="system:anonymous"   | rename data.protoPayload.requestMetadata.callerIp as src_ip | stats count min(_time) as firstTime max(_time) as lastTime values(data.protoPayload.methodName) as methond values(data.protoPayload.resourceName) as resource_name values(data.protoPayload.requestMetadata.callerSuppliedUserAgent) as http_user_agent by src_ip data.resource.labels.cluster_name | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)`  | `kubernetes_gcp_scan_fingerprint_detection`
eli5: In this search we can detect unauthenticated web requests and possible attack against a GCP cluster, by looking at k8s authentication data, user agent, source IPs and destionation
entities:
  - k8s_cluster_name
  - src_ip
how_to_implement:  You must install the GCP App for Splunk (version 2.0.0 or later), then configure stackdriver and set a Pub/Sub subscription to be imported to Splunk. You must also install Cloud Infrastructure data model.Customize the macro kubernetes_gcp_scan_fingerprint_attack_detection to filter out FPs.
id: db5957ec-0144-4c56-b512-9dccbe7a2d26
investigations:
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: c00e7626-92cc-4e06-9a51-b6db0a50bd1f
    name: GCP Kubernetes activity by src_ip
    type: splunk
known_false_positives: Not all unauthenticated requests are malicious, but frequency, User Agent and source IPs will provide context.
maintainers:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
mappings:
  mitre_attack:
    - Discovery
  kill_chain_phases:
    - Reconnaissance
  mitre_technique_id:
    - T1190
modification_date: '2020-04-15'
name: GCP Kubernetes cluster scan detection
original_authors:
  - company: Splunk
    email: rsoto@splunk.com
    name: Rod Soto
references: []
security_domain: threat
spec_version: 2
type: splunk
version: '1.0'
