asset_type: Endpoint
confidence: medium
creation_date: '2017-06-18'
data_metadata:
  data_models:
    - Network_Resolution
  data_source:
    - DNS
  providing_technologies:
    - Splunk Stream
    - Bro
description: This search is used to detect attempts to use DNS tunneling, by calculating
  the length of responses to DNS TXT queries. Endpoints using DNS as a method of transmission
  for data exfiltration, command and control, or evasion of security controls can
  often be detected by noting unusually large volumes of DNS traffic.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: src, query
        rule_description: A DNS TXT record response of over 100 characters was detected.
        rule_title: Long DNS TXT Record Response
      risk:
        risk_object: src
        risk_object_type:
          - system
        risk_score: 70
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as
        lastTime from datamodel=Network_Resolution where DNS.message_type=response
        AND DNS.record_type=TXT by DNS.src DNS.dest DNS.answer DNS.record_type |  `drop_dm_object_name("DNS")`
        | eval anslen=len(answer) | search anslen>100 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
        | rename src as "Source IP", dest as "Destination IP", answer as "DNS Answer"
        anslen as "Answer Length" record_type as "DNS Record Type" firstTime as "First
        Time" lastTime as "Last Time" count as Count | table "Source IP" "Destination
        IP" "DNS Answer" "DNS Record Type"  "Answer Length" Count "First Time" "Last
        Time"'
      suppress:
        suppress_fields: src
        suppress_period: 86400s
eli5: This search uses the Network_Resolution data model and gathers all the answers
  to DNS queries for TXT records. The query then looks at the answer section and calculates
  the length of the answer. The search will then return information for those responses
  that exceed 100 characters in length.
entities:
  - src
how_to_implement: To successfully implement this search you need to ingest data from
  your DNS logs, or monitor DNS traffic using Stream, Bro or something similar. Specifically,
  this query requires that the DNS data model is populated with information regarding
  the DNS record type that is being returned as well as the data in the answer section
  of the protocol.
id: 05437c07-62f5-452e-afdc-04dd44815bb9
investigations:
  - id: 910e6512-edc9-4f93-ba24-5b786f47a672
    name: Get Process Responsible For The DNS Traffic
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd73
    name: Get DNS traffic ratio
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd72
    name: Get DNS Server History for a host
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: It's possible that legitimate TXT record responses can be long
  enough to trigger this search. You can modify the packet threshold for this search
  to help mitigate false positives.
maintainers:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
mappings:
  cis20:
    - CIS 8
    - CIS 12
    - CIS 13
  kill_chain_phases:
    - Command and Control
  mitre_attack:
    - Command and Control
    - Exfiltration
    - Commonly Used Port
  nist:
    - PR.DS
    - PR.PT
    - DE.AE
    - DE.CM
modification_date: '2017-09-18'
name: Detect Long DNS TXT Record Response
original_authors:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
references: []
security_domain: network
spec_version: 2
type: splunk
version: '1.0'
