asset_type: Endpoint
confidence: medium
creation_date: '2020-02-07'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint
  providing_technologies:
    - OSquery
description: This search looks for processes referencing the plist files that determine which applications are re-opened when a user reboots their machine.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: host
        rule_description: Observed process referencing MacOS com.apple.loginwindow.plist files for Host $host$
        rule_title: Possible attempt to establish persistence on $host$
      risk:
        risk_object: host
        risk_object_type:
          - system
        risk_score: 20
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `security_content_summariesonly` count values(Processes.process) as process values(Processes.parent_process) as parent_process min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process="*com.apple.loginwindow*" by Processes.user Processes.process_name Processes.parent_process_name Processes.dest  
      | `drop_dm_object_name(Processes)` 
      | `security_content_ctime(firstTime)`
      | `security_content_ctime(lastTime)`'
      suppress:
        suppress_fields: host
        suppress_period: 3600s
eli5: The search looks at the Endpoint data model to identify any MacOS process events referencing a property list file which determines which applications are "re-opened" during startup. This could indicate a malicious attempt to establish persistence on the system.
entities:
  - host
how_to_implement: In order to properly run this search, Splunk needs to ingest process data
  from your osquery deployed agents with the [splunk.conf](https://github.com/splunk/TA-osquery/blob/master/config/splunk.conf)
  pack enabled. Also the [TA-OSquery](https://github.com/splunk/TA-osquery) must
  be deployed across your indexers and universal forwarders in order to have the data populate the Endpoint data model.
id: 40bb64f9-f619-4e3d-8732-328d40377c4b
known_false_positives: At this stage, there are no known false positives. During testing, no process events refering the com.apple.loginwindow.plist files were observed during normal operation of re-opening applications on reboot. Therefore, it can be asumed that any occurences of this in the process events would be worth investigating. In the event that the legitimate modification by the system of these files is in fact logged to the process log, then the process_name of that process can be whitelisted.
maintainers:
  - company: Splunk
    email: jwindley@splunk.com
    name: Jamie Windley
mappings:
  cis20:
    - CIS 8
  kill_chain_phases:
    - Installation
    - Command and Control
  mitre_attack:
    - Persistence
  mitre_technique_id:
    - T1164
  nist:
    - DE.DP
    - DE.CM
modification_date: '2020-02-07'
name: MacOS - Re-opened Applications
original_authors:
  - company: Splunk
    email: jwindley@splunk.com
    name: Jamie Windley
references: []
security_domain: threat
spec_version: 2
type: splunk
version: '1.0'
