asset_type: Endpoint
confidence: high
creation_date: '2018-08-28'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search looks for changes of the ExecutionPolicy in the registry to them
  values "Unrestricted" or "Bypass", which allows the execution of malicious scripts.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, registry_path, registry_key_name, registry_value_name
        rule_description: An attempt to modify the default PowerShell execution policy
          in the registry to "Unrestricted" or "Bypass" was detected on $dest$.
        rule_title: Attempt To Set PowerShell Execution Policy To "Unrestricted" or "Bypass" On
          $dest$.
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 60
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats summariesonly=true count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Registry
        where Registry.registry_path=*Software\\Microsoft\\Powershell\\1\\ShellIds\\Microsoft.PowerShell*
        Registry.registry_key_name=ExecutionPolicy (Registry.registry_value_name=Unrestricted OR Registry.registry_value_name=Bypass)
        by Registry.registry_path Registry.registry_key_name Registry.registry_value_name Registry.dest
        | `drop_dm_object_name(Registry)` | `ctime(firstTime)`| `ctime(lastTime)` '
      suppress:
        suppress_fields: process_name, dest
        suppress_period: 86400s
eli5: This search looks for changes of the ExecutionPolicy in the registry. The ExecutionPolicy
  is a safetly feature that controls the conditions under which PowerShell loads configuration
  files and runs scripts. Usually, the ExecutionPolicy is Restricted for Windows Clients and
  RemoteSigned for Windows Servers, allowing only certian scripts to run. This search detects,
  when an attacker set the ExecutionPolicy to Unrestricted or Bypass, which allows to run any
  Powershell script.
entities:
  - dest
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Registry node. You must also be
  ingesting logs with the fields registry_path, registry_key_name and registry_value_name from your endpoints.
id: c2590137-0b08-4985-9ec5-6ae23d92f63d
known_false_positives: Administrators may attempt to change the default execution
  policy on a system for a variety of reasons. However, setting the policy to "Unrestricted" or "Bypass"
  as this search is designed to identify would be unusual. Hits should be reviewed
  and investigated as appropriate.
maintainers:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
  - company: Splunk
    email: pbareiss@splunk.com
    name: Patrick Bareiss
mappings:
  cis20:
    - CIS 3
    - CIS 8
  kill_chain_phases:
    - Installation
    - Actions on Objectives
  mitre_attack:
    - Execution
    - PowerShell
    - Scripting
  nist:
    - DE.CM
modification_date: '2019-12-02'
name: Attempt To Set Default PowerShell Execution Policy To Unrestricted or Bypass
original_authors:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
  - company: Splunk
    email: pbareiss@splunk.com
    name: Patrick Bareiss
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '4.0'
