asset_type: Endpoint
baselines:
  - id: 251930a5-1451-4428-bb13-eed5775be0ce
    name: Add Prohibited Processes to Enterprise Security
    type: splunk
confidence: high
creation_date: '2017-06-26'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search looks for applications on the endpoint that you have marked
  as prohibited.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, process_name, user
        rule_description: Prohibited software $process_name$ has been detected on
          $dest$.
        rule_title: Prohibited Software Detected On $dest$
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 50
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count min(_time) as firstTime max(_time) as
        lastTime from datamodel=Endpoint.Processes by Processes.dest Processes.user
        Processes.process_name | `ctime(firstTime)`| `ctime(lastTime)` | `drop_dm_object_name(Processes)`
        | `prohibited_softwares`'
      suppress:
        suppress_fields: dest,user
        suppress_period: 86400s
eli5: This search returns the number of times, as well as the first and last time,
  every process has run for each endpoint and user. It then displays only those processes
  that you have marked as "prohibited" in the Enterprise Security "Interesting Processes"
  table.
entities:
  - dest
how_to_implement: To successfully implement this search, you must be ingesting data
  that records process activity from your hosts to populate the endpoint data model
  in the processes node. This is typically populated via endpoint detection-and-response
  products, such as Carbon Black or endpoint data sources, such as Sysmon. The data
  used for this search is usually generated via logs that report process tracking
  in your Windows audit settings. In addition, you must also have only the `process_name`
  (not the entire process path) marked as "prohibited" in the Enterprise Security
  `interesting processes` table. To include the process names marked as "prohibited",
  which is included with ES Content Updates, run the included search <code>Add Prohibited
  Processes to Enterprise Security</code>.
id: a51bfe1a-94f0-48cc-b4e4-b6ae50145893
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: d98675ed-da43-4a7e-96a7-eeca3232ba8e
    name: Get Update Logs For Endpoint
    type: splunk
  - id: df7a7f50-30f2-4cde-8448-69d2d5f9b3c5
    name: Get Vulnerability Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd22
    name: Investigate Web Activity From Host
    type: splunk
known_false_positives: None identified
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
mappings:
  cis20:
    - CIS 2
  kill_chain_phases:
    - Installation
    - Command and Control
    - Actions on Objectives
  mitre_attack:
    - Execution
  nist:
    - ID.AM
    - PR.DS
modification_date: '2019-10-11'
name: Prohibited Software On Endpoint
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '2.0'
