asset_type: Endpoint
confidence: medium
creation_date: '2017-04-18'
data_metadata:
  data_models:
    - Network_Traffic
  data_source:
    - Network Communications
  providing_technologies:
    - Palo Alto Firewall
    - Bro
    - Splunk Stream
description: This search looks for network traffic defined by port and transport layer
  protocol in the Enterprise Security lookup table "lookup_interesting_ports", that
  is marked as prohibited, and has an associated 'allow' action in the Network_Traffic
  data model. This could be indicative of a misconfigured network device.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: src_ip, dest_ip
        rule_description: This search looks for network traffic defined by port and
          transport in the ES lookup table "lookup_interesting_ports", that is marked
          as prohibited, and yet has an 'allow' action in the Network_Traffic data
          model. This should help to identify areas where a network device is not
          properly configured.
        rule_title: Prohibited Network Traffic Allowed from $src_ip$
      risk:
        risk_object: src_ip
        risk_object_type:
          - system
        risk_score: 40
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count min(_time) as firstTime max(_time) as
        lastTime from datamodel=Network_Traffic where All_Traffic.action = allowed
        by All_Traffic.src_ip All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.action
        | lookup update=true interesting_ports_lookup dest_port as All_Traffic.dest_port
        OUTPUT app is_prohibited note transport | search is_prohibited=true | `security_content_ctime(firstTime)`
        | `security_content_ctime(lastTime)` | `drop_dm_object_name("All_Traffic")`'
      suppress:
        suppress_fields: dest_ip,src_ip
        suppress_period: 14400s
eli5: The search looks for traffic marked 'is_prohibited' in the Enterprise Security
  lookup table 'interesting_ports_lookup', and then determines if any network devices
  have an associated 'allow' action on that traffic by checking the Network_Traffic
  data model.
entities:
  - src_ip
how_to_implement: In order to properly run this search, Splunk needs to ingest data
  from firewalls or other network control devices that mediate the traffic allowed
  into an environment. This is necessary so that the search can identify an 'action'
  taken on the traffic of interest. The search requires the Network_Traffic data model
  be populated.
id: ce5a0962-849f-4720-a678-753fe6674479
investigations:
  - id: 9925d08f-561e-4faa-8912-e3888a842341
    name: Get Process Information For Port Activity
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: None identified
maintainers:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
mappings:
  cis20:
    - CIS 9
    - CIS 12
  kill_chain_phases:
    - Delivery
    - Command and Control
  mitre_attack:
    - Command and Control
    - Commonly Used Port
    - Exfiltration
    - Exfiltration Over Alternative Protocol
  nist:
    - DE.AE
    - PR.AC
modification_date: '2017-09-11'
name: Prohibited Network Traffic Allowed
original_authors:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
references: []
security_domain: network
spec_version: 2
type: splunk
version: '1.0'
