asset_type: Endpoint
confidence: medium
creation_date: '2016-08-09'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search will return a table of rare processes, the names of the systems
  running them, and the users who initiated each process.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, process
        rule_description: The process $process$ was detected running on $dest. This
          process is rare in your environment.
        rule_title: Rare Process $process$
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 20
      macros:
        - rare_executables_on_endpoint_filter
      schedule:
        cron_schedule: 10 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `security_content_summariesonly` count values(Processes.dest) as dest values(Processes.user)
        as user min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
        by Processes.process_name  | rename Processes.process_name as process | rex
        field=user "(?<user_domain>.*)\\\\(?<user_name>.*)" | `security_content_ctime(firstTime)`|
        `security_content_ctime(lastTime)`| search [| tstats count from datamodel=Endpoint.Processes
        by Processes.process_name | rare Processes.process_name limit=30 | rename
        Processes.process_name as process| `filter_rare_process_whitelist`| table
        process ] | `rare_executables_on_endpoint_filter`'
      suppress:
        suppress_fields: dest, process
        suppress_period: 86400s
eli5: This search first executes the subsearch and counts all of your processes to
  determine the 10 most rare (the limit set is 10). It then filters out whitelisted
  processes and outputs the first and last time a rare process was encountered, the
  destination where the process is running, the count of occurrences, and the users
  who initiated the processes.
entities:
  - dest
how_to_implement: To successfully implement this search, you must be ingesting data
  that records process activity from your hosts and populating the endpoint data model
  with the resultant dataset. The macro `filter_rare_process_whitelist` searches two
  lookup files to whitelist your processes.  These consist of `rare_process_whitelist_default.csv`
  and `rare_process_whitelist_local.csv`. To add your own processes to the whitelist,
  add them to `rare_process_whitelist_local.csv`. If you wish to remove an entry from
  the default lookup file, you will have to modify the macro itself to set the whitelist
  value for that process to false. You can modify the limit parameter and search scheduling
  to better suit your environment.
id: 44fddcb2-8d3b-454c-874e-7c6de5a4f7ac
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd22
    name: Investigate Web Activity From Host
    type: splunk
known_false_positives: Some legitimate processes may be only rarely executed in your
  environment. As these are identified, update `rare_process_whitelist_local.csv`
  to filter them out of your search results.
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
mappings:
  cis20:
    - CIS 2
    - CIS 8
  kill_chain_phases:
    - Installation
    - Command and Control
    - Actions on Objectives
  mitre_attack:
    - Execution
  nist:
    - ID.AM
    - PR.PT
    - PR.DS
    - DE.CM
modification_date: '2018-10-30'
name: Detect Rare Executables
original_authors:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '4.0'
