asset_type: ''
confidence: medium
creation_date: '2017-10-27'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: The search looks for command-line arguments used to hide a file or directory
  using the reg add command.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, process
        rule_description: Regedit.exe is used by attackers to hide malware files/directories
          in windows environments via registry key settings. This rule detects command-line
          arguments used to hide a file/directory
        rule_title: 'Regedit.exe used to hide a file/directory on $dest$ '
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 50
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` values(Processes.process) as process min(_time)
        as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where
        Processes.process_name = reg.exe Processes.process="*add*" Processes.process="*Hidden*"
        Processes.process="*REG_DWORD*" by Processes.process_name Processes.parent_process_name
        Processes.dest Processes.user| `drop_dm_object_name(Processes)` | `ctime(firstTime)`
        |`ctime(lastTime)`| regex process = "(/d\s+2)"'
      suppress:
        suppress_fields: dest,process
        suppress_period: 86400s
eli5: Reg.exe is a binary native to Windows platform used to edit the registry hives
  of the system. Attackers can leverage this binary to hide files by passing in arguments
  that are used to hide the files. In the search, we first gather results with keywords,
  add, Hidden, and REG_DWORD, that will be in the raw event and filter by process
  and the command-line. We then leverage regular expressions on the command-line field
  to look for /d value as 2 which is responsible for hiding a file or directory.
entities:
  - dest
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
id: c77162d3-f93c-45cc-80c8-22f6b5264x9f
investigations:
  - id: fecf2918-670d-4f1c-872b-3d7317a41xf9
    name: Get Registry Activities
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: None at the moment
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
mappings:
  cis20:
    - CIS 8
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Defense Evasion
    - Persistence
  nist:
    - DE.CM
modification_date: '2019-02-27'
name: Reg.exe used to hide files/directories via registry keys
original_authors:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '2.0'
