name: Registry Keys for Creating SHIM Databases
id: f5f6af30-7aa7-4295-bfe9-07fe87c01bbb
version: 2
date: '2020-07-21'
description: This search looks for registry activity associated with application compatibility
  shims, which can be leveraged by attackers for various nefarious purposes.
how_to_implement: To successfully implement this search, you must populate the Change_Analysis
  data model. This is typically populated via endpoint detection and response products,
  such as Carbon Black or other endpoint data sources such as Sysmon. The data used
  for this search is typically generated via logs that report reads and writes to
  the registry.
type: ESCU
references: []
author: Bhavin Patel, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Change_Analysis.All_Changes where All_Changes.object_category=registry
  AND (All_Changes.object_path="*CurrentVersion\\AppCompatFlags\\Custom*" OR All_Changes.object_path="*CurrentVersion\\AppCompatFlags\\InstalledSDB*")
  by All_Changes.dest, All_Changes.command, All_Changes.user, All_Changes.object,
  All_Changes.object_path | `drop_dm_object_name("All_Changes")` | `registry_keys_for_creating_shim_databases_filter`'
known_false_positives: There are many legitimate applications that leverage shim databases
  for compatibility purposes for legacy applications
tags:
  analytics_story:
  - Suspicious Windows Registry Activities
  - Windows Persistence Techniques
  mitre_attack_id:
  - T1546.011
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 8
  nist:
  - PR.PT
  - DE.CM
  security_domain: endpoint
  asset_type: Endpoint
