asset_type: Endpoint
confidence: medium
creation_date: '2017-01-13'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - Sysmon
    - Tanium
    - Ziften
description: This search looks for wmic.exe being launched with parameters to spawn
  a process on a remote system.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, user, process
        rule_description: This search looks for wmic.exe being launched with parameters
          to spawn a process on a remote system.
        rule_title: Remote process instantiation via WMI on $dest$
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 70
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` values(Processes.process) as process min(_time)
        as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where
        Processes.process_name = wmic.exe Processes.process="*/node*" Processes.process="*process*"
        Processes.process="*call*" Processes.process="*create*"   by Processes.process_name
        Processes.parent_process_name Processes.dest Processes.user | `drop_dm_object_name(Processes)`
        | `ctime(firstTime)` |`ctime(lastTime)`'
      suppress:
        suppress_fields: dest,user,process
        suppress_period: 28800s
eli5: Attackers are increasingly abusing native Windows utilities such as wmic.exe
  as a means to "live off the land", and avoid introducing new executables to the
  target system. In this search, we are looking for instances of wmic.exe being run
  with various parameters that are not typically used by administrators.
entities:
  - dest
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
id: d25d2c3d-d9d8-40ec-8fdf-e86fe155a3da
investigations:
  - id: 155e0571-7db6-42f2-aa62-9a3a4cf35c94
    name: Get Sysmon WMI Activity for Host
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
known_false_positives: The wmic.exe utility is a benign Windows application. It may
  be used legitimately by Administrators with these parameters for remote system administration,
  but it's relatively uncommon.
maintainers:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
mappings:
  cis20:
    - CIS 3
    - CIS 5
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Execution
    - Windows Management Instrumentation
  nist:
    - PR.PT
    - PR.AT
    - PR.AC
    - PR.IP
modification_date: '2019-02-27'
name: Remote Process Instantiation via WMI
original_authors:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '3.0'
