asset_type: Endpoint
confidence: medium
creation_date: '2018-05-31'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
description: This search monitors for remote modifications to registry keys.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, user
        rule_description: A registry key was modified remotely using the machine $dest$
          by $user$.
        rule_title: Remote Registry Key Modification detection on $dest$
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 30
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count values(Registry.registry_key_name) as
        registry_key_name values(Registry.registry_path) as registry_path min(_time)
        as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Registry where  Registry.registry_path="\\\\*"  by
        Registry.dest , Registry.status, Registry.user | `ctime(lastTime)` | `ctime(firstTime)`
        | `drop_dm_object_name(Registry)`'
      suppress:
        suppress_fields: dest, user,registry_path
        suppress_period: 14400s
eli5: This search looks for modifications made to the Windows registry from remote
  locations using reg.exe&#151;a tool used to create/update/delete/modify Windows
  registry keys. It is accomplished through specifying the machine names in the registry
  path, by entering double backslashes, followed by a computer name. In this search,
  we look for registry changes where the registry path contains the name of a remote
  computer. The search returns the number of times the remote server has been accessed,
  the first and last times the activity occurred, the name of the modified registry
  path, the host on which the modification took place, and the name of the user that
  performed the modification.
entities:
  - dest
how_to_implement: To successfully implement this search, you must populate the `Change_Analysis`
  data model. This is typically populated via endpoint detection-and-response products,
  such as Carbon Black, or endpoint data sources, such as Sysmon. The data used for
  this search is typically generated via logs that report reads and writes to the
  registry.
id: c9f4b923-f8af-4155-b697-1354f5dcbc5e
investigations:
  - id: fecf2918-670d-4f1c-872b-3d7317a41xf9
    name: Get Registry Activities
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: This technique may be legitimately used by administrators to
  modify remote registries, so it's important to filter these events out.
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
mappings:
  cis20:
    - CIS 8
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Defense Evasion
    - Persistence
    - Lateral Movement
  nist:
    - PR.PT
    - DE.CM
modification_date: '2018-05-31'
name: Remote Registry Key modifications
original_authors:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '2.0'
