asset_type: Endpoint
confidence: medium
creation_date: '2016-09-13'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search looks for the remote desktop process mstsc.exe running on
  systems upon which it doesn't typically run. This is accomplished by filtering out
  all systems that are noted in the `common_rdp_source category` in the Assets and
  Identity framework.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, user, process
        rule_description: The system $dest$ is running the remote desktop process,
          mstsc.exe. This system does not commonly run this application.
        rule_title: Remote Desktop Process Running On $dest$
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 40
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as
        lastTime from datamodel=Endpoint.Processes where Processes.process=mstsc.exe
        AND Processes.dest_category!=common_rdp_source by Processes.dest Processes.user
        Processes.process | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `drop_dm_object_name(Processes)`'
      suppress:
        suppress_fields: dest,user
        suppress_period: 28800s
eli5: This search finds systems that do not commonly use remote desktop, but which
  begin using it. It filters out all systems that have the "common_rdp_source" category
  applied. Categories are applied to systems using the Assets and Identity framework.
entities:
  - dest
how_to_implement: To successfully implement this search, you must be ingesting data
  that records process activity from your hosts to populate the endpoint data model
  in the processes node. The search requires you to identify systems that do not commonly
  use remote desktop. You can use the included support search "Identify Systems Using
  Remote Desktop" to identify these systems. After identifying them, you will need
  to add the "common_rdp_source" category to that system using the Enterprise Security
  Assets and Identities framework. This can be done by adding an entry in the assets.csv
  file located in `SA-IdentityManagement/lookups`.
id: f5939373-8054-40ad-8c64-cec478a22a4a
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: Remote Desktop may be used legitimately by users on the network.
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
mappings:
  cis20:
    - CIS 3
    - CIS 9
    - CIS 16
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Lateral Movement
    - Remote Desktop Protocol
  mitre_technique_id:
    - T1076
  nist:
    - DE.AE
    - PR.AC
    - PR.IP
modification_date: '2020-01-13'
name: Remote Desktop Process Running On System
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '4.0'
