asset_type: Endpoint
confidence: medium
creation_date: '2017-01-13'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search looks for wmic.exe being launched with parameters to operate
  on remote systems.
detect:
  splunk:
    correlation_rule:
      macros:
        - remote_wmi_command_attempt_input_filter
        - remote_wmi_command_attempt_output_filter
      notable:
        drilldown_name: View WMI process information on $dest$
        drilldown_search: '| from datamodel:Endpoint.Processes | search dest="$dest$" process_id=$process_id$'
        nes_fields: dest,user,process_name
        rule_description: This search looks for wmic.exe being launched with parameters
          to operate on remote systems.
        rule_title: Endpoint - Remote WMI command attempt
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 30
      schedule:
        cron_schedule: 50 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` values(Processes.parent_process_id) as parent_process_id,
        values(Processes.process_name) as process_name, values(Processes.process) as process,
        earliest(_time) as firstTime, latest(_time) as lastTime
        from datamodel=Endpoint.Processes where Processes.process_name=wmic.exe AND
        Processes.process="*/node*" `remote_wmi_command_attempt_input_filter` by
        Processes.process_id, Processes.user, Processes.dest
        | `drop_dm_object_name(Processes)` | `ctime(firstTime)`| `ctime(lastTime)`
        | table process_id, dest, user, process_name, process, parent_process_id
        `remote_wmi_command_attempt_output_filter`'
      suppress:
        suppress_fields: dest,user,process_id
        suppress_period: 28800s
eli5: Many a times, attackers leverage native Windows utilities that are designed
  to help administrators better manage their systems, infrastructure, and auditing,
  but are instead leveraged for malicious purposes. In this case, we are looking for
  instances of wmic.exe being run with various parameters that are not typically used
  by administrators.
entities:
  - dest
  - process_id
  - process
  - parent_process_id
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
id: 272df6de-61f1-4784-877c-1fbc3e2d0838
investigations:
  - id: d8362a34-b78a-4364-9733-59b505f5b8d5
    name: Get Process Registry Activity
    type: splunk
  - id: 6a9ad4d9-6ef2-4b85-953f-a37ab256acd5
    name: Get Process File Activity
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
known_false_positives: Administrators may use this legitimately to gather info from
  remote systems.
maintainers:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
mappings:
  cis20:
    - CIS 3
    - CIS 5
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Execution
    - Windows Management Instrumentation
  nist:
    - PR.PT
    - PR.AT
    - PR.AC
    - PR.IP
modification_date: '2018-12-03'
name: Remote WMI Command Attempt
original_authors:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '2.0'
