name: Sc exe Manipulating Windows Services
id: f0c693d8-2a89-4ce7-80b4-98fea4c3ea6d
version: 2
date: '2019-02-27'
description: This search looks for arguments to sc.exe indicating the creation or
  modification of a Windows service.
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
type: ESCU
references: []
author: Rico Valdez, Splunk
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process_name = sc.exe (Processes.process="* create *" OR Processes.process="*
  config *") by Processes.process_name Processes.parent_process_name Processes.dest
  Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `sc_exe_manipulating_windows_services_filter`'
known_false_positives: Using sc.exe to manipulate Windows services is uncommon. However,
  there may be legitimate instances of this behavior. It is important to validate
  and investigate as appropriate.
tags:
  analytics_story:
  - Windows Service Abuse
  - Orangeworm Attack Group
  - DHS Report TA18-074A
  - Windows Persistence Techniques
  - Disabling Security Tools
  mitre_attack_id:
  - T1050
  - T1031
  - T1089
  kill_chain_phases:
  - Installation
  cis20:
  - CIS 3
  - CIS 5
  - CIS 8
  nist:
  - PR.IP
  - PR.PT
  - PR.AC
  - PR.AT
  - DE.CM
  security_domain: endpoint
  asset_type: Endpoint
