asset_type: Endpoint
confidence: medium
creation_date: '2017-11-03'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search looks for flags passed to schtasks.exe on the command-line
  that indicate that a forced reboot of system is scheduled.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, user, process
        rule_description: This search looks for flags passed to schtasks.exe on the
          command-line that indicate a job is scheduled to force a reboot
        rule_title: Schtasks used for scheduling a force reboot
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 80
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -5h@h
        latest_time: -1h@h
      search: '| tstats `summariesonly` values(Processes.process) as process min(_time)
        as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where
        Processes.process_name = schtasks.exe Processes.process="*shutdown*" Processes.process="*/r*"
        Processes.process="*/f*" by Processes.process_name Processes.parent_process_name
        Processes.dest Processes.user | `drop_dm_object_name(Processes)` | `ctime(firstTime)`
        | `ctime(lastTime)`'
      suppress:
        suppress_fields: dest, process
        suppress_period: 28800s
eli5: The search looks for execution of schtasks.exe with parameters that indicate
  a task is being scheduled that would cause a forced reboot on the host. Schtasks.exe
  is a native windows program that is used to schedule tasks on local or remote systems.
  Attackers often leverage this capability to schedule the execution of commands or
  establish persistence. This tactic is leveraged by the Bad Rabbit Ransomware.
entities:
  - dest
how_to_implement: To successfully implement this search you need to be ingesting logs
  with both the process name and command-line from your endpoints. If you are using
  Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
id: 1297fb80-f42a-4b4a-9c8a-88c066437cf6
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd22
    name: Investigate Web Activity From Host
    type: splunk
known_false_positives: Administrators may create jobs on systems forcing reboots to
  perform updates, maintenance, etc.
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
mappings:
  cis20:
    - CIS 3
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Persistence
    - Execution
    - Scheduled Task
  nist:
    - PR.IP
modification_date: '2019-02-27'
name: Schtasks used for forcing a reboot
original_authors:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '2.0'
