asset_type: Endpoint
confidence: medium
creation_date: '2016-09-13'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search looks for flags passed to schtasks.exe on the command-line
  that indicate a job is being scheduled on a remote system.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, user, process
        rule_description: This search looks for flags passed to schtasks.exe on the
          command-line that indicate a job is being scheduled on a remote system.
        rule_title: Schtasks scheduling job on remote system
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 50
      macros:
        - schtasks_scheduling_job_on_remote_system_filter
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `security_content_summariesonly` values(Processes.process) as process min(_time)
        as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where
        Processes.process_name = schtasks.exe Processes.process="*/create*" Processes.process="*
        /s *" by Processes.process_name Processes.parent_process_name Processes.dest
        Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
        | `schtasks_scheduling_job_on_remote_system_filter` '
      suppress:
        suppress_fields: dest,process
        suppress_period: 28800s
eli5: The search looks for execution of schtasks.exe with parameters that indicate
  a task is being scheduled on a remote host. Schtasks.exe is a native windows program
  that is used to schedule tasks on local or remote systems. Attackers often leverage
  this capability to schedule the execution of commands or malicious executables on
  remote systems.
entities:
  - dest
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
id: 1297fb80-f42a-4b4a-9c8a-88c066237cf6
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: Administrators may create jobs on remote systems, but this
  activity is usually limited to a small set of hosts or users. It is important to
  validate and investigate as appropriate.
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
mappings:
  cis20:
    - CIS 3
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Persistence
    - Privilege Escalation
    - Execution
    - Scheduled Task
  mitre_technique_id:
    - T1053
  nist:
    - PR.IP
modification_date: '2020-01-10'
name: Schtasks scheduling job on remote system
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '3.0'
