name: Single Letter Process On Endpoint
id: a4214f0b-e01c-41bc-8cc4-d2b71e3056b4
version: 2
date: '2019-04-01'
description: This search looks for process names that consist only of a single letter.
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
type: ESCU
references: []
author: David Dorsey, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes by Processes.dest, Processes.user,
  Processes.process, Processes.process_name | `drop_dm_object_name(Processes)` | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)` | eval process_name_length = len(process_name),
  endExe = if(substr(process_name, -4) == ".exe", 1, 0) | search process_name_length=5
  AND endExe=1 | table count, firstTime, lastTime, dest, user, process, process_name
  | `single_letter_process_on_endpoint_filter`'
known_false_positives: Single-letter executables are not always malicious. Investigate
  this activity with your normal incident-response process.
tags:
  analytics_story:
  - DHS Report TA18-074A
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 2
  nist:
  - ID.AM
  - PR.DS
  security_domain: endpoint
  asset_type: Endpoint
