asset_type: Endpoint
confidence: high
creation_date: '2018-03-22'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search looks for process names that consist only of a single letter.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, process, user
        rule_description: A process with a single letter, $process_name$ was detected
          on $dest$
        rule_title: Single-letter executable $process_name$ on $dest$.
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 50
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count min(_time) as firstTime max(_time) as
        lastTime from datamodel=Endpoint.Processes by Processes.dest, Processes.user,
        Processes.process, Processes.process_name | `drop_dm_object_name(Processes)`
        | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` | eval process_name_length = len(process_name),
        endExe = if(substr(process_name, -4) == ".exe", 1, 0) | search process_name_length=5
        AND endExe=1 | table count, firstTime, lastTime, dest, user, process, process_name'
      suppress:
        suppress_fields: dest, user
        suppress_period: 86400s
eli5: This search returns all the processes for each endpoint and user and filters
  out any process that isn't 5 characters long and ends with .exe.
entities:
  - dest
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
id: a4214f0b-e01c-41bc-8cc4-d2b71e3056b4
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: Single-letter executables are not always malicious. Investigate
  this activity with your normal incident-response process.
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
mappings:
  cis20:
    - CIS 2
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Execution
  nist:
    - ID.AM
    - PR.DS
modification_date: '2019-04-01'
name: Single Letter Process On Endpoint
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '2.0'
