asset_type: Endpoint
confidence: medium
creation_date: '2017-08-20'
data_metadata:
  data_models:
    - Network_Traffic
  data_source:
    - Network Communications
  providing_technologies:
    - Bro
    - Splunk Stream
description: This search looks for spikes in the number of Server Message Block (SMB)
  traffic connections.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: src
        rule_description: There was a spike in SMB traffic from $src$.
        rule_title: SMB Traffic Spike from $src$
      risk:
        risk_object: src
        risk_object_type:
          - system
        risk_score: 50
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -7d@d
        latest_time: -10m@m
      search: '| tstats `security_content_summariesonly` count from datamodel=Network_Traffic where
        All_Traffic.dest_port=139 OR All_Traffic.dest_port=445 OR All_Traffic.app=smb
        by _time span=1h, All_Traffic.src | `drop_dm_object_name("All_Traffic")` |
        eventstats max(_time) as maxtime | stats count as num_data_samples max(eval(if(_time
        >= relative_time(maxtime, "-70m@m"), count, null))) as count avg(eval(if(_time<relative_time(maxtime,
        "-70m@m"), count, null))) as avg stdev(eval(if(_time<relative_time(maxtime,
        "-70m@m"), count, null))) as stdev by src | eval upperBound=(avg+stdev*2),
        isOutlier=if(count > upperBound AND num_data_samples >=50, 1, 0) | where isOutlier=1
        | table src count'
      suppress:
        suppress_fields: src
        suppress_period: 28800s
eli5: Server Message Block (SMB) traffic, a protocol used for Windows file sharing-activity,
  is often leveraged by attackers. One example of SMB abuse was the WannaCry ransomware,
  which leveraged a vulnerability in the SMB protocol to propagate to other systems.
  Attackers have also used SMB for lateral movement with a target environment and
  to test credentials against target systems. While SMB is highly prevalent in Windows
  environments, a spike in SMB traffic may still be indicative of this type of malicious
  activity. This search looks for a traffic spike in SMB traffic from a particular
  system. If such a spike is detected, you may want to investigate the source and
  analyze the cause of the abnormal traffic.
entities:
  - src
how_to_implement: This search requires you to be ingesting your network traffic logs
  and populating the `Network_Traffic` data model.
id: 7f5fb3e1-4209-4914-90db-0ec21b936378
investigations:
  - id: 9925d08f-561e-4faa-8912-e3888a842341
    name: Get Process Information For Port Activity
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: df7a7f50-30f2-4cde-8448-69d2d5f9b3c5
    name: Get Vulnerability Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: A file server may experience high-demand loads that could cause
  this analytic to trigger.
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
mappings:
  cis20:
    - CIS 8
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Lateral Movement
    - Execution
    - Command and Control
    - Commonly Used Port
  nist:
    - DE.CM
modification_date: '2017-09-10'
name: SMB Traffic Spike
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
references: []
security_domain: network
spec_version: 2
type: splunk
version: '1.0'
