name: SMB Traffic Spike
id: 7f5fb3e1-4209-4914-90db-0ec21b936378
version: '2.0'
date: '2020-01-22'
description: This search looks for spikes in the number of Server Message Block (SMB)
  traffic connections.
how_to_implement: This search requires you to be ingesting your network traffic logs
  and populating the `Network_Traffic` data model.
type: ESCU
references: []
author: David Dorsey, Splunk
search: '| tstats `security_content_summariesonly` count from datamodel=Network_Traffic
  where All_Traffic.dest_port=139 OR All_Traffic.dest_port=445 OR All_Traffic.app=smb
  by _time span=1h, All_Traffic.src | `drop_dm_object_name("All_Traffic")` | eventstats
  max(_time) as maxtime | stats count as num_data_samples max(eval(if(_time >= relative_time(maxtime,
  "-70m@m"), count, null))) as count avg(eval(if(_time<relative_time(maxtime, "-70m@m"),
  count, null))) as avg stdev(eval(if(_time<relative_time(maxtime, "-70m@m"), count,
  null))) as stdev by src | eval upperBound=(avg+stdev*2), isOutlier=if(count > upperBound
  AND num_data_samples >=50, 1, 0) | where isOutlier=1 | table src count | `smb_traffic_spike_filter` '
known_false_positives: A file server may experience high-demand loads that could cause
  this analytic to trigger.
tags:
  analytics_story:
  - Emotet Malware (DHS Report TA18-201A)
  - Ransomware
  - DHS Report TA18-074A
  - Hidden Cobra Malware
  mitre_attack_id:
  - T1043
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 8
  nist:
  - DE.CM
