name: Malicious PowerShell Process - Connect To Internet With Hidden Window
id: ee18ed37-0802-4268-9435-b3b91aaa18db
version: 3.0
date: '2020-03-16'
description: This search looks for PowerShell processes started with parameters to
  modify the execution policy of the run, run in a hidden window, and connect to the
  Internet. This combination of command-line options is suspicious because it's overriding
  the default PowerShell execution policy, attempts to hide its activity from the
  user, and connects to the Internet.
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
type: ESCU
references: []
author: Bhavin Patel, Splunk
search: '| tstats `security_content_summariesonly` count values(Processes.process) as process
        values(Processes.parent_process) as parent_process min(_time) as firstTime
        max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=powershell.exe
        by Processes.user Processes.process_name Processes.parent_process_name Processes.dest  |
        `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` |
        search process="*-Exec*" process="*-WindowStyle*" process="*hidden*" process="*New-Object*"
        process="*System.Net.WebClient*"'
known_false_positives: Legitimate process can have this combination of command-line
  options, but it's not common.
tags:
  analytics_story: 
      - malicious_powershell
  cis20:
      - CIS 3
      - CIS 7
      - CIS 8
  kill_chain_phases:
      - Command and Control
      - Actions on Objectives
  mitre_attack:
      - Execution
      - PowerShell
      - Scripting
  nist:
      - PR.PT
      - DE.CM
      - PR.IP

