name: Suspicious LNK file launching a process
id: 5d814af1-1041-47b5-a9ac-d754e82e9a26
version: 3
date: '2020-07-21'
description: This search looks for a ``*.lnk` file under `C:\User*` or `*\Local\Temp\*`
  executing a process. This is common behavior used by various spear phishing tools.
how_to_implement: You must be ingesting data that records filesystem and process activity
  from your hosts to populate the Endpoint data model. This is typically populated
  via endpoint detection-and-response products, such as Carbon Black, or endpoint
  data sources, such as Sysmon.
type: ESCU
author: Jose Hernandez, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_name="*.lnk"
  AND (Filesystem.file_path="C:\\Users*" OR Filesystem.file_path="*Local\\Temp*")  by
  _time span=1h Filesystem.process_id Filesystem.file_name Filesystem.file_path Filesystem.file_hash
  Filesystem.user | `drop_dm_object_name(Filesystem)` | rename process_id as lnk_pid
  | join lnk_pid, _time [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where Processes.process_name=*  by _time span=1h Processes.parent_process_id Processes.process_id
  Processes.process_name Processes.dest Processes.process_path Processes.process |
  `drop_dm_object_name(Processes)` | rename parent_process_id as lnk_pid | fields
  _time lnk_pid process_id dest process_name process_path process] | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | table firstTime, lastTime, lnk_pid, process_id,
  user, dest, file_name, file_path, process_name, process, process_path, file_hash
  | `suspicious_lnk_file_launching_a_process_filter` '
known_false_positives: This detection should yield little or no false positive results.
  It is uncommon for LNK files to execute process from temporary or user directories.
tags:
  analytics_story:
  - Phishing Payloads
  mitre_attack_id:
  - T1566.002
  kill_chain_phases:
  - Installation
  - Actions on Objectives
  cis20:
  - CIS 7
  - CIS 8
  nist:
  - ID.AM
  - PR.DS
  security_domain: network
  asset_type: Endpoint
