asset_type: Windows
confidence: medium
creation_date: '2018-01-08'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Sysmon
description: This search detects writes to the recycle bin by a process other than
  explorer.exe.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, file_name, process_name
        rule_description: The process $process_name$ on $dest$ wrote $file_name$ to
          the Recycle Bin.
        rule_title: Suspicious process $process_name$ wrote to the Recycle Bin on
          $dest$
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 70
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count min(_time) as firstTime max(_time) as
        lastTime values(Filesystem.file_path) as file_path values(Filesystem.file_name)
        as file_name FROM datamodel=Endpoint.Filesystem where Filesystem.filepath
        = "*$Recycle.Bin*" by Filesystem.process_id Filesystem.dest | `drop_dm_object_name("Filesystem")`|
        search [| tstats `summariesonly` values(Processes.user) as user values(Processes.process_name)
        as process_name values(Processes.parent_process_name) as parent_process_name
        FROM datamodel=Endpoint.Processes where Processes.process_name != "explorer.exe"
        by Processes.process_id Processes.dest| `drop_dm_object_name("Processes")`
        | table process_id dest]'
      suppress:
        suppress_fields: dest
        suppress_period: 86400s
eli5: This search uses data on file writes captured via Sysmon to watch for writes
  to the Recycle Bin by processes other than explorer.exe. The search looks for event
  code 11 in the Sysmon events, which indicates a file-creation event. Next, it looks
  for files created with a path that includes the string "$Recycle.Bin" by processes
  other than explorer.exe, which is the process responsible for copying files to the
  Recycle Bin on delete. It will report the system where the activity occurred, the
  path to which the file was written, the process responsible for the write, and the
  times it first and last saw this activity.
entities:
  - dest
how_to_implement: To successfully implement this search you need to be ingesting information
  on filesystem and process logs responsible for the changes from your endpoints into
  the `Endpoint` datamodel in the `Processes` and `Filesystem` nodes.
id: b5541828-8ffd-4070-9d95-b3da4de924cb
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: Because the Recycle Bin is a hidden folder in modern versions
  of Windows, it would be unusual for a process other than explorer.exe to write to
  it. Incidents should be investigated as appropriate.
maintainers:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
mappings:
  cis20:
    - CIS 8
  mitre_attack:
    - Collection
    - Data Staged
  nist:
    - DE.CM
modification_date: '2019-03-01'
name: Suspicious writes to windows Recycle Bin
original_authors:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '2.0'
