asset_type: Windows
confidence: medium
creation_date: '2018-01-08'
data_metadata:
  data_source:
    - Endpoint Intel
  data_sourcetypes:
    - XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
  providing_technologies:
    - Sysmon
description: This search detects writes to the 'System Volume Information' folder
  by something other than the System process.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, file_name, process
        rule_description: The process $process$ on $dest$ wrote $file_name$ to 'System
          Volume Information'.
        rule_title: Suspicious process $process$ wrote to 'System Volume Information'
          on $dest$
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 70
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: (sourcetype=XmlWinEventLog:Microsoft-Windows-Sysmon/Operational OR tag=process)
        EventCode=11 process_id!=4 file_path=*System\ Volume\ Information* | stats
        count min(_time) as firstTime max(_time) as lastTime by dest, Image, file_path
        | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
      suppress:
        suppress_fields: dest
        suppress_period: 86400s
eli5: This search uses data on file writes captured via Sysmon to watch for writes
  to the "System Volume Information" folder by processes other than the system process.
  The search looks for event code 11 in the Sysmon events, which indicates a file-creation
  event. It then looks for a file created with a path that includes "System Volume
  Information" and a process ID (PID) other than 4. PID 4 is assigned to the System
  process on Windows systems. Excluding these writes allows us to filter out legitimate
  activity. It will report the system where the activity occurred, the path to which
  the file was written, the process responsible for the write, and the times it first
  and last saw this activity.
entities:
  - dest
how_to_implement: You need to be ingesting logs with both the process name and command-line
  from your endpoints. If you are using Sysmon, you must have at least version 6.0.4
  of the Sysmon TA.
id: cd6297cd-2bdd-4aa1-84aa-5d2f84228fac
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: It is possible that other utilities or system processes may
  legitimately write to this folder. Investigate and modify the search to include
  exceptions as appropriate.
maintainers:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
mappings:
  cis20:
    - CIS 8
  mitre_attack:
    - Collection
    - Data Staged
  nist:
    - DE.CM
modification_date: '2018-01-08'
name: Suspicious writes to System Volume Information
original_authors:
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '1.0'
