asset_type: ''
confidence: medium
creation_date: '2017-02-17'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: The wevtutil.exe application is the windows event log utility. This searches
  for wevtutil.exe with parameters for clearing the application, security, setup,
  or system event logs.
detect:
  splunk:
    correlation_rule:
      notable:
        drilldown_name: View wevtutil process information on $dest$
        drilldown_search: '| from datamodel:Endpoint.Processes | search dest="$dest$"  process=*wevtutil*'
        nes_fields: dest, process, user
        rule_description: wevtutil is the windows event log tool. This searches for
          wevtutil clearing the security or system logs.
        rule_title: Suspicious wevtutil Usage
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 50
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` values(Processes.process) as process min(_time)
        as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where
        Processes.process_name = wevtutil.exe Processes.process="*cl*" (Processes.process="*System*"
        OR Processes.process="*Security*" OR Processes.process="*Setup*" OR Processes.process="*Application*")
        by Processes.process_name Processes.parent_process_name Processes.dest Processes.user|
        `drop_dm_object_name(Processes)` | `ctime(firstTime)` |`ctime(lastTime)`'
      suppress:
        suppress_fields: dest,process
        suppress_period: 28800s
eli5: This search looks for execution of wevtutil.exe with command-line arguments
  that indicate that it has been used to delete the setup, application, security,
  or system event logs. The search returns the number of times the behavior was observed,
  the first and last time it was seen, the host exhibiting the behavior and the user
  context of the process execution.
entities:
  - dest
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
id: 2827c0fd-e1be-4868-ae25-59d28e0f9d4f
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd22
    name: Investigate Web Activity From Host
    type: splunk
known_false_positives: The wevtutil.exe application is a legitimate Windows event
  log utility. Administrators may use it to manage Windows event logs.
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
mappings:
  cis20:
    - CIS 3
    - CIS 5
    - CIS 6
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Defense Evasion
    - Indicator Removal on Host
  nist:
    - DE.DP
    - PR.IP
    - PR.PT
    - PR.AC
    - PR.AT
    - DE.AE
modification_date: '2019-02-28'
name: Suspicious wevtutil Usage
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '2.0'
