name: TOR Traffic
id: ea688274-9c06-4473-b951-e4cb7a5d7a45
version: '1.0'
date: '2017-09-11'
description: This search looks for network traffic identified as The Onion Router
  (TOR), a benign anonymity network which can be abused for a variety of nefarious
  purposes.
how_to_implement: In order to properly run this search, Splunk needs to ingest data
  from firewalls or other network control devices that mediate the traffic allowed
  into an environment. This is necessary so that the search can identify an 'action'
  taken on the traffic of interest. The search requires the Network_Traffic data model
  be populated.
type: ESCU
references: []
author: David Dorsey, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Network_Traffic where All_Traffic.app=tor AND All_Traffic.action=allowed
  by All_Traffic.src_ip All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.action
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `drop_dm_object_name("All_Traffic")`'
known_false_positives: None at this time
tags:
  analytics_story:
  - Ransomware
  - Command and Control
  - Prohibited Traffic Allowed or Protocol Mismatch
  mitre_attack_id:
  - T1043
  kill_chain_phases:
  - Command and Control
  cis20:
  - CIS 9
  - CIS 12
  nist:
  - DE.AE
