asset_type: Endpoint
confidence: medium
creation_date: '2017-08-21'
data_metadata:
  data_models:
    - Network_Traffic
  data_source:
    - Network Communications
  providing_technologies:
    - Palo Alto Firewall
    - Bro
    - Splunk Stream
description: This search looks for network traffic identified as The Onion Router
  (TOR), a benign anonymity network which can be abused for a variety of nefarious
  purposes.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: src_ip, dest_ip
        rule_description: Network traffic accessing TOR detected from $src_ip$
        rule_title: TOR Network Traffic Allowed from $src_ip$
      risk:
        risk_object: src_ip
        risk_object_type:
          - system
        risk_score: 40
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count min(_time) as firstTime max(_time) as
        lastTime from datamodel=Network_Traffic where All_Traffic.app=tor AND All_Traffic.action=allowed
        by All_Traffic.src_ip All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.action
        | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `drop_dm_object_name("All_Traffic")`'
      suppress:
        suppress_fields: src_ip
        suppress_period: 28800s
eli5: The search leverages the Enterprise Security Network_Traffic data model to look
  for network traffic that has been identified as TOR and marked as 'allowed'.
entities:
  - src_ip
how_to_implement: In order to properly run this search, Splunk needs to ingest data
  from firewalls or other network control devices that mediate the traffic allowed
  into an environment. This is necessary so that the search can identify an 'action'
  taken on the traffic of interest. The search requires the Network_Traffic data model
  be populated.
id: ea688274-9c06-4473-b951-e4cb7a5d7a45
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd71
    name: Get Process Info
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: fecf2918-670d-4f1c-872b-3d7317a41bf9
    name: Get Parent Process Info
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
known_false_positives: None at this time
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
mappings:
  cis20:
    - CIS 9
    - CIS 12
  kill_chain_phases:
    - Command and Control
  mitre_attack:
    - Command and Control
    - Commonly Used Port
    - Exfiltration
  nist:
    - DE.AE
modification_date: '2017-09-11'
name: TOR Traffic
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
references: []
security_domain: network
spec_version: 2
type: splunk
version: '1.0'
