asset_type: Web Server
confidence: medium
creation_date: '2017-03-14'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search looks for suspicious processes on all systems labeled as
  web servers.
detect:
  splunk:
    correlation_rule:
      notable:
        nes_fields: dest, user, process
        rule_description: This search looks for suspicious processes on all systems
          labeled as web servers
        rule_title: Web Servers Executing Suspicious Processes
      risk:
        risk_object: dest
        risk_object_type:
          - system
        risk_score: 75
      schedule:
        cron_schedule: 0 * * * *
        earliest_time: -70m@m
        latest_time: -10m@m
      search: '| tstats `summariesonly` count min(_time) as firstTime max(_time) as
        lastTime from datamodel=Endpoint.Processes where Processes.dest_category="web_server"
        AND (Processes.process="*whoami*" OR Processes.process="*ping*" OR Processes.process="*iptables*"
        OR Processes.process="*wget*" OR Processes.process="*service*" OR Processes.process="*curl*")
        by Processes.process Processes.process_name, Processes.dest Processes.user|
        `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`'
      suppress:
        suppress_fields: dest, process
        suppress_period: 28800s
eli5: This detection search uses the Enterprise Security Endpoint data model. The
  search uses tstats to search within an accelerated data model to find suspicious
  applications or processes such as whoami, ping, iptables, wget, service, or curl,
  running on hosts which are marked as web servers in the Assets and Identity Framework
  of ES.
entities:
  - dest
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model. In addition, web servers will need to be identified in the Assets and Identity
  Framework of Enterprise Security.
id: ec3b7601-689a-4463-94e0-c9f45638efb9
investigations:
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd76
    name: Get Authentication Logs For Endpoint
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d55
    name: Get Risk Modifiers For User
    type: splunk
  - id: 3d6c3213-5fff-4a1e-b57d-b24c262171e7
    name: Get Notable History
    type: splunk
  - id: f3fb4d1b-5f33-4b01-b541-c7af9534c242
    name: Get Notable Info
    type: splunk
  - id: fdcfb369-1725-4c24-824a-22972d7f0d65
    name: Get Risk Modifiers For Endpoint
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd74
    name: Get User Information from Identity Table
    type: splunk
  - id: bc91a8cf-35e7-4bb2-8140-e756cc06fd89
    name: Investigate Suspicious Strings in HTTP Header
    type: splunk
known_false_positives: Some of these processes may be used legitimately on web servers
  during maintenance or other administrative tasks.
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
mappings:
  cis20:
    - CIS 3
  kill_chain_phases:
    - Actions on Objectives
  mitre_attack:
    - Defense Evasion
    - Exploitation of Vulnerability
    - Execution
    - Discovery
    - System Information Discovery
  nist:
    - PR.IP
modification_date: '2019-04-01'
name: Web Servers Executing Suspicious Processes
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
references: []
security_domain: endpoint
spec_version: 2
type: splunk
version: '1.0'
