author: David Dorsey, Splunk
datamodel:
- Endpoint
date: '2019-04-01'
description: This search counts the numbers of times the remote desktop process, mstsc.exe,
  has run on each system.
how_to_implement: To successfully implement this search you must be ingesting endpoint
  data that records process activity.
id: 063dfe9f-b1d7-4254-a16d-1e2e7eadd6a8
known_false_positives: none
name: Identify Systems Using Remote Desktop
references: []
search: '| tstats `security_content_summariesonly` count from datamodel=Endpoint.Processes
  where Processes.process_name="*mstsc.exe*" by Processes.dest Processes.process_name
  | `drop_dm_object_name(Processes)` | sort - count'
tags:
  deployments:
  - Daily Cache Updates
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_name
  - Processes.dest
  security_domain: endpoint
type: Baseline
version: 1
