author: David Dorsey, Splunk
datamodel:
- Change
date: '2020-08-12'
description: This search builds a table of previously seen images used to launch cloud
  compute instances
how_to_implement: You must be ingesting the approrpiate cloud infrastructure logs
id: 6f1ca5dc-e445-401c-9845-a96d2b6ba184
known_false_positives: none
name: Previously Seen Cloud Compute Images - Update
references: []
search: '| tstats earliest(_time) as firstTimeSeen, latest(_time) as lastTimeSeen
  from datamodel=Change where All_Changes.action=created by All_Changes.Instance_Changes.image_id
  | `drop_dm_object_name("All_Changes")` | `drop_dm_object_name("Instance_Changes")`
  | where image_id != "unknown" | inputlookup append=t previously_seen_cloud_compute_images
  | stats min(firstTimeSeen) as firstTimeSeen max(lastTimeSeen) as lastTimeSeen by
  image_id | where lastTimeSeen > relative_time(now(), `previously_seen_cloud_compute_images_forget_window`)
  | eventstats min(firstTimeSeen) as globalFirstTime | eval enough_data = if(globalFirstTime
  <= relative_time(now(), "-7d@d"), 1, 0) | outputlookup previously_seen_cloud_compute_images'
tags:
  analytic_story:
  - Cloud Cryptomining
  deployments:
  - Daily Cache Updates
  detections:
  - Cloud Compute Instance Created With Previously Unseen Image
  product:
  - Splunk Security Analytics for AWS
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Changes.action
  - All_Changes.Instance_Changes.image_id
  security_domain: network
type: Baseline
version: 1
