name: Baseline Of Cloud Instances Launched
id: b01bd274-f661-4f9c-bd9f-cf23ff6ae0bc
version: 1
date: '2020-08-14'
description: This search is used to build a Machine Learning Toolkit (MLTK) model
  for how many instances are created in the environment. By default, the search uses
  the last 90 days of data to build the model and the model is rebuilt weekly. The
  model created by this search is then used in the corresponding detection search,
  which identifies subsequent outliers in the number of instances created in a 
  small time window.
how_to_implement: 'You must have Enterprise Security 6.0 or later, if not you will need
  to verify that the Machine Learning Toolkit (MLTK) version 4.2 or later is installed,
  along with any required dependencies. Depending on the number of users in your environment,
  you may also need to adjust the value for max_inputs in the MLTK settings for the
  DensityFunction algorithm, then ensure that the search completes in a reasonable
  timeframe. By default, the search builds the model using the past 30 days of data.
  You can modify the search window to build the model over a longer period of time,
  which may give you better results. You may also want to periodically re-run this
  search to rebuild the model with the latest data.\

  More information on the algorithm used in the search can be found at `https://docs.splunk.com/Documentation/MLApp/4.2.0/User/Algorithms#DensityFunction`.'
author: Rico Valdez, Splunk
search: '| tstats count as instances_launched from datamodel=Change where
   (All_Changes.action=created OR All_Changes.action=started)
   AND All_Changes.status=success AND All_Changes.object_category=instance `excessive_cloud_instances_input_filter`
   by _time span=10m
   | eval HourOfDay=strftime(_time, "%H") | eval DayOfWeek=strftime(_time, "%w")
   | fit DensityFunction instances_launched by "HourOfDay,DayOfWeek" into excessive_cloud_instances_model_v1'
tags:
  analytics_story:
  - Cloud Cryptomining
  - Suspicious AWS EC2 Activities
  detections:
  - Abnormally High Number Of Cloud Instances Launched

