author: David Dorsey, Splunk
date: '2017-09-15'
description: This search counts the numbers of times the system has generated remote
  desktop traffic.
how_to_implement: To successfully implement this search, you must ingest network traffic
  and populate the Network_Traffic data model.
id: 5cdda34f-4caf-4128-a713-0837fc48b67a
name: Identify Systems Creating Remote Desktop Traffic
search: '| tstats `security_content_summariesonly` count from datamodel=Network_Traffic
  where All_Traffic.dest_port=3389 by All_Traffic.src | `drop_dm_object_name("All_Traffic")`
  | sort - count'
tags:
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
type: batch
version: 1
