author: David Dorsey, Splunk
date: '2020-09-03'
description: This search builds a table of the first and last times seen for every
  user role and command combination. This is broadly defined as any event that runs
  or creates something. This table is then cached.
how_to_implement: You must be ingesting Cloud infrastructure logs from your cloud
  provider.
id: 69d75f4b-b794-4a66-a777-730357b886b4
name: Previously Seen Cloud API Calls Per User Role - Initial
search: '| tstats earliest(_time) as firstTimeSeen, latest(_time) as lastTimeSeen
  from datamodel=Change where All_Changes.user_type=AssumedRole AND All_Changes.status=success
  by All_Changes.user, All_Changes.command | `drop_dm_object_name("All_Changes")`
  | eventstats min(firstTimeSeen) as globalFirstTime | eval enough_data = if(globalFirstTime
  <= relative_time(now(), "-7d@d"), 1, 0) | table user, command, firstTimeSeen, lastTimeSeen,
  enough_data | outputlookup previously_seen_cloud_api_calls_per_user_role'
tags:
  analytic_story:
  - Suspicious Cloud User Activities
  deployments:
  - 90 Day Baseline
  detections:
  - Cloud API Calls From Previously Unseen User Roles
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
type: batch
version: 1
