name: Previously Seen AWS Provisioning Activity Sources - DM
id: 4ce865fc-f43e-4521-a8ed-ab8af99052d7
version: 1
date: '2020-08-19'
###description: This search builds a table of the first and last times seen for every
  IP address (along with its physical location) previously associated with cloud-provisioning
  activity. This is broadly defined as any event that runs or creates something.
###how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs.
author: Rico Valdez, Splunk
search: '`cloudtrail` (eventName=Run* OR eventName=Create*) | iplocation sourceIPAddress
  | stats earliest(_time) as firstTime, latest(_time) as lastTime by sourceIPAddress,
  City, Region, Country | outputlookup previously_seen_provisioning_activity_src.csv
  | stats count'


search: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime from datamodel=Change 
  where (All_Changes.action=started or All_Changes.action=created) All_Changes.status=success 
  All_Changes.object_category=instance by src | iplocation src | outputlookup previously_seen_provisioning_activity_src.csv'


tags:
  analytics_story:
  - AWS Suspicious Provisioning Activities
  detections:
  - AWS Cloud Provisioning From Previously Unseen IP Address
  - AWS Cloud Provisioning From Previously Unseen City
  - AWS Cloud Provisioning From Previously Unseen Country
  - AWS Cloud Provisioning From Previously Unseen Region
