baseline:
  splunk:
    schedule:
      cron_schedule: ''
      earliest_time: -90d@d
      latest_time: -10m@m
    search: sourcetype=aws:cloudtrail eventName=RunInstances errorCode=success | rename
      requestParameters.instanceType as instanceType | fillnull value="m1.small" instanceType
      | stats earliest(_time) as earliest latest(_time) as latest by instanceType
      | outputlookup previously_seen_ec2_instance_types.csv | stats count
creation_date: '2018-03-08'
data_metadata:
  data_source:
    - AWS CloudTrail logs
  data_sourcetypes:
    - aws:cloudtrail
  providing_technologies:
    - AWS
description: This search builds a table of previously seen EC2 instance types
eli5: In this support search, we create a table of the earliest and latest time that
  a specific EC2 instance type has been seen. The instanceType request field is not
  required and defaults to m1.small, so any time this field is null, the search defaults
  the field to m1.small. This table is then outputted to a csv file.
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS version (4.4.0 or later), then configure your CloudTrail
  inputs.
id: b8f029f2-65a6-4d76-be98-dad1c9d59c45
known_false_positives: ''
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
modification_date: '2018-03-08'
name: Previously Seen EC2 Instance Types
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
spec_version: 2
type: splunk
version: '1.0'
