baseline:
  splunk:
    schedule:
      cron_schedule: ''
      earliest_time: -30d@d
      latest_time: -10m@m
    search: | tstats earliest(_time) as firstTime latest(_time) as lastTime from 
      datamodel=Authentication where Authentication.signature=AssumeRole by 
      Authentication.vendor_account Authentication.user Authentication.src Authentication.user_role 
      | rex field=Authentication.user_role "arn:aws:sts:*:(?<dest_account>.*):" | where 
      'Authentication.vendor_account'!='dest_account' | rename Authentication.vendor_account as 
      requestingAccountId dest_account as requestedAccountId | table requestingAccountId 
      requestedAccountId firstTime lastTime | outputlookup previously_seen_aws_cross_account_activity
creation_date: '2020-05-04'
data_metadata:
  data_source:
    - AWS CloudTrail logs
  data_model
    - Authentication
  providing_technologies:
    - AWS
description: This search looks for **AssumeRole** events where the requesting account
  differs from the requested account, then writes these relationships to a lookup
  file.
eli5: In this support search, we look for **AssumeRole** events where the requesting
  account is different from the requested account. The first and last times these
  events are seen are written to a lookup file.
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs. Validate the user name entries in `previously_seen_aws_cross_account_activity.csv`,
  a lookup file created by this support search.
id: 0de7ce99-ab0a-41fe-9624-345df83f08cc
known_false_positives: ''
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
modification_date: '2020-05-04'
name: Previously Seen AWS Cross Account Activity - DM
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
spec_version: 2
type: splunk
version: '1.0'
