name: Previously Seen Cloud Instance Modifications By User - Initial
id: f36dc403-739d-42f3-83a3-49237d8654c5
version: 1
date: '2020-07-29'
description: This search builds a table of previously seen users that have modified
  a cloud instance.
how_to_implement: You must be ingesting the approrpiate cloud infrastructure logs and have the latest Change Datamodel accelerated.
author: Rico Valdez, Splunk
search: '| tstats earliest(_time) as firstTimeSeen, latest(_time) as lastTimeSeen from datamodel=Change
    where All_Changes.action=modified All_Changes.change_type=EC2 All_Changes.status=success by All_Changes.user 
| `drop_dm_object_name("All_Changes")` 
| eventstats min(firstTimeSeen) as globalFirstTime 
| eval enough_data = if(globalFirstTime <= relative_time(now(), "-7d@d"), 1, 0) 
| outputlookup previously_seen_cloud_instance_modifications_by_user'
tags:
  analytics_story:
  - Suspicious Cloud Instance Activities
  detections:
  - Cloud Instance Modified By Previously Unseen User
  deployments:
  - 90 Day Baseline

