baseline:
  splunk:
    lookups:
      - zoom_first_time_child_process
    macros:
      - previously_seen_zoom_child_processes_forget_window
    schedule:
      cron_schedule: '0 * * * *'
      earliest_time: -70m@m
      latest_time: -10m@m
    search: '| tstats `security_content_summariesonly` min(_time) as firstTimeSeen max(_time) as lastTimeSeen
        from datamodel=Endpoint.Processes where (Processes.parent_process_name=zoom.exe OR Processes.parent_process_name=zoom.us)
        by Processes.process_name Processes.dest| `drop_dm_object_name(Processes)`
        | table firstTimeSeen, lastTimeSeen, process_name, dest
        | inputlookup zoom_first_time_child_process append=t
        | stats min(firstTimeSeen) as firstTimeSeen max(lastTimeSeen) as lastTimeSeen by process_name, dest
        | where lastTimeSeen > relative_time(now(), "`previously_seen_zoom_child_processes_forget_window`")
        | outputlookup zoom_first_time_child_process'
creation_date: '2020-05-20'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search updates the table containing the first and last time each child process
    of zoom was seen per endpoint.
eli5: This search returns the first and last time a process was seen per endpoint with
    a parent process of zoom.exe (Windows) or zoom.us (macOS) within the last hour. It then updates
    this information with historical data and filters out proces_name and endpoint pairs that have not
    been seen within the specified time window. This updated table is outputed to disk.
id: 80aea7fd-5da2-4533-b3c2-560533bfbaee
known_false_positives: n/a 
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints, to populate the Endpoint
  data model in the Processes node.
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
modification_date: '2020-05-20'
name: Previously Seen Zoom Child Processes - Update
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
spec_version: 2
type: splunk
version: '1.0'
