baseline:
  splunk:
    lookups:
      - zoom_first_time_child_process
    schedule:
      cron_schedule: '0 0 1 1,3,5,7,9,11 *'
      earliest_time: -60d@d
      latest_time: -10m@m
    search: '| tstats `security_content_summariesonly` min(_time) as firstTimeSeen max(_time) as lastTimeSeen
        from datamodel=Endpoint.Processes where (Processes.parent_process_name=zoom.exe OR Processes.parent_process_name=zoom.us)
        by Processes.process_name Processes.dest| `drop_dm_object_name(Processes)`
        | table dest, process_name, firstTimeSeen, lastTimeSeen
        | outputlookup zoom_first_time_child_process'
creation_date: '2020-04-13'
data_metadata:
  data_models:
    - Endpoint
  data_source:
    - Endpoint Intel
  providing_technologies:
    - Carbon Black Response
    - CrowdStrike Falcon
    - Sysmon
    - Tanium
    - Ziften
description: This search builds a table of first and last time each child process
    of zoom was seen per endpoint.
eli5: This search returns the first and last time a process was seen per endpoint with
    a parent process of zoom.exe (Windows) or zoom.us (macOS). This table is outputed to disk.
id: 60b9c00f-a9d6-4e51-803c-5d63ea21b95b
known_false_positives: n/a 
how_to_implement: n/a
maintainers:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
modification_date: '2020-04-13'
name: Previously Seen Zoom Child Processes - Initial
original_authors:
  - company: Splunk
    email: davidd@splunk.com
    name: David Dorsey
spec_version: 2
type: splunk
version: '1.0'
