name: Previously Seen Cloud Compute Creations By User
id: 9fa1c205-4e08-4681-bb1b-d0943e734b85
version: 1
date: '2018-03-15'
description: This search builds a table of previously seen users that have launched
  a cloud compute instance.
how_to_implement: You must be ingesting the approrpiate cloud infrastructure logs
  and have the Security Research cloud data model installed.
author: David Dorsey, Splunk
search: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime from datamodel=Cloud_Infrastructure.Compute
  where Compute.action=run `previously_seen_cloud_compute_creations_by_user_input_filter`
  by Compute.src_user | `drop_dm_object_name("Compute")` | outputlookup previously_seen_cloud_compute_creations_by_user
  | stats count'
tags:
  analytics_story:
  - Cloud Cryptomining
  detections:
  - Cloud Compute Instance Created By Previously Unseen User
