baseline:
  splunk:
    schedule:
      cron_schedule: 0 0 1 * *
      earliest_time: -30d@d
      latest_time: -10m@m
    search: | tstats earliest(_time) as firstTime latest(_time) as lastTime from datamodel=Authentication 
      where Authentication.signature=ConsoleLogin by Authentication.user Authentication.src
      | iplocation Authentication.src | rename Authentication.user as user Authentication.src as src
      | table user src City Region Country firstTime lastTime | outputlookup previously_seen_users_console_logins.csv
      | stats count
creation_date: '2020-04-28'
data_metadata:
  data_source:
    - AWS CloudTrail logs
  data_model:
    - Authentication
  providing_technologies:
    - AWS
description: This search looks for CloudTrail events where a user logs into the console,
  then creates a baseline of the latest and earliest times, City, Region, and Country
  we have encountered this user in our dataset, grouped by ARN, within the last 30
  days.
eli5: In this support search, we look for console login events by a particular user
  and create an initial baseline cache for the previous 30 days, including the earliest
  and latest times, City, Region, and Country a particular user ARN is seen in our
  dataset, grouped by the ARN value. In cases where City and Region cannot be determined,
  the source IP address is substituted for these values.
entities:
  - user
  - src
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs. Please validate the user name entries in `previously_seen_users_console_logins.csv`,
  which is a lookup file created as a result of running this support search.
id: 0a87ecf9-dc6a-43af-861a-205e75a09bf5
known_false_positives: n/a
maintainers:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
modification_date: '2020-04-28'
name: Previously seen users in CloudTrail
original_authors:
  - company: Splunk
    email: bpatel@splunk.com
    name: Bhavin Patel
  - company: Splunk
    email: rvaldez@splunk.com
    name: Rico Valdez
spec_version: 2
type: splunk
version: '1.0'
