name: Previously seen users in CloudTrail - DM
id: 0a87ecf9-dc6a-43af-861a-205e75a09bf5
version: 1
date: '2020-05-28'
description: This search looks for CloudTrail events where a user logs into the console,
  then creates a baseline of the latest and earliest times, City, Region, and Country
  we have encountered this user in our dataset, grouped by username, within the last 30
  days.
update with versions in how-to-implement
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS (version 4.4.0 or later), then configure your CloudTrail
  inputs. Please validate the user name entries in `previously_seen_users_console_logins.csv`,
  which is a lookup file created as a result of running this support search.
author: Rico Valdez, Splunk
search: '`cloudtrail` eventName=ConsoleLogin | rename userIdentity.arn as user | iplocation
  src | eval City=if(City LIKE "",src,City),Region=if(Region LIKE "",src,Region) |
  stats earliest(_time) as firstTime latest(_time) as lastTime by user src City Region
  Country | outputlookup previously_seen_users_console_logins.csv | stats count'

search: '| tstats earliest(_time) as firstTime latest(_time) as lastTime from datamodel=Authentication
  where Authentication.signature=ConsoleLogin by Authentication.user Authentication.src
  | iplocation Authentication.src | rename Authentication.user as user Authentication.src as src
  | table user src City Region Country firstTime lastTime | outputlookup previously_seen_users_console_logins.csv
  | stats count
tags:
  analytics_story:
  - Suspicious AWS Login Activities - DM
  detections:
  - Detect AWS Console Login by User from New Country
  - Detect AWS Console Login by User from New Region
  - Detect AWS Console Login by User from New City
  - Detect new user AWS Console Login - DM
