name: Previously Seen Cloud Instance Modifications By User - Update
id: 534b7d30-7b0c-4510-8f55-65439850d58d
version: 1
date: '2020-07-29'
description: This search updates a table of previously seen Cloud Instance modifications that have been made by a user
how_to_implement: You must install the AWS App for Splunk (version 5.1.0 or later)
  and Splunk Add-on for AWS version (4.4.0 or later), then configure your CloudTrail
  inputs. To add or remove APIs that modify an EC2 instance, edit the macro `ec2_modification_api_calls`.
author: Rico Valdez, Splunk
search: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime from datamodel=Change.All_Changes
  where All_Changes.action=modified All_Changes.object_category=instance All_Changes.status=success 
  `previously_seen_cloud_instance_modifications_by_user_input_filter` by All_Changes.user 
  | `drop_dm_object_name("All_Changes")` | inputlookup append=t previously_seen_cloud_instance_modifications_by_user
  | stats min(firstTime) as firstTime max(lastTime) as lastTime by user
  | eventstats min(firstTime) as globalFirstTime
  | eval enough_data = if(globalFirstTime <= relative_time(now(), "-7d@d"), 1, 0)
  | outputlookup previously_seen_cloud_instance_modificationss_by_user | stats count'
tags:
  analytics_story:
  - Suspicious Cloud Change Activity
  detections:
  - Cloud Instance Modified With Previously Unseen User
