name: Previously Seen Cloud Compute Images - Update
id: 6f1ca5dc-e445-401c-9845-a96d2b6ba184
version: 1
date: '2020-08-12'
description: This search builds a table of previously seen images used to launch cloud
  compute instances
how_to_implement: You must be ingesting the approrpiate cloud infrastructure logs
  and have the Security Research cloud data model installed.
author: David Dorsey, Splunk
search: '| tstats earliest(_time) as firstTime, latest(_time) as lastTime from datamodel=Change
  where All_Changes.action=created `previously_seen_cloud_compute_image_input_filter` by All_Changes.Instance_Changes.image_id
  | `drop_dm_object_name("Change")` | inputlookup append=t previously_seen_cloud_compute_images | stats min(firstTime) as firstTime
  max(lastTime) as lastTime by image_id | outputlookup previously_seen_cloud_compute_images'
tags:
  analytics_story:
  - Cloud Cryptomining
  detections:
  - Cloud Compute Instance Created With Previously Unseen Image
