name: Detect New Login Attempts to Routers
id: bce3ed7c-9b1f-42a0-abdf-d8b123a34836
version: 2
date: '2024-05-14'
author: Bhavin Patel, Splunk
status: experimental
type: TTP
description: The following analytic identifies new login attempts to routers. It leverages
  authentication logs from the ES Assets and Identity Framework, focusing on assets
  categorized as routers. The detection flags connections that have not been observed
  in the past 30 days. This activity is significant because unauthorized access to
  routers can lead to network disruptions or data interception. If confirmed malicious,
  attackers could gain control over network traffic, potentially leading to data breaches
  or further network compromise.
data_source: []
search: '| tstats `security_content_summariesonly` count earliest(_time) as earliest
  latest(_time) as latest from datamodel=Authentication where Authentication.dest_category=router
  by Authentication.dest Authentication.user| eval isOutlier=if(earliest >= relative_time(now(),
  "-30d@d"), 1, 0) | where isOutlier=1| `security_content_ctime(earliest)`| `security_content_ctime(latest)`
  | `drop_dm_object_name("Authentication")` | `detect_new_login_attempts_to_routers_filter`'
how_to_implement: To successfully implement this search, you must ensure the network
  router devices are categorized as "router" in the Assets and identity table. You
  must also populate the Authentication data model with logs related to users authenticating
  to routing infrastructure.
known_false_positives: Legitimate router connections may appear as new connections
references: []
tags:
  analytic_story:
  - Router and Infrastructure Security
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Authentication.dest_category
  - Authentication.dest
  - Authentication.user
  risk_score: 25
  security_domain: network
