name: Detect Risky SPL using Pretrained ML Model
id: b4aefb5f-1037-410d-a149-1e091288ba33
version: 2
date: '2024-05-26'
author: Abhinav Mishra, Kumar Sharad, Namratha Sreekanta and Xiao Lin, Splunk
status: experimental
type: Anomaly
description: The following analytic identifies potentially risky SPL commands executed
  by users. It leverages a pretrained machine learning text classifier that analyzes
  command text, user, and search type to assign a risk score between 0 and 1. This
  detection is significant as it helps identify suspicious or unauthorized search
  activities that could indicate malicious intent or misuse of the Splunk environment.
  If confirmed malicious, such activity could lead to unauthorized data access, data
  exfiltration, or further exploitation of the system.
data_source: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Splunk_Audit.Search_Activity where Search_Activity.search_type=adhoc
  Search_Activity.user!=splunk-system-user by Search_Activity.search Search_Activity.user
  Search_Activity.search_type | eval spl_text = ''Search_Activity.search''. " " .''Search_Activity.user''.
  " " .''Search_Activity.search_type''| dedup spl_text | apply risky_spl_pre_trained_model
  | where risk_score > 0.5 | `drop_dm_object_name(Search_Activity)` | table search,
  user, search_type, risk_score | `detect_risky_spl_using_pretrained_ml_model_filter`'
how_to_implement: This detection depends on the MLTK app which can be found here -
  https://splunkbase.splunk.com/app/2890/ and the Splunk Audit datamodel which can
  be found here - https://splunkbase.splunk.com/app/1621/. Additionally, you need
  to be ingesting logs which include Search_Activity.search, Search_Activity.user,
  Search_Activity.search_type from your endpoints. The risk score threshold should
  be adjusted based on the environment. The detection uses a custom MLTK model hence
  we need a few more steps for deployment, as outlined here - https://gist.github.com/ksharad-splunk/be2a62227966049047f5e5c4f2adcabb.
known_false_positives: False positives may be present if suspicious behavior is observed,
  as determined by frequent usage of risky keywords.
references:
- https://docs.splunk.com/Documentation/Splunk/latest/Security/SPLsafeguards#Commands_that_trigger_the_warning
tags:
  analytic_story:
  - Splunk Vulnerabilities
  asset_type: Web Server
  confidence: 40
  cve:
  - CVE-2022-32154
  impact: 50
  message: A potentially risky Splunk command has been run by $user$, kindly review.
  mitre_attack_id:
  - T1059
  observable:
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Search_Activity.search
  - Search_Activity.user
  - Search_Activity.search_type
  risk_score: 20
  security_domain: audit
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://github.com/splunk/attack_data/raw/master/datasets/attack_techniques/T1203/search_activity.txt
    source: audittrail
    sourcetype: audittrail
    update_timestamp: true
    custom_index: _audit
