author: Rico Valdez, Splunk
date: '2020-07-21'
description: Detect failed Okta SSO events
how_to_implement: This search is specific to Okta and requires Okta logs are being
  ingested in your Splunk deployment.
id: 371a6545-2618-4032-ad84-93386b8698c5
known_false_positives: There may be a faulty config preventing legitmate users from
  accessing apps they should have access to.
name: Okta Failed SSO Attempts
search: '`okta` displayMessage="User attempted unauthorized access to app" | stats  min(_time)
  as firstTime max(_time) as lastTime values(app) as Apps count by user, result ,displayMessage,
  src_ip | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `okta_failed_sso_attempts_filter` '
tags:
  analytics_story:
  - Suspicious Okta Activity
  asset_type: Infrastructure
  cis20:
  - CIS 16
  mitre_attack_id:
  - T1078.001
  nist:
  - DE.CM
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: access
type: batch
version: 2
