name: Okta Account Locked Out
id: d650c0ae-bdc5-400e-9f0f-f7aa0a010ef1
version: 1
date: '2022-09-21'
author: Michael Haag, Splunk
status: experimental
type: Anomaly
description: The following analytic utilizes the user.acount.lock event to identify
  associates who are locked out of Okta. An adversary attempting to brute force or
  password spray account names may lock accounts out depending on the threshold.
data_source: []
search: '`okta` eventType=user.account.lock | stats count min(_time) as firstTime
  max(_time) as lastTime values(displayMessage) by src_user src_ip eventType status
  | where count >=3 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`|
  `okta_account_locked_out_filter`'
how_to_implement: This analytic is specific to Okta and requires Okta logs to be ingested.
known_false_positives: False positives may be present. Tune Okta and tune the analytic
  to ensure proper fidelity. Modify risk score as needed. Drop to anomaly until tuning
  is complete.
references:
- https://developer.okta.com/docs/reference/api/event-types/?q=user.acount.lock
tags:
  analytic_story:
  - Suspicious Okta Activity
  - Okta MFA Exhaustion
  asset_type: Infrastructure
  confidence: 80
  impact: 80
  message: $src_user$ account has been locked out.
  mitre_attack_id:
  - T1110
  observable:
  - name: src_user
    type: User
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - src_user
  - src_ip
  - eventType
  - status
  risk_score: 64
  security_domain: access
