name: Okta Risk Threshold Exceeded
id: d8b967dd-657f-4d88-93b5-c588bcd7218c
version: 1
date: "2022-09-29"
author: Michael Haag, Splunk
status: production
type: Correlation
description:
  The following correlation will take risk associated with the content
  from  "Suspicious Okta Activity" and "Okta MFA Exhaustion" analytic stories and
  tally it up. Once it hits the threshold of 100 (can be changed), it will trigger an a notable. As needed, reduce or raise the risk scores assocaited with the anomaly and TTP analytics tagged to these two analytic stories.
data_source: []
search:
  '| tstats `security_content_summariesonly` sum(All_Risk.calculated_risk_score) as risk_score,
  count(All_Risk.calculated_risk_score) as risk_event_count,values(All_Risk.annotations.mitre_attack.mitre_tactic_id)
  as annotations.mitre_attack.mitre_tactic_id, dc(All_Risk.annotations.mitre_attack.mitre_tactic_id)
  as mitre_tactic_id_count, values(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as annotations.mitre_attack.mitre_technique_id, dc(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as mitre_technique_id_count, values(All_Risk.tag) as tag, values(source) as source,
  dc(source) as source_count from datamodel=Risk.All_Risk by All_Risk.risk_object,All_Risk.risk_object_type
  All_Risk.analyticstories | `drop_dm_object_name("All_Risk")` | eval "annotations.mitre_attack"="annotations.mitre_attack.mitre_technique_id",
  risk_threshold=100 | where All_Risk.analyticstories IN ("Suspicious Okta Activity",
  "Okta MFA Exhaustion")  risk_score > risk_threshold | `get_risk_severity(risk_score)`
  | `okta_risk_threshold_exceeded_filter`'
how_to_implement:
  Ensure "Suspicious Okta Activity" and "Okta MFA Exhaustion" analytic
  stories are enabled. TTP may be set to Notables for point detections, anomaly should
  not be notables but risk generators. The correlation relies on risk before generating
  a notable. Modify the value as needed. Default threshold is 100. This value may
  need to be increased based on activity in your environment.
known_false_positives:
  False positives will be limited to the amount of events generated
  by the analytics tied to the stories. Analytics will need to be tesetd and tuned,
  risk score reduced, as needed based on organization.
references:
  - https://developer.okta.com/docs/reference/api/event-types
  - https://sec.okta.com/everythingisyes
tags:
  analytic_story:
    - Suspicious Okta Activity
    - Okta MFA Exhaustion
  asset_type: Infrastructure
  confidence: 80
  impact: 70
  message: Risk score $risk_score$ threshold exceeded for $risk_object$ related to Okta events.
  mitre_attack_id:
    - T1078
    - T1110
  observable:
    - name: risk_object
      type: Hostname
      role:
        - Victim
  product:
    - Splunk Enterprise
    - Splunk Enterprise Security
    - Splunk Cloud
  required_fields:
    - All_Risk.risk_object
    - All_Risk.risk_object_type
    - All_Risk.analyticstories
  risk_score: 56
  security_domain: access
