name: Splunk Command and Scripting Interpreter Risky Commands
id: 1cf58ae1-9177-40b8-a26c-8966040f11ae
version: 1
date: '2022-05-23'
author: Michael Haag, Splunk
status: production
type: Hunting
description: The Splunk platform contains built-in search processing language (SPL)
  safeguards to warn you when you are about to unknowingly run a search that contains
  commands that might be a security risk. This warning appears when you click a link
  or type a URL that loads a search that contains risky commands. The warning does
  not appear when you create ad hoc searches. This warning alerts you to the possibility
  of unauthorized actions by a malicious user. Unauthorized actions include - Copying
  or transferring data (data exfiltration), Deleting data and Overwriting data. All
  risky commands may be found here https://docs.splunk.com/Documentation/Splunk/latest/Security/SPLsafeguards#Commands_that_trigger_the_warninga.
  A possible scenario when this might occur is when a malicious actor creates a search
  that includes commands that exfiltrate or damage data. The malicious actor then
  sends an unsuspecting user a link to the search. The URL contains a query string
  (q) and a search identifier (sid), but the sid is not valid. The malicious actor
  hopes the user will use the link and the search will run. During analysis, pivot
  based on user name and filter any user or queries not needed. Queries ran from a
  dashboard are seen as adhoc queries. When a query runs from a dashboard it will
  not show in audittrail logs the source dashboard name. The query defaults to adhoc
  and no Splunk system user activity. In addition, modify this query by removing key
  commands that generate too much noise, or too little, and create separate queries
  with higher confidence to alert on.
data_source: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Splunk_Audit.Search_Activity where Search_Activity.search
  IN ("*| runshellscript *", "*| collect *","*| delete *", "*| fit *", "*| outputcsv
  *", "*| outputlookup *", "*| run *", "*| script *", "*| sendalert *", "*| sendemail
  *", "*| tscolle*") Search_Activity.search_type=adhoc Search_Activity.user!=splunk-system-user
  by Search_Activity.search Search_Activity.info Search_Activity.total_run_time Search_Activity.user
  Search_Activity.search_type | `drop_dm_object_name(Search_Activity)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `splunk_command_and_scripting_interpreter_risky_commands_filter`'
how_to_implement: To successfully implement this search acceleration is recommended
  against the Search_Activity datamodel that runs against the splunk _audit index.  In
  addition, this analytic requires the Common Information Model App which includes
  the Splunk Audit Datamodel https://splunkbase.splunk.com/app/1621/. Splunk SOAR
  customers can find a SOAR workbook that walks an analyst through the process of
  running these hunting searches in the references list of this detection. In order
  to use this workbook, a user will need to run a curl command to post the file to
  their SOAR instance such as "curl -u username:password https://soar.instance.name/rest/rest/workbook_template
  -d @splunk_psa_0622.json". A user should then create an empty container or case,
  attach the workbook, and begin working through the tasks.
known_false_positives: False positives will be present until properly filtered by
  Username and search name.
references:
- https://docs.splunk.com/Documentation/Splunk/latest/Security/SPLsafeguards#Commands_that_trigger_the_warning
- https://www.github.com/splunk/security_content/blob/develop/workbooks/splunk_psa_0622.json
- https://advisory.splunk.com/advisories/SVD-2024-0302
tags:
  analytic_story:
  - Splunk Vulnerabilities
  asset_type: Web Server
  confidence: 40
  cve:
  - CVE-2022-32154
  - CVE-2024-29946
  impact: 50
  message: A risky Splunk command has ran by $user$ and should be reviewed.
  mitre_attack_id:
  - T1059
  observable:
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Search_Activity.search
  - Search_Activity.info
  - Search_Activity.total_run_time
  - Search_Activity.user
  - Search_Activity.savedsearch_name
  - Search_Activity.search_type
  risk_score: 20
  security_domain: audit
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1213/audittrail/audittrail.log
    source: audittrail
    sourcetype: audittrail
    update_timestamp: true
    custom_index: _audit
