name: Splunk DoS Using Malformed SAML Request
id: 8e8a86d5-f323-4567-95be-8e817e2baee6
version: 2
date: '2024-05-29'
author: Rod Soto
status: production
type: Hunting
data_source:
- Splunk
description: The following analytic detects a denial of service (DoS) attempt using
  a malformed SAML request targeting the /saml/acs REST endpoint in Splunk Enterprise
  versions lower than 9.0.6 and 8.2.12. It leverages `splunkd` logs, specifically
  looking for error messages containing "xpointer" in the `expr` field. This activity
  is significant because it can cause the Splunk daemon to crash or hang, disrupting
  service availability. If confirmed malicious, this attack could lead to prolonged
  downtime, impacting the organization's ability to monitor and respond to security
  events.
search: '`splunkd` event_message=*error* expr=*xpointer* | stats count min(_time)
  as firstTime max(_time) as lastTime by component expr splunk_server event_message
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `splunk_dos_using_malformed_saml_request_filter`'
how_to_implement: To run this search, you must have access to the _internal index.
known_false_positives: This search will show false positives. The analyst must look
  for errors and a pointer indicating a malicious file.
references:
- https://advisory.splunk.com/advisories/SVD-2023-0802
tags:
  analytic_story:
  - Splunk Vulnerabilities
  asset_type: Endpoint
  confidence: 30
  impact: 50
  message: Possible DoS attack against Splunk Server $splunk_server$
  mitre_attack_id:
  - T1498
  observable:
  - name: splunk_server
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 15
  required_fields:
  - component
  - expr
  - host
  - event_message
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1498/splunk/splunk_dos_using_malformed_saml_request_splunkd.log
    source: splunkd.log
    sourcetype: splunkd
    custom_index: _internal
