name: Splunk User Enumeration Attempt
id: 25625cb4-1c4d-4463-b0f9-7cb462699cde
version: 1
date: '2022-04-29'
author: Lou Stella, Splunk
type: TTP
datamodel: []
description: On May 3rd, 2022, Splunk published a security advisory for  username enumeration stemming from verbose login failure messages present on some REST endpoints. This detection will alert on attempted exploitation in patched versions of Splunk as well as actual exploitation in unpatched version of Splunk.
search: ' `splunkd_failed_auths` | stats count(user) as auths by user, src | where auths>5 | stats values(user) as "Users", sum(auths) as TotalFailedAuths by src | `splunk_user_enumeration_attempt_filter`'
how_to_implement: This detection does not require you to ingest any new data. The detection does require the ability to search the _audit index. This detection may assist in efforts to find password spraying or brute force authorization attempts in addition to someone enumerating usernames. 
known_false_positives: Automation executing authentication attempts against your Splunk infrastructure with outdated credentials may cause false positives.
references:
- https://www.splunk.com/en_us/product-security/announcements/svd-2022-0502.html
tags:
  analytic_story:
  - Splunk Vulnerabilities
  asset_type: endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 80
  context:
  - Source:Endpoint
  cve: 
  - CVE-2021-33845
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1078/splunkd_auth/audittrail.log
  impact: 50
  kill_chain_phases:
  - Reconnaissance
  message: $TotalFailedAuths$ failed authentication events to Splunk from $src$ detected. 
  mitre_attack_id:
  - T1078
  nist:
  - DE.CM
  observable:
  - name: src
    type: IP Address
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - user
  - src 
  - info
  - action
  risk_score: 40
  security_domain: access
