name: Splunk Unauthenticated DoS via Null Pointer References
id: d67594fe-c317-41b8-9319-ec8428d5c2ea
version: 1
date: '2024-07-01'
author: Rod Soto
status: production
type: Hunting
data_source:
- Splunk
description: The following hunting search provides information on splunkd crash as a result of a Denial of Service Exploitation via null pointer references which targets 'services/cluster/config' endpoint.
search: '`splunk_crash_log` "Segmentation fault" "POST /services/cluster/config" 
  | stats count min(_time) as firstTime max(_time) as  lastTime by host 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | `splunk_unauthenticated_dos_via_null_pointer_references_filter`'
how_to_implement: Requires access to internal indexes. 
known_false_positives: This is a hunting search and will produce false positives. An operator needs to find proximity and detail of requests targeting cluster config endpoint and subsequent Segmentation fault in splunk crash log. 
references:
- https://advisory.splunk.com/advisories/SVD-2024-0702 
cve:
- CVE-2024-36983
tags:
  analytic_story:
  - Splunk Vulnerabilities
  asset_type: Splunk Server
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 50
  impact: 100
  kill_chain_phases:
  - Exploitation
  message: Possible exploitation attack against $host$
  mitre_attack_id:
  - T1499
  nist:
  - DE.CM
  observable:
  - name: host
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  required_fields:
  - sourcetype
  risk_score: 15
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1499/splunk/SVD-2024-0702_splunkd_crash_log_splunkd_crash_log.log
    source: /opt/splunk/var/log/splunk/crash-*.log
    sourcetype: splunkd_crash_log
    custom_index: _internal
