name: Splunk Command and Scripting Interpreter Risky Commands
id: 1cf58ae1-9177-40b8-a26c-8966040f11ae
version: 2
date: '2024-05-19'
author: Michael Haag, Splunk
status: production
type: Hunting
description: The following analytic identifies the execution of risky commands within
  the Splunk platform, such as `runshellscript`, `delete`, and `sendemail`. It leverages
  the Search_Activity data model to detect ad hoc searches containing these commands,
  excluding those run by the splunk-system-user. This activity is significant because
  it may indicate attempts at data exfiltration, deletion, or other unauthorized actions
  by a malicious user. If confirmed malicious, this could lead to data loss, unauthorized
  data transfer, or system compromise, severely impacting the organization's security
  posture.
data_source:
- Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Splunk_Audit.Search_Activity where Search_Activity.search
  IN ("*| runshellscript *", "*| collect *","*| delete *", "*| fit *", "*| outputcsv
  *", "*| outputlookup *", "*| run *", "*| script *", "*| sendalert *", "*| sendemail
  *", "*| tscolle*") Search_Activity.search_type=adhoc Search_Activity.user!=splunk-system-user
  by Search_Activity.search Search_Activity.info Search_Activity.total_run_time Search_Activity.user
  Search_Activity.search_type | `drop_dm_object_name(Search_Activity)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `splunk_command_and_scripting_interpreter_risky_commands_filter`'
how_to_implement: To successfully implement this search acceleration is recommended
  against the Search_Activity datamodel that runs against the splunk _audit index.  In
  addition, this analytic requires the Common Information Model App which includes
  the Splunk Audit Datamodel https://splunkbase.splunk.com/app/1621/. Splunk SOAR
  customers can find a SOAR workbook that walks an analyst through the process of
  running these hunting searches in the references list of this detection. In order
  to use this workbook, a user will need to run a curl command to post the file to
  their SOAR instance such as "curl -u username:password https://soar.instance.name/rest/rest/workbook_template
  -d @splunk_psa_0622.json". A user should then create an empty container or case,
  attach the workbook, and begin working through the tasks.
known_false_positives: False positives will be present until properly filtered by
  Username and search name.
references:
- https://docs.splunk.com/Documentation/Splunk/latest/Security/SPLsafeguards#Commands_that_trigger_the_warning
- https://www.github.com/splunk/security_content/blob/develop/workbooks/splunk_psa_0622.json
- https://advisory.splunk.com/advisories/SVD-2024-0302
tags:
  analytic_story:
  - Splunk Vulnerabilities
  asset_type: Web Server
  confidence: 40
  cve:
  - CVE-2022-32154
  - CVE-2024-29946
  impact: 50
  message: A risky Splunk command has ran by $user$ and should be reviewed.
  mitre_attack_id:
  - T1059
  observable:
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Search_Activity.search
  - Search_Activity.info
  - Search_Activity.total_run_time
  - Search_Activity.user
  - Search_Activity.savedsearch_name
  - Search_Activity.search_type
  risk_score: 20
  security_domain: audit
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1213/audittrail/audittrail.log
    source: audittrail
    sourcetype: audittrail
    update_timestamp: true
    custom_index: _audit
