name: Splunk XSS in Highlighted JSON Events
id: 1030bc63-0b37-4ac9-9ae0-9361c955a3cc
version: 3
date: '2024-07-01'
author: Rod Soto, Splunk
status: production
type: Hunting
data_source:
- Splunk
description: The following analytic identifies potential exploitation of a Cross-Site
  Scripting (XSS) vulnerability in Splunk Enterprise 9.1.2. It detects suspicious
  requests to the Splunk web GUI that may execute JavaScript within script tags. This
  detection leverages logs from the `splunkd_ui` data source, focusing on specific
  URI paths and HTTP methods. This activity is significant as it can allow attackers
  to execute arbitrary JavaScript, potentially accessing the API with the logged-in
  user's permissions. If the user is an admin, the attacker could create an admin
  account, leading to full control over the Splunk environment.
search: '`splunkd_ui` "/*/splunkd/__raw/servicesNS/nobody/search/authentication/users"
  status=201 | stats count min(_time) as firstTime max(_time) as lastTime by clientip,
  uri_path, method | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `splunk_xss_in_highlighted_json_events_filter`'
how_to_implement: This search only applies to web-GUI-enabled Splunk instances and
  operator must have access to internal indexes.
known_false_positives: This is a hunting search and will produce false positives as
  it is not possible to view contents of a request payload. It shows the artifact
  resulting from a potential exploitation payload (the creation of a user with admin
  privileges).
references:
- https://advisory.splunk.com/advisories/SVD-2023-1103
cve:
- CVE-2023-46213
tags:
  analytic_story:
  - Splunk Vulnerabilities
  asset_type: Endpoint
  confidence: 50
  impact: 30
  message: Possible XSS exploitation from $clientip$
  mitre_attack_id:
  - T1189
  observable:
  - name: clientip
    type: IP Address
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 15
  required_fields:
  - clientip
  - uri_path
  - method
  - status
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1189/splunk/splunk_xss_in_highlighted_json_events_splunkd_ui_access.log
    source: splunkd_ui_access.log
    sourcetype: splunkd_ui_access
    custom_index: _internal
