name: Splunk Information Disclosure on Account Login
id: 2bae5d19-6d1b-4db0-82ab-0af5ac5f836c
version: 1
date: '2024-07-01'
author: Rod Soto
status: production
type: Hunting
data_source:
- Splunk
description: This is a composed hunting search that looks for possible user enumeration attempts when SAML is enabled on a Splunk instance by capturing different responses from server. 
search: '`splunkd` component=UiAuth status=failure action=login TcpChannelThread 
  | stats count min(_time) as firstTime max(_time) as lastTime by user status action clientip 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | `splunk_information_disclosure_on_account_login_filter`'
how_to_implement: Requires access to internal indexes _internal.
known_false_positives: This is a hunting search and requires operator to search for large number of login failures from several users indicating possible user enumeration attempts. May capture genuine login failures. 
references:
- https://advisory.splunk.com/SVD-2024-0716
cve:
- CVE-2024-36996
tags:
  analytic_story:
  - Splunk Vulnerabilities
  asset_type: Splunk Server
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 50
  impact: 10
  kill_chain_phases:
  - Exploitation
  message: Possible user enumeration attack against $clientip$
  mitre_attack_id:
  - T1087
  nist:
  - DE.CM
  observable:
  - name: clientip
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  required_fields:
  - user
  - action
  - status 
  - clientip 
  - host 
  risk_score: 5
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1087/splunk/SVD-2024-0716_splunkd_splunkd.log
    source: /opt/splunk/var/log/splunk/splunkd.log
    sourcetype: splunkd
    custom_index: _internal 