name: Splunk Reflected XSS in the templates lists radio
id: d532d105-c63f-4049-a8c4-e249127ca425
version: 1
date: '2022-10-11'
author: Rod Soto, Chase Franklin
type: Hunting
datamodel: []
description: Splunk versions below 8.1.12,8.2.9 and 9.0.2 are vulnerable to reflected cross site scripting (XSS). A View allows for a Reflected Cross Site scripting via JavaScript Object Notation (JSON) in a query parameter when ouput_mode=radio. 
search: '`splunkd_webx` user=admin status=200 uri=*/lists/entities/x/ui/views* uri_query!=null | stats count earliest(_time) as event_time values(status) as status values(clientip) as clientip by index, sourcetype, _time, host, user, uri | `splunk_reflected_xss_in_the_templates_lists_radio_filter`'
how_to_implement: This vulnerability only affects instances with Splunk Web enabled. This detection does not require you to ingest any new data. The detection does require the ability to search the _internal index.
known_false_positives: This search may produce false positives as it is difficult to pinpoint all possible XSS injection characters in a single search string. Special attention is required to "en-US/list/entities/x/ui/views" which is the vulnerable injection point. 
references:
- https://research.splunk.com/stories/splunk_vulnerabilities/ 
tags:
  analytic_story:
  - Splunk Vulnerabilities 
  asset_type: Endpoint 
  cve: 
  - CVE-2022-43568
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 50
  context:
  - Source:Endpoint 
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1189/splunk/splunk_reflected_xss_in_templates_lists_radio.txt
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: Potential XSS exploitation against radio template by $user$
  mitre_attack_id:
  - T1189
  nist:
  - DE.CM
  observable:
  - name: user
    type: User
    role:
    - Attacker 
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - host
  - clientip 
  - status 
  - user 
  - uri 
  - uri_query 
  - uri_path 
  risk_score: 25
  security_domain: endpoint
