name: Splunk Unauthorized Experimental Items Creation
id: 84afda04-0cd6-466b-869e-70d6407d0a34
version: 1
date: '2024-07-01'
author: Rod Soto, Chase Franklin
status: production
type: Hunting
data_source:
- Splunk
description: This hunting search provides information on finding possible creation of unauthorized items against /experimental endpoint.
search: '`splunkda` */experimental/* method=POST
  | stats count min(_time) as firstTime max(_time) as lastTime by clientip method uri_path uri status 
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `splunk_unauthorized_experimental_items_creation_filter`'
how_to_implement: Requires access to internal indexes. 
known_false_positives: Not all requests are going to be malicious, there will be false positives, however operator must find suspicious items that might have been created by an unauthorized user. 
references:
- https://advisory.splunk.com/SVD-2024-0715
cve:
- CVE-2024-36995
tags:
  analytic_story:
  - Splunk Vulnerabilities
  asset_type: Splunk Server
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 100
  impact: 5
  kill_chain_phases:
  - Exploitation
  message: Possible unauthorized creation of experimental items from $clientip$
  mitre_attack_id:
  - T1189
  nist:
  - DE.CM
  observable:
  - name: clientip
    type: IP Address
    role:
    - Attacker
  product:
  - Splunk Enterprise
  required_fields:
  - clientip
  - method
  - uri_path
  - uri 
  - status
  risk_score: 5
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1189/splunk/SVD-2024-0715_splunkd_splunkd_access.log
    source: /opt/splunk/var/log/splunk/splunkd_access.log
    sourcetype: splunkd_access
    custom_index: _internal