name: Splunk Improperly Formatted Parameter Crashes splunkd
id: 08978eca-caff-44c1-84dc-53f17def4e14
version: 1
date: "2023-02-14"
author: Chase Franklin, Rod Soto, Splunk
type: TTP
datamodel:
  - Endpoint
description: In Splunk Enterprise versions below 8.1.13, 8.2.10, and 9.0.4, when the INGEST\\_EVAL parameter is improperly formatted, it crashes splunkd. This hunting search provides the user, timing and number of times the crashing command was executed.
search:
  '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Splunk_Audit.Search_Activity where (Search_Activity.search="*makeresults*"
  AND Search_Activity.search="*ingestpreview*transforms*") Search_Activity.search_type=adhoc
  Search_Activity.user!=splunk-system-user by Search_Activity.search Search_Activity.info
  Search_Activity.total_run_time Search_Activity.user Search_Activity.search_type
  | `drop_dm_object_name(Search_Activity)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `splunk_improperly_formatted_parameter_crashes_splunkd_filter`'
how_to_implement: Requires access to audittrail and use of Splunk_Audit.Search_Activity datamodel.
known_false_positives: This is a hunting search it should be focused on affected products, otherwise it is likely to produce false positives.
references:
  - https://www.splunk.com/en_us/product-security.html
tags:
  analytic_story:
    - Splunk Vulnerabilities
  asset_type: Endpoint
  cve:
    - CVE-2023-22941
  cis20:
    - CIS 3
    - CIS 5
    - CIS 16
  confidence: 100
  context:
    - Source:Endpoint
  dataset:
    - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1499/splunk_improperly_formatted_ingest_eval_parameter_crashes_splunkd_data.log
  impact: 100
  kill_chain_phases:
    - Exploitation
  message: An attempt to exploit ingest eval parameter was detected from $user$
  mitre_attack_id:
    - T1499
  nist:
    - DE.CM
  observable:
    - name: user
      type: User
      role:
        - Attacker
  product:
    - Splunk Enterprise
  required_fields:
    - user
    - count
    - info
  risk_score: 100
  security_domain: threat
