name: Suspicious Email Attachment Extensions
id: 473bd65f-06ca-4dfe-a2b8-ba04ab4a0084
version: 3
date: '2023-04-14'
author: David Dorsey, Splunk
status: experimental
type: Anomaly
description: |-
  The following analytic detects emails that contain attachments with suspicious file extensions. Detecting and responding to emails with suspicious attachments can mitigate the risks associated with phishing and malware attacks, thereby protecting the organization's data and systems from potential harm. The detection is made by using a Splunk query that searches for emails in the datamodel=Email where the filename of the attachment is not empty. The analytic uses the tstats command to summarize the count, first time, and last time of the emails that meet the criteria. It groups the results by the source user, file name, and message ID of the email. The detection is important because it indicates potential phishing or malware delivery attempts in which an attacker attempts to deliver malicious content through email attachments, which can lead to data breaches, malware infections, or unauthorized access to sensitive information. Next steps include reviewing the identified emails and attachments and analyzing the source user, file name, and message ID to determine if they are legitimate or malicious. Additionally, you must inspect any relevant on-disk artifacts associated with the attachments and investigate any concurrent processes to identify the source of the attack.
data_source: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Email where All_Email.file_name="*" by All_Email.src_user,
  All_Email.file_name All_Email.message_id | `security_content_ctime(firstTime)` |
  `security_content_ctime(lastTime)` | `drop_dm_object_name("All_Email")` | `suspicious_email_attachments`
  | `suspicious_email_attachment_extensions_filter` '
how_to_implement: "You need to ingest data from emails. Specifically, the sender's\
  \ address and the file names of any attachments must be mapped to the Email data\
  \ model. \\\n **Splunk Phantom Playbook Integration**\\\nIf Splunk Phantom is also\
  \ configured in your environment, a Playbook called \"Suspicious Email Attachment\
  \ Investigate and Delete\" can be configured to run when any results are found by\
  \ this detection search. To use this integration, install the Phantom App for Splunk\
  \ `https://splunkbase.splunk.com/app/3411/`, and add the correct hostname to the\
  \ \"Phantom Instance\" field in the Adaptive Response Actions when configuring this\
  \ detection search. The notable event will be sent to Phantom and the playbook will\
  \ gather further information about the file attachment and its network behaviors.\
  \ If Phantom finds malicious behavior and an analyst approves of the results, the\
  \ email will be deleted from the user's inbox."
known_false_positives: None identified
references: []
tags:
  analytic_story:
  - Data Destruction
  - 'Emotet Malware  DHS Report TA18-201A '
  - Hermetic Wiper
  - Suspicious Emails
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1566.001
  - T1566
  observable:
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Email.file_name
  - All_Email.src_user
  - All_Email.message_id
  risk_score: 25
  security_domain: network
