name: Web Servers Executing Suspicious Processes
id: ec3b7601-689a-4463-94e0-c9f45638efb9
version: 1
date: '2019-04-01'
author: David Dorsey, Splunk
status: experimental
type: TTP
description: This search looks for suspicious processes on all systems labeled as
  web servers.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.dest_category="web_server"
  AND (Processes.process="*whoami*" OR Processes.process="*ping*" OR Processes.process="*iptables*"
  OR Processes.process="*wget*" OR Processes.process="*service*" OR Processes.process="*curl*")
  by Processes.process Processes.process_name, Processes.dest Processes.user| `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `web_servers_executing_suspicious_processes_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Some of these processes may be used legitimately on web servers
  during maintenance or other administrative tasks.
references: []
tags:
  analytic_story:
  - Apache Struts Vulnerability
  asset_type: Web Server
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1082
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest_category
  - Processes.process
  - Processes.process_name
  - Processes.dest
  - Processes.user
  risk_score: 25
  security_domain: endpoint
