name: 7zip CommandLine To SMB Share Path
id: 01d29b48-ff6f-11eb-b81e-acde48001123
version: 1
date: '2021-08-17'
author: Teoderick Contreras, Splunk
status: production
type: Hunting
description: This search is to detect a suspicious 7z process with commandline pointing
  to SMB network share. This technique was seen in CONTI LEAK tools where it use 7z
  to archive a sensitive files and place it in network share tmp folder. This search
  is a good hunting query that may give analyst a hint why specific user try to archive
  a file pointing to SMB user which is un usual.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name ="7z.exe"
  OR Processes.process_name = "7za.exe" OR Processes.original_file_name = "7z.exe"
  OR Processes.original_file_name =  "7za.exe") AND (Processes.process="*\\C$\\*"
  OR Processes.process="*\\Admin$\\*" OR Processes.process="*\\IPC$\\*") by Processes.original_file_name
  Processes.parent_process_name Processes.parent_process Processes.process_name Processes.process
  Processes.parent_process_id Processes.process_id  Processes.dest Processes.user
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `7zip_commandline_to_smb_share_path_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: unknown
references:
- https://threadreaderapp.com/thread/1423361119926816776.html
tags:
  analytic_story:
  - Ransomware
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: archive process $process_name$ with suspicious cmdline $process$ in host
    $dest$
  mitre_attack_id:
  - T1560.001
  - T1560
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 25
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/conti/conti_leak/windows-sysmon_7z.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
