name: Account Discovery With Net App
id: 339805ce-ac30-11eb-b87d-acde48001122
version: 3
date: '2021-09-16'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: this search is to detect a potential account discovery series of command
  used by several malware or attack to recon the target machine. This technique is
  also seen in some note worthy malware like trickbot where it runs a cmd process,
  or even drop its module that will execute the said series of net command. This series
  of command are good correlation search and indicator of attacker recon if seen in
  the machines within a none technical user or department (HR, finance, ceo and etc)
  network.
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  values(Processes.parent_process) as parent_process values(Processes.process_id)
  as process_id count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where `process_net` AND (Processes.process="*user*" OR  Processes.process="*config*"
  OR Processes.process="*view /all*") by  Processes.process_name Processes.dest Processes.user
  Processes.parent_process_name | where count >=5 | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `account_discovery_with_net_app_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product..
known_false_positives: admin or power user may used this series of command.
references:
- https://labs.vipre.com/trickbot-and-its-modules/
- https://blog.whitehat.eu/2019/05/incident-trickbot-ryuk-2.html
- https://app.any.run/tasks/48414a33-3d66-4a46-afe5-c2003bb55ccf/
tags:
  analytic_story:
  - Trickbot
  - IcedID
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Discovery
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/trickbot/infection/windows-sysmon.log
  impact: 10
  kill_chain_phases:
  - Reconnaissance
  message: Suspicious $process_name$ usage detected on endpoint $dest$ by user $user$.
  mitre_attack_id:
  - T1087.002
  - T1087
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: process_name
    type: Process Name
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 5
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
