name: Active Directory Lateral Movement Identified
id: 6aa6f9dd-adfe-45a8-8f74-c4c7a0d7d037
version: 3
date: '2024-05-20'
author: Michael Haag, Splunk
status: production
type: Correlation
data_source: []
description: The following analytic identifies potential lateral movement activities
  within an organization's Active Directory (AD) environment. It detects this activity
  by correlating multiple analytics from the Active Directory Lateral Movement analytic
  story within a specified time frame. This is significant for a SOC as lateral movement
  is a common tactic used by attackers to expand their access within a network, posing
  a substantial risk. If confirmed malicious, this activity could allow attackers
  to escalate privileges, access sensitive information, and persist within the environment,
  leading to severe security breaches.
search: '| tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
  as lastTime sum(All_Risk.calculated_risk_score) as risk_score, count(All_Risk.calculated_risk_score)
  as risk_event_count, values(All_Risk.annotations.mitre_attack.mitre_tactic_id) as
  annotations.mitre_attack.mitre_tactic_id, dc(All_Risk.annotations.mitre_attack.mitre_tactic_id)
  as mitre_tactic_id_count, values(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as annotations.mitre_attack.mitre_technique_id, dc(All_Risk.annotations.mitre_attack.mitre_technique_id)
  as mitre_technique_id_count, values(All_Risk.tag) as tag, values(source) as source,
  dc(source) as source_count from datamodel=Risk.All_Risk where All_Risk.analyticstories="Active
  Directory Lateral Movement" All_Risk.risk_object_type="system" by All_Risk.risk_object
  All_Risk.risk_object_type All_Risk.annotations.mitre_attack.mitre_tactic | `drop_dm_object_name(All_Risk)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | where
  source_count >= 4 | `active_directory_lateral_movement_identified_filter`'
how_to_implement: Splunk Enterprise Security is required to utilize this correlation.
  In addition, modify the source_count value to your environment. In our testing,
  a count of 4 or 5 was decent in a lab, but the number may need to be increased as
  the analytic story includes over 30 analytics. In addition, based on false positives,
  modify any analytics to be anomaly and lower or increase risk based on organization
  importance.
known_false_positives: False positives will most likely be present based on risk scoring
  and how the organization handles system to system communication. Filter, or modify
  as needed. In addition to count by analytics, adding a risk score may be useful.
  In our testing, with 22 events over 30 days, the risk scores ranged from 500 to
  80,000. Your organization will be different, monitor and modify as needed.
references:
- https://attack.mitre.org/tactics/TA0008/
- https://research.splunk.com/stories/active_directory_lateral_movement/
tags:
  analytic_story:
  - Active Directory Lateral Movement
  asset_type: Endpoint
  atomic_guid: []
  confidence: 80
  impact: 80
  message: Activity related to lateral movement has been identified on $risk_object$.
  mitre_attack_id:
  - T1210
  observable:
  - name: risk_object
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - All_Risk.calculated_risk_score
  - All_Risk.annotations.mitre_attack.mitre_tactic_id
  - All_Risk.annotations.mitre_attack.mitre_technique_id
  - All_Risk.tag
  - All_Risk.analyticstories
  - All_Risk.risk_object_type
  - All_Risk.risk_object
  - All_Risk.annotations.mitre_attack.mitre_tactic
  risk_score: 64
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218/living_off_the_land/adlm_risk.log
    source: adlm
    sourcetype: stash
