name: Add DefaultUser And Password In Registry
id: d4a3eb62-0f1e-11ec-a971-acde48001122
version: 2
date: '2022-01-26'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: this search is to detect a suspicious registry modification to implement
  auto admin logon to a host. This technique was seen in BlackMatter ransomware to
  automatically logon to the compromise host after  triggering a safemode boot to
  continue encrypting the whole network. This behavior is not a common practice and
  really a suspicious TTP or alert need to be consider if found within then network
  premise.
search: '| tstats `security_content_summariesonly` count from datamodel=Endpoint.Registry
  where Registry.registry_path= "*SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon*"
  AND Registry.registry_value_name= DefaultPassword OR Registry.registry_value_name=
  DefaultUserName by _time span=1h Registry.dest Registry.user Registry.registry_path
  Registry.registry_value_name Registry.process_guid Registry.registry_value_data
  Registry.registry_key_name | `drop_dm_object_name(Registry)` |rename process_guid
  as proc_guid |join proc_guid, _time [| tstats `security_content_summariesonly` count
  FROM datamodel=Endpoint.Processes by _time span=1h Processes.process_id Processes.process_name
  Processes.process Processes.dest Processes.parent_process_name Processes.parent_process
  Processes.process_guid | `drop_dm_object_name(Processes)` |rename process_guid as
  proc_guid | fields _time dest user parent_process_name parent_process process_name
  process_path process proc_guid registry_path registry_value_name registry_value_data
  registry_key_name] | table _time dest user parent_process_name parent_process process_name
  process_path process proc_guid registry_path registry_value_name registry_value_data
  registry_key_name | `add_defaultuser_and_password_in_registry_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node. Also make sure
  that this registry was included in your config files ex. sysmon config to be monitored.
known_false_positives: unknown
references:
- https://news.sophos.com/en-us/2021/08/09/blackmatter-ransomware-emerges-from-the-shadow-of-darkside/
tags:
  analytic_story:
  - BlackMatter Ransomware
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Credential Access
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1552.002/autoadminlogon/windows-sysmon.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: modified registry key $registry_key_name$ with registry value $registry_value_name$
    to prepare autoadminlogon
  mitre_attack_id:
  - T1552.002
  - T1552
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.registry_value_name
  - Registry.dest
  risk_score: 25
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
