name: Add DefaultUser And Password In Registry
id: d4a3eb62-0f1e-11ec-a971-acde48001122
version: 1
date: '2021-09-06'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: this search is to detect a suspicious registry modification to implement
  auto admin logon to a host. This technique was seen in BlackMatter ransomware to
  automatically logon to the compromise host after  triggering a safemode boot to
  continue encrypting the whole network. This behavior is not a common practice and
  really a suspicious TTP or alert need to be consider if found within then network
  premise.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Registry where Registry.registry_path= "*SOFTWARE\\Microsoft\\Windows
  NT\\CurrentVersion\\Winlogon*" AND Registry.registry_value_name= DefaultPassword
  OR Registry.registry_value_name= DefaultUserName by Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.dest | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)`
  |`security_content_ctime(lastTime)` | `add_defaultuser_and_password_in_registry_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node. Also make sure
  that this registry was included in your config files ex. sysmon config to be monitored.
known_false_positives: unknown
references:
- https://news.sophos.com/en-us/2021/08/09/blackmatter-ransomware-emerges-from-the-shadow-of-darkside/
tags:
  analytic_story:
  - BlackMatter Ransomware
  automated_detection_testing: passed
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Credential Access
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1552.002/autoadminlogon/windows-sysmon.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: modified registry key $registry_key_name$ with registry value $registry_value_name$
    to prepare autoadminlogon
  mitre_attack_id:
  - T1552.002
  - T1552
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.registry_value_name
  - Registry.dest
  risk_score: 25
  security_domain: endpoint
  cim_version: 5.0.0
  tas_with_cim_mapping:
  - Splunk_TA_bit9-carbonblack
