name: Allow Operation with Consent Admin
id: 7de17d7a-c9d8-11eb-a812-acde48001122
version: 2
date: '2022-01-26'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This analytic identifies a potential privilege escalation attempt to
  perform malicious task. This registry modification is designed to allow the `Consent
  Admin` to perform an operation that requires elevation without consent or credentials.
  We also found this in some attacker to gain privilege escalation to the compromise
  machine.
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  where Registry.registry_path= "*\\Microsoft\\Windows\\CurrentVersion\\Policies\\System*"
  Registry.registry_value_name = ConsentPromptBehaviorAdmin Registry.registry_value_data
  = "0x00000000" by _time span=1h Registry.dest Registry.user Registry.registry_path
  Registry.registry_value_name Registry.process_guid Registry.registry_key_name Registry.registry_value_data
  | `drop_dm_object_name(Registry)` |rename process_guid as proc_guid |join proc_guid,
  _time [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  by _time span=1h Processes.process_id Processes.process_name Processes.process Processes.dest
  Processes.parent_process_name Processes.parent_process Processes.process_guid |
  `drop_dm_object_name(Processes)` |rename process_guid as proc_guid | fields _time
  dest user parent_process_name parent_process process_name process_path process proc_guid
  registry_path registry_value_name registry_value_data registry_key_name] | table
  _time dest user parent_process_name parent_process process_name process_path process
  proc_guid registry_path registry_value_name registry_value_data registry_key_name
  | `allow_operation_with_consent_admin_filter`'
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
known_false_positives: unknown
references:
- https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-gpsb/341747f5-6b5d-4d30-85fc-fa1cc04038d4
- https://www.trendmicro.com/vinfo/no/threat-encyclopedia/malware/Ransom.Win32.MRDEC.MRA/
tags:
  analytic_story:
  - Ransomware
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/ransomware_ttp/data1/windows-sysmon.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: Suspicious registry modification was performed on endpoint $dest$ by user
    $user$. This behavior is indicative of privilege escalation.
  mitre_attack_id:
  - T1548
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.registry_value_name
  - Registry.dest
  risk_score: 25
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
