author: Teoderick Contreras, Splunk
datamodel:
- Endpoint
date: '2021-06-10'
description: This analytic identifies a potential privilege escalation attempt to
  perform malicious task. This registry modification is designed to allow the `Consent
  Admin` to perform an operation that requires elevation without consent or credentials.
  We also found this in some attacker to gain privilege escalation to the compromise
  machine.
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
id: 7de17d7a-c9d8-11eb-a812-acde48001122
known_false_positives: unknown
name: Allow Operation with Consent Admin
references:
- https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-gpsb/341747f5-6b5d-4d30-85fc-fa1cc04038d4
- https://www.trendmicro.com/vinfo/no/threat-encyclopedia/malware/Ransom.Win32.MRDEC.MRA/
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\Microsoft\\Windows\\CurrentVersion\\Policies\\System*"
  Registry.registry_value_name = ConsentPromptBehaviorAdmin Registry.registry_value_data
  = "0x00000000" by Registry.registry_path Registry.registry_key_name Registry.registry_value_data
  Registry.dest | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)`
  |`security_content_ctime(lastTime)` | `allow_operation_with_consent_admin_filter`'
tags:
  analytic_story:
  - Ransomware
  automated_detection_testing: passed
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/ransomware_ttp/data1/windows-sysmon.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: Suspicious registry modification was performed on endpoint $dest$ by user
    $user$. This behavior is indicative of privilege escalation.
  mitre_attack_id:
  - T1548
  observable:
  - name: user
    role:
    - Victim
    type: User
  - name: dest
    role:
    - Victim
    type: Hostname
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Registry.dest
  - Endpoint.Registry.registry_key_name
  - Endpoint.Registry.registry_path
  - Endpoint.Registry.registry_value_data
  - Endpoint.Registry.registry_value_name
  - _time
  risk_score: 25
  security_domain: endpoint
type: TTP
version: 1
