name: Allow Inbound Traffic In Firewall Rule
id: a5d85486-b89c-11eb-8267-acde48001122
version: 1
date: '2021-05-19'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: The following analytic identifies suspicious PowerShell command to allow
  inbound traffic inbound to a specific local port within the public profile. This
  technique was seen in some attacker want to have a remote access to a machine by
  allowing the traffic in firewall rule.
search: '`powershell` EventCode=4104 Message = "*firewall*" Message = "*Public*" Message
  = "*Inbound*" Message = "*Allow*"  Message = "*-LocalPort*" | stats count min(_time)
  as firstTime max(_time) as lastTime by EventCode Message ComputerName User | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `allow_inbound_traffic_in_firewall_rule_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the powershell logs  from your endpoints. make sure you enable needed
  registry to monitor this event.
known_false_positives: administrator may allow inbound traffic in certain network
  or machine.
references:
- https://docs.microsoft.com/en-us/powershell/module/netsecurity/new-netfirewallrule?view=windowsserver2019-ps
tags:
  analytic_story:
  - Prohibited Traffic Allowed or Protocol Mismatch
  automated_detection_testing: passed
  confidence: 30
  context:
  - Source:Endpoint
  - Stage:Lateral Movement
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/honeypots/casper/datasets1/windows-powershell.log
  impact: 10
  kill_chain_phases:
  - Exploitation
  message: Suspicious firewall modification detected on endpoint $ComputerName$ by
    user $user$.
  mitre_attack_id:
  - T1021.001
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: ComputerName
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - Message
  - ComputerName
  - User
  risk_score: 3
  security_domain: endpoint
