name: Attempt To Stop Security Service
id: c8e349c6-b97c-486e-8949-bd7bcd1f3910
version: 4
date: '2020-07-21'
author: Rico Valdez, Splunk
type: TTP
datamodel:
- Endpoint
description: This search looks for attempts to stop security-related services on the
  endpoint.
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where `process_net` OR  Processes.process_name = sc.exe Processes.process="* stop
  *" by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.original_file_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  |lookup security_services_lookup service as process OUTPUTNEW category, description
  | search category=security | `attempt_to_stop_security_service_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: None identified. Attempts to disable security-related services
  should be identified and understood.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md#atomic-test-14---disable-arbitrary-security-windows-service
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
  analytic_story:
  - Disabling Security Tools
  - Trickbot
  - WhisperGate
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 8
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.001/win_defend_service_stop/windows-sysmon.log
  impact: 40
  kill_chain_phases:
  - Installation
  - Actions on Objectives
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    attempting to disable security services on endpoint $dest$ by user $user$.
  mitre_attack_id:
  - T1562.001
  - T1562
  nist:
  - PR.PT
  - DE.CM
  - PR.IP
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 20
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
