name: Attempt To Add Certificate To Untrusted Store
id: 6bc5243e-ef36-45dc-9b12-f4a6be131159
version: 6
date: '2020-11-03'
description: Attempt to add a certificate to the certificate store
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
type: batch
references: []
author: Patrick Bareiss, Rico Valdez, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime values(Processes.process)
  as process max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=*certutil*
  (Processes.process=*-addstore*) by Processes.parent_process Processes.process_name
  Processes.user | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`
  |`security_content_ctime(lastTime)` | `attempt_to_add_certificate_to_untrusted_store_filter`'
known_false_positives: There may be legitimate reasons for administrators to add a
  certificate to the untrusted certificate store. In such cases, this will typically
  be done on a large number of systems.
tags:
  analytics_story:
  - Disabling Security Tools
  mitre_attack_id:
  - T1553.004
  kill_chain_phases:
  - Installation
  - Actions on Objectives
  cis20:
  - CIS 3
  - CIS 5
  - CIS 8
  nist:
  - PR.PT
  - DE.CM
  - PR.IP
  security_domain: endpoint
  asset_type: Endpoint
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1553.004/atomic_red_team/windows-sysmon.log
