name: Batch File Write to System32
id: 503d17cb-9eab-4cf8-a20e-01d5c6987ae3
version: 5
date: '2024-05-19'
author: Steven Dick, Michael Haag, Rico Valdez, Splunk
status: production
type: TTP
description: The following analytic detects the creation of a batch file (.bat) within
  the Windows system directory tree, specifically in the System32 or SysWOW64 folders.
  It leverages data from the Endpoint datamodel, focusing on process and filesystem
  events to identify this behavior. This activity is significant because writing batch
  files to system directories can be indicative of malicious intent, such as persistence
  mechanisms or system manipulation. If confirmed malicious, this could allow an attacker
  to execute arbitrary commands with elevated privileges, potentially compromising
  the entire system.
data_source:
- Sysmon EventID 1 AND Sysmon EventID 11
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where Processes.process_name=* by _time span=1h Processes.process_guid Processes.process_name
  Processes.dest Processes.user | `drop_dm_object_name(Processes)` | join process_guid
  [| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_path IN ("*\\system32\\*",
  "*\\syswow64\\*") Filesystem.file_name="*.bat" by _time span=1h Filesystem.dest
  Filesystem.file_create_time Filesystem.file_name Filesystem.file_path Filesystem.process_guid
  | `drop_dm_object_name(Filesystem)`] | table dest user file_create_time, file_name,
  file_path, process_name, firstTime, lastTime | dedup file_create_time | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `batch_file_write_to_system32_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: It is possible for this search to generate a notable event
  for a batch file write to a path that includes the string "system32", but is not
  the actual Windows system directory. As such, you should confirm the path of the
  batch file identified by the search. In addition, a false positive may be generated
  by an administrator copying a legitimate batch file in this directory tree. You
  should confirm that the activity is legitimate and modify the search to add exclusions,
  as necessary.
references: []
tags:
  analytic_story:
  - SamSam Ransomware
  asset_type: Endpoint
  confidence: 90
  impact: 70
  message: A file - $file_name$ was written to system32 has occurred on endpoint $dest$
    by user $user$.
  mitre_attack_id:
  - T1204
  - T1204.002
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: file_name
    type: File Name
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Filesystem.dest
  - Filesystem.file_create_time
  - Filesystem.file_name
  - Filesystem.user
  - Filesystem.file_path
  - Processes.process_name
  - Processes.dest
  - Filesystem.process_guid
  - Processes.process_guid
  - Processes.dest
  - Processes.process_name
  risk_score: 63
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1204.002/batch_file_in_system32/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
