name: Bcdedit Command Back To Normal Mode Boot
id: dc7a8004-0f18-11ec-8c54-acde48001122
version: 1
date: '2021-09-06'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This search is to detect a suspicious bcdedit commandline to configure
  the host from safe mode back to normal boot configuration. This technique was seen
  in blackMatter ransomware where it force the compromised host to boot in safe mode
  to continue its encryption and bring back to normal boot using bcdedit deletevalue
  command. This TTP can be a good alert for host that booted from safe mode forcefully
  since it need to modify the boot configuration to bring it back to normal.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name = bcdedit.exe
  Processes.process="*/deletevalue*" Processes.process="*{current}*"  Processes.process="*safeboot*"
  by Processes.process_name Processes.process Processes.parent_process_name Processes.dest
  Processes.user |`drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `bcdedit_command_back_to_normal_mode_boot_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. Tune and filter known instances where renamed rundll32.exe may be used.
known_false_positives: unknown
references:
- https://news.sophos.com/en-us/2021/08/09/blackmatter-ransomware-emerges-from-the-shadow-of-darkside/
tags:
  analytic_story:
  - BlackMatter Ransomware
  confidence: 70
  context:
  - Source:Endpoint
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1552.002/autoadminlogon/windows-sysmon.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: bcdedit process with commandline $process$ to bring back to normal boot
    configuration the $dest$
  mitre_attack_id:
  - T1490
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_name
  - Processes.process
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.dest
  - Processes.user
  risk_score: 35
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
