name: BITSAdmin Download File
id: 80630ff4-8e4c-11eb-aab5-acde48001122
version: 1
date: '2021-03-26'
author: Michael Haag, Splunk
type: batch
datamodel:
- Endpoint
description: The following query identifies Microsoft Background Intelligent Transfer
  Service utility `bitsadmin.exe` using the `transfer` parameter to download a remote
  object. In addition, look for `download` or `upload` on the command-line, the switches
  are not required to perform a transfer. Capture any files downloaded. Review the
  reputation of the IP or domain used. Typically once executed, a follow on command
  will be used to execute the dropped file. Note that the network connection or file
  modification events related will not spawn or create from `bitsadmin.exe`, but the
  artifacts will appear in a parallel process of `svchost.exe` with a command-line
  similar to `svchost.exe -k netsvcs -s BITS`. It's important to review all parallel
  and child processes to capture any behaviors and artifacts. In some suspicious and
  malicious instances, BITS jobs will be created. You can use `bitsadmin /list /verbose`
  to list out the jobs during investigation.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=bitsadmin.exe
  Processes.process=*transfer* by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `bitsadmin_download_file_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Limited false positives, however it may be required to filter
  based on parent process name or network connection.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/8eb52117b748d378325f7719554a896e37bccec7/atomics/T1105/T1105.md#atomic-test-9---windows---bitsadmin-bits-download
- https://github.com/redcanaryco/atomic-red-team/blob/bc705cb7aaa5f26f2d96585fac8e4c7052df0ff9/atomics/T1197/T1197.md
- https://docs.microsoft.com/en-us/windows/win32/bits/bitsadmin-tool
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
tags:
  analytic_story:
  - Ingress Tool Transfer
  - BITS Jobs
  - DarkSide Ransomware
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1197/atomic_red_team/windows-sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1197
  - T1105
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name #parent process name
  - Processes.parent_process #parent cmdline
  - Processes.original_file_name
  - Processes.process_name #process name
  - Processes.process #process cmdline
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  security_domain: endpoint
  impact: 70
  confidence: 70
  # (impact * confidence)/100
  risk_score: 49
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  message: An instance of $parent_process_name$ spawning $process_name$ was identified on endpoint $dest$ by user $user$ attempting to download a file.
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Parent Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process