author: Rod Soto, Splunk
datamodel:
- Endpoint.Processes
date: '2021-01-26'
description: This search looks for arguments to certutil.exe indicating the manipulation
  or extraction of Certificate. This certificate can then be used to sign new authentication
  tokens specially inside Federated environments such as Windows ADFS.
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
id: 337a46be-600f-11eb-ae93-0242ac130002
known_false_positives: Unless there are specific use cases, manipulating or exporting
  certificates using certutil is uncommon. Extraction of certificate has been observed
  during attacks such as Golden SAML and other campaigns targeting Federated services.
name: Certutil exe certificate extraction
references: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=certutil.exe
  Processes.process = "*-exportPFX*" by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `certutil_exe_certificate_extraction_filter`'
tags:
  analytic_story:
  - Windows Persistence Techniques
  - Cloud Federated Credential Abuse
  asset_type: Endpoint
  automated_detection_testing: passed
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/suspicious_behaviour/certutil_exe_certificate_extraction/windows-sysmon.log
  impact: 90
  kill_chain_phases:
  - Installation
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ attempting export a certificate.
  observable:
  - name: user
    role:
    - Victim
    type: User
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: parent_process_name
    role:
    - Parent Process
    type: Parent Process
  - name: process_name
    role:
    - Child Process
    type: Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process
  - Endpoint.Processes.parent_process_id
  - Endpoint.Processes.process
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 63
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
type: TTP
version: 1
