name: Clop Ransomware Known Service Name
id: 07e08a12-870c-11eb-b5f9-acde48001122
version: 1
date: '2021-03-17'
author: Teoderick Contreras
type: batch
datamodel:
- Endpoint
description: This detection is to identify the common service name created by the
  CLOP ransomware as part of its persistence and high privilege code execution in
  the infected machine. Ussually CLOP ransomware use StartServiceCtrlDispatcherW API
  in creating this service entry.
search: '`wineventlog_system` EventCode=7045 Service_Name IN ("SecurityCenterIBM",
  "WinCheckDRVs") | stats count min(_time) as firstTime max(_time) as lastTime by
  EventCode Service_File_Name Service_Name Service_Start_Type Service_Type | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `clop_ransomware_known_service_name_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the Service name, Service File Name Service Start type, and Service Type
  from your endpoints.
known_false_positives: unknown
references:
- https://www.fireeye.com/blog/threat-research/2020/10/fin11-email-campaigns-precursor-for-ransomware-data-theft.html
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
tags:
  analytic_story:
  - Clop Ransomware
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/clop/clop_a/windows-system.log
  kill_chain_phases:
  - Privilege Escalation
  mitre_attack_id:
  - T1543
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - EventCode
  - cmdline
  - _time
  - parent_process_name
  - process_name
  - OriginalFileName
  - process_path
  security_domain: endpoint
  impact: 100
  confidence: 100
  # (impact * confidence)/100
  risk_score: 100
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  message: An instance of $parent_process_name$ spawning $process_name$ was identified on endpoint $dest$ executing known Clop Ransomware service names.
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Parent Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process