name: Clop Ransomware Known Service Name
id: 07e08a12-870c-11eb-b5f9-acde48001122
version: 3
date: '2024-05-21'
author: Teoderick Contreras
status: production
type: TTP
description: The following analytic identifies the creation of a service with a known
  name used by CLOP ransomware for persistence and high-privilege code execution.
  It detects this activity by monitoring Windows Event Logs (EventCode 7045) for specific
  service names ("SecurityCenterIBM", "WinCheckDRVs"). This activity is significant
  because the creation of such services is a common tactic used by ransomware to maintain
  control over infected systems. If confirmed malicious, this could allow attackers
  to execute code with elevated privileges, maintain persistence, and potentially
  disrupt or encrypt critical data.
data_source:
- Windows Event Log System 7045
search: '`wineventlog_system` EventCode=7045 ServiceName IN ("SecurityCenterIBM",
  "WinCheckDRVs") | stats count min(_time) as firstTime max(_time) as lastTime by
  Computer EventCode ServiceName StartType ServiceType | rename Computer as dest |
  `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `clop_ransomware_known_service_name_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the Service name, Service File Name Service Start type, and Service Type
  from your endpoints.
known_false_positives: unknown
references:
- https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
tags:
  analytic_story:
  - Clop Ransomware
  asset_type: Endpoint
  confidence: 100
  impact: 100
  message: An instance of a known Clop Ransomware Service Name detected on $dest$
  mitre_attack_id:
  - T1543
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - EventCode
  - cmdline
  - _time
  - parent_process_name
  - process_name
  - OriginalFileName
  - process_path
  risk_score: 100
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/clop/clop_a/windows-xml.log
    source: XmlWinEventLog:System
    sourcetype: XmlWinEventLog
