name: CMD Carry Out String Command Parameter
id: 54a6ed00-3256-11ec-b031-acde48001122
version: 3
date: '2022-01-18'
author: Teoderick Contreras, Bhavin Patel, Splunk
type: Hunting
datamodel:
- Endpoint
description: The following analytic identifies command-line arguments where `cmd.exe
  /c` is used to execute a program. `cmd /c` is used to run commands in MS-DOS and
  terminate after command or process completion. This technique is commonly seen in
  adversaries and malware to execute batch command using different shell like PowerShell
  or different process other than `cmd.exe`. This is a good hunting query for suspicious
  command-line made by a script or relative process execute it.
search: '| tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_cmd` AND Processes.process="*
  /c *" by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.original_file_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `cmd_carry_out_string_command_parameter_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: False positives may be high based on legitimate scripted code
  in any environment. Filter as needed.
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
  analytic_story:
  - IcedID
  - Log4Shell CVE-2021-44228
  - WhisperGate
  - Hermetic Wiper
  - Living Off The Land
  automated_detection_testing: passed
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Execution
  cve:
  - CVE-2021-44228
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/cmd_carry_str_param/sysmon.log
  impact: 60
  kill_chain_phases:
  - Exploitation
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ attempting spawn a new process.
  mitre_attack_id:
  - T1059.003
  - T1059
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_name
  - Processes.process_id
  - Processes.process
  - Processes.dest
  - Processes.user
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 30
  security_domain: endpoint
  asset_type: Endpoint
