name: Cmdline Tool Not Executed In CMD Shell
id: 6c3f7dd8-153c-11ec-ac2d-acde48001122
version: 2
date: '2023-12-27'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: The following analytic identifies a non-standard parent process (not
  matching CMD, PowerShell, or Explorer) spawning `ipconfig.exe` or `systeminfo.exe`.
  This particular behavior was seen in FIN7's JSSLoader .NET payload. This is also
  typically seen when an adversary is injected into another process performing different
  discovery techniques. This event stands out as a TTP since these tools are commonly
  executed with a shell application or Explorer parent, and not by another application.
  This TTP is a good indicator for an adversary gathering host information, but one
  possible false positive might be an automated tool used by a system administator.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name = "ipconfig.exe"
  OR Processes.process_name = "systeminfo.exe" OR Processes.process_name = "net.exe"
  OR Processes.process_name = "net1.exe" OR Processes.process_name = "arp.exe" OR
  Processes.process_name = "nslookup.exe" OR Processes.process_name = "route.exe"
  OR Processes.process_name = "netstat.exe" OR Processes.process_name = "whoami.exe")
  AND NOT (Processes.parent_process_name = "cmd.exe" OR Processes.parent_process_name
  = "powershell*" OR Processes.parent_process_name="pwsh.exe" OR Processes.parent_process_name
  = "explorer.exe") by Processes.parent_process_name Processes.parent_process Processes.process_name
  Processes.original_file_name Processes.process_id Processes.process Processes.dest
  Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `cmdline_tool_not_executed_in_cmd_shell_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: A network operator or systems administrator may utilize an
  automated host discovery application that may generate false positives. Filter as
  needed.
references:
- https://www.mandiant.com/resources/fin7-pursuing-an-enigmatic-and-evasive-global-criminal-operation
- https://attack.mitre.org/groups/G0046/
- https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
tags:
  analytic_story:
  - Volt Typhoon
  - Rhysida Ransomware
  - FIN7
  - DarkGate Malware
  - Qakbot
  - CISA AA22-277A
  - CISA AA23-347A
  asset_type: Endpoint
  confidence: 80
  impact: 70
  message: A non-standard parent process $parent_process_name$ spawned child process
    $process_name$ to execute command-line tool on $dest$.
  mitre_attack_id:
  - T1059
  - T1059.007
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 56
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/fin7/jssloader/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
