name: CMLUA Or CMSTPLUA UAC Bypass
id: f87b5062-b405-11eb-a889-acde48001122
version: 1
date: '2021-05-13'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: This analytic detects a potential process using COM Object like CMLUA
  or CMSTPLUA to bypass UAC. This technique has been used by ransomware adversaries
  to gain administrative privileges to its running process.
search: '`sysmon` EventCode=7  ImageLoaded IN ("*\\CMLUA.dll", "*\\CMSTPLUA.dll",
  "*\\CMLUAUTIL.dll") NOT(process_name IN("CMSTP.exe", "CMMGR32.exe")) NOT(Image IN("*\\windows\\*",
  "*\\program files*")) | stats count min(_time) as firstTime max(_time) as lastTime
  by Image ImageLoaded process_name Computer EventCode Signed ProcessId | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `cmlua_or_cmstplua_uac_bypass_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name and imageloaded executions from your endpoints. If you
  are using Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
known_false_positives: Legitimate windows application that are not on the list loading
  this dll. Filter as needed.
references:
- https://attack.mitre.org/techniques/T1218/003/
tags:
  analytic_story:
  - DarkSide Ransomware
  - Ransomware
  automated_detection_testing: passed
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548/darkside_cmstp_com/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: The following module $ImageLoaded$ was loaded by a non-standard application
    on endpoint $Computer$ by user $user$.
  mitre_attack_id:
  - T1218.003
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: Computer
    type: Hostname
    role:
    - Victim
  - name: ImageLoaded
    type: Other
    role:
    - Other
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Image
  - ImageLoaded
  - process_name
  - Computer
  - EventCode
  - Signed
  - ProcessId
  risk_score: 80
  security_domain: endpoint
