name: Common Ransomware Extensions
id: a9e5c5db-db11-43ca-86a8-c852d1b2c0ec
version: 6
date: '2023-07-13'
author: David Dorsey, Michael Haag, Splunk, Steven Dick
status: production
type: Hunting
description: The following analytic searches for file modifications that commonly occur with Ransomware. The analytic detects modifications to files with extensions that are commonly used by Ransomware. It does this by searching for changes in the datamodel=Endpoint.Filesystem, specifically modifications to file extensions that match those commonly used by Ransomware. Identifying this behavior is important for a Security Operations Center (SOC) because Ransomware is a common and dangerous type of malware that can cause significant damage to an organization's data and systems. If the search identifies a true positive, it suggests that an attacker is attempting to encrypt or otherwise modify files in the environment, potentially leading to data loss or other negative outcomes. To respond to a true positive, the SOC should investigate the affected system to determine the source of the modification and take appropriate action to contain and remediate the attack.
data_source:
- Sysmon Event ID 11
search: '| tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
  as lastTime count latest(Filesystem.user) as user values(Filesystem.file_path) as
  file_path from datamodel=Endpoint.Filesystem by Filesystem.file_name Filesystem.dest
  _time span=1h | `drop_dm_object_name(Filesystem)` | rex field=file_name "(?<file_extension>\.[^\.]+)$"
  | rex field=file_path "(?<true_file_path>([^\\\]*\\\)*).*" | stats min(firstTime)
  as firstTime max(lastTime) as lastTime latest(user) as user dc(true_file_path) as
  path_count dc(file_name) as file_count latest(file_name) as file_name latest(true_file_path)
  as file_path by dest file_extension | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)`
  | `ransomware_extensions` | where path_count > 1 OR file_count > 20 | `common_ransomware_extensions_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection and Response (EDR) agents. These agents are designed to provide security-related telemetry from the endpoints where the agent is installed. To implement this search, you must ingest logs that contain the process GUID, process name, file path and file name. These logs must be processed using the appropriate Splunk Technology Add-ons that are specific to the EDR product. The logs must also be mapped to the `Processes` node of the `Filesystem` data model. Use the Splunk Common Information Model (CIM) to normalize the field names and speed up the data modeling process.
known_false_positives: It is possible for a legitimate file with these extensions
  to be created. If this is a true ransomware attack, there will be a large number
  of files created with these extensions.
references:
- https://github.com/splunk/security_content/issues/2448
tags:
  analytic_story:
  - SamSam Ransomware
  - Ryuk Ransomware
  - Ransomware
  - Clop Ransomware
  - Prestige Ransomware
  - LockBit Ransomware
  asset_type: Endpoint
  confidence: 100
  impact: 90
  message: The device $dest$ wrote $file_count$ files to $path_count$ path(s) with
    the $file_extension$ extension. This extension and behavior may indicate a $Name$
    ransomware attack.
  mitre_attack_id:
  - T1485
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: file_name
    type: File Name
    role:
    - Victim
  - name: file_count
    type: Other
    role:
    - Other
  - name: path_count
    type: Other
    role:
    - Other
  - name: file_extension
    type: Other
    role:
    - Other
  - name: Name
    type: Other
    role:
    - Other
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Filesystem.user
  - Filesystem.dest
  - Filesystem.file_path
  - Filesystem.file_name
  risk_score: 90
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1485/ransomware_notes/ransom-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
