name: Common Ransomware Extensions
id: a9e5c5db-db11-43ca-86a8-c852d1b2c0ec
version: 5
date: '2022-11-10'
author: David Dorsey, Michael Haag, Splunk, Steven Dick
status: production
type: Hunting
description: "The following analytic detects Searches for file modifications that commonly occur with Ransomware to detect modifications to files with extensions that are commonly used by Ransomware. The detection is made by searches for changes in the datamodel=Endpoint.Filesystem, specifically modifications to file extensions that match those commonly used by Ransomware. The detection is important because it suggests that an attacker is attempting to encrypt or otherwise modify files in the environment using malware, potentially leading to data loss that can cause significant damage to an organization's data and systems. False positives might occur so the SOC must investigate the affected system to determine the source of the modification and take appropriate action to contain and remediate the attack."
data_source:
- Sysmon Event ID 11
search: '| tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
  as lastTime count latest(Filesystem.user) as user values(Filesystem.file_path) as
  file_path from datamodel=Endpoint.Filesystem by Filesystem.file_name Filesystem.dest
  _time span=1h | `drop_dm_object_name(Filesystem)` | rex field=file_name "(?<file_extension>\.[^\.]+)$"
  | rex field=file_path "(?<true_file_path>([^\\\]*\\\)*).*" | stats min(firstTime)
  as firstTime max(lastTime) as lastTime latest(user) as user dc(true_file_path) as
  path_count dc(file_name) as file_count latest(file_name) as file_name latest(true_file_path)
  as file_path by dest file_extension | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)`
  | `ransomware_extensions` | where path_count > 1 OR file_count > 20 | `common_ransomware_extensions_filter`'
how_to_implement: 'You must be ingesting data that records the filesystem activity
  from your hosts to populate the Endpoint Filesystem data model node. To see the
  additional metadata, add the following fields, if not already present, please review
  the detailed documentation on how to create a new field within Incident Review may
  be found here: `https://docs.splunk.com/Documentation/ES/5.3.0/Admin/Customizenotables#Add_a_field_to_the_notable_event_details`'
known_false_positives: It is possible for a legitimate file with these extensions
  to be created. If this is a true ransomware attack, there will be a large number
  of files created with these extensions.
references:
- https://github.com/splunk/security_content/issues/2448
tags:
  analytic_story:
  - SamSam Ransomware
  - Ryuk Ransomware
  - Ransomware
  - Clop Ransomware
  - Prestige Ransomware
  - LockBit Ransomware
  asset_type: Endpoint
  confidence: 100
  impact: 90
  message: The device $dest$ wrote $file_count$ files to $path_count$ path(s) with
    the $file_extension$ extension. This extension and behavior may indicate a $Name$
    ransomware attack.
  mitre_attack_id:
  - T1485
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Filesystem.user
  - Filesystem.dest
  - Filesystem.file_path
  - Filesystem.file_name
  risk_score: 90
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1485/ransomware_notes/ransom-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
