name: Creation of Shadow Copy with wmic and powershell
id: 2ed8b538-d284-449a-be1d-82ad1dbd186b
version: 1
date: '2019-12-10'
description: This search detects the use of wmic and Powershell to create a shadow
  copy.
type: batch
references:
- https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
author: Patrick Bareiss, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=wmic*
  OR Processes.process_name=powershell* Processes.process=*shadowcopy* Processes.process=*create*
  by Processes.user Processes.process_name Processes.process Processes.dest | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `creation_of_shadow_copy_with_wmic_and_powershell_filter`'
known_false_positives: Legtimate administrator usage of wmic to create a shadow copy.
tags:
  analytics_story:
  - Credential Dumping
  mitre_attack_id:
  - T1003.003
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 8
  - CIS 16
  nist:
  - DE.CM
  security_domain: endpoint
  asset_type: Endpoint
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.003/atomic_red_team/windows-sysmon.log
