author: Bhavin Patel, Splunk
date: '2020-07-21'
description: This search looks for the creation or deletion of hidden shares using
  net.exe.
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
id: qw9919ed-fe5f-492c-b139-151bb162140e
known_false_positives: Administrators often leverage net.exe to create or delete network
  shares. You should verify that the activity was intentional and is legitimate.
name: Create or delete windows shares using net exe
references:
- https://attack.mitre.org/techniques/T1070/005
search: '| tstats `security_content_summariesonly` count values(Processes.user) as
  user values(Processes.parent_process) as parent_process min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where (Processs.process_name=net.exe
  OR Processes.process_name=net1.exe) by Processes.process Processes.process_name
  Processes.dest | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`|
  `security_content_ctime(lastTime)` | search process=*share* | `create_or_delete_windows_shares_using_net_exe_filter` '
tags:
  analytics_story:
  - Hidden Cobra Malware
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 8
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1070.005/atomic_red_team/windows-sysmon.log
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1070.005
  nist:
  - PR.PT
  - DE.CM
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
type: batch
version: 5
