name: Create Service In Suspicious File Path
id: 429141be-8311-11eb-adb6-acde48001122
version: 1
date: '2021-03-12'
author: Teoderick Contreras
type: batch
datamodel:
- Endpoint
description: This detection is to identify a creation of "user mode service" where
  the service file path is located in non-common service folder in windows.
search: ' `wineventlog_system` EventCode=7045  Service_File_Name = "*\.exe" NOT (Service_File_Name
  IN ("C:\\Windows\\*", "C:\\Program File*", "C:\\Programdata\\*", "%systemroot%\\*"))
  Service_Type = "user mode service" | stats count min(_time) as firstTime max(_time)
  as lastTime by EventCode Service_File_Name Service_Name Service_Start_Type Service_Type
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `create_service_in_suspicious_file_path_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the Service name, Service File Name Service Start type, and Service Type
  from your endpoints.
known_false_positives: unknown
references:
- https://www.fireeye.com/blog/threat-research/2020/10/fin11-email-campaigns-precursor-for-ransomware-data-theft.html
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
tags:
  analytic_story:
  - Clop Ransomware
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/clop/clop_a/windows-system.log
  kill_chain_phases:
  - Privilege Escalation
  mitre_attack_id:
  - T1569.002
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - EventCode
  - Service_File_Name
  - Service_Type
  - _time
  - Service_Name
  - Service_Start_Type
  security_domain: endpoint
  impact: 70
  confidence: 80
  # (impact * confidence)/100
  risk_score: 56
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  message: A service $Service_File_Name$ was created from a non-standard path using $Service_Name$, potentially leading to a privilege escalation.
  observable:
  - name: Service_File_Name
    type: Other
    role:
    - Other
  - name: Service_Name
    type: Other
    role:
    - Other