author: Patrick Bareiss, Splunk
datamodel:
- Endpoint
date: '2019-12-10'
description: Monitor for signs that Vssadmin or Wmic has been used to create a shadow
  copy.
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints, to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
id: eb120f5f-b879-4a63-97c1-93352b5df844
known_false_positives: Legitimate administrator usage of Vssadmin or Wmic will create
  false positives.
name: Creation of Shadow Copy
references:
- https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name=vssadmin.exe
  Processes.process=*create* Processes.process=*shadow*) OR (Processes.process_name=wmic.exe
  Processes.process=*shadowcopy* Processes.process=*create*) by Processes.dest Processes.user
  Processes.process_name Processes.process  Processes.parent_process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`|
  `security_content_ctime(lastTime)` | `creation_of_shadow_copy_filter`'
tags:
  analytic_story:
  - Credential Dumping
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 8
  - CIS 16
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Credential Access
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.003/atomic_red_team/windows-sysmon.log
  impact: 90
  kill_chain_phases:
  - Actions on Objectives
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ attempting to create a shadow copy to perform
    offline password cracking.
  mitre_attack_id:
  - T1003.003
  - T1003
  nist:
  - DE.CM
  observable:
  - name: user
    role:
    - Victim
    type: User
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: parent_process
    role:
    - Parent Process
    type: Parent Process
  - name: process_name
    role:
    - Child Process
    type: Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process
  - Endpoint.Processes.parent_process_id
  - Endpoint.Processes.process
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 81
  security_domain: endpoint
type: TTP
version: 1
