name: Creation of Shadow Copy
id: eb120f5f-b879-4a63-97c1-93352b5df844
version: 1
date: '2019-12-10'
author: Patrick Bareiss, Splunk
type: batch
datamodel: Endpoint
description: Monitor for signs that Ntdsutil, Vssadmin, or Wmic has been used to create
  a shadow copy.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name=ntdsutil.exe
  Processes.process=*ntds* Processes.process=*create*) OR (Processes.process_name=vssadmin.exe
  Processes.process=*create* Processes.process=*shadow*) OR (Processes.process_name=wmic.exe
  Processes.process=*shadowcopy* Processes.process=*create*) by Processes.dest Processes.user
  Processes.process_name Processes.process  Processes.parent_process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`|
  `security_content_ctime(lastTime)` | `creation_of_shadow_copy_filter`'
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints, to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
known_false_positives: Legtimate administrator usage of Ntdsutil, Vssadmin, or Wmic
  will create false positives.
references:
- https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
tags:
  analytic_story:
  - Credential Dumping
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 8
  - CIS 16
  dataset:
  - hhttps://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.003/atomic_red_team/windows-sysmon.log
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1003.003
  nist:
  - DE.CM
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
