name: DCSync Attack
id: 51307514-1236-49f6-8686-d46d93cc2821
version: 1
date: '2022-09-08'
author: Dean Luxton
type: TTP
datamodel: []
description: When a domain controller receives a replication request, the user account permissions are validated, however no checks are performed to validate the request was initiated by a Domain Controller.
 Once an attacker gains control of an account with the necessary privileges, they can request password hashes for any or all users within the domain.
 This alert detects when a handle to domainDNS is opened with the necessary replication permissions. 
search: '`wineventlog_security` EventCode=4662 ObjectType IN ("%{19195a5b-6da0-11d0-afd3-00c04fd930c9}",
  "domainDNS") AND Properties IN ("*Replicating Directory Changes All*", "*{1131f6ad-9c07-11d1-f79f-00c04fc2dcd2}*",
  "*{9923a32a-3607-11d2-b9be-0000f87a36b2}*","*{1131f6ac-9c07-11d1-f79f-00c04fc2dcd2}*")
  | stats min(_time) as firstEvent, max(_time) as latestEvent, range(_time) as duration
  count by AccessMask, SubjectDomainName, SubjectUserName, Computer, Logon_ID, ObjectName,
  ObjectServer, ObjectType, OperationType, status
  | join type=outer Logon_ID [| search `wineventlog_security` EventCode=4624 | rename
  TargetLogonId as Logon_ID, TargetDomainName as domain]
  | table firstEvent, latestEvent, duration, AccessMask, domain, user, Computer, Logon_ID,
  ObjectName, ObjectServer, ObjectType, OperationType, status, src_ip, Logon_ID
  | eval firstEvent=strftime(firstEvent, "%Y-%m-%d %H:%M:%S"), latestEvent=strftime(latestEvent,
  "%Y-%m-%d %H:%M:%S") | `dcsync_attack_filter`'
how_to_implement: To successfully implement this search, you ned to be ingesting eventcode `4662`. 
 The Advanced Security Audit policy settings `Audit Directory Services Access`
 within `DS Access` needs to be enabled, as well as the following SACLs applied to the domain root 
 and all descendant objects. The principals `everybody`,  `Domain Computers`, and  `Domain Controllers`
 auditing the permissions `Replicating Directory Changes`, `Replicating Directory Changes All`, and 
 `Replicating Directory Changes In Filtered Set`
 If genuine DC activity triggers this detection within your environment, look to tune out the 
 domain controller computer accounts using asset and identities.   
known_false_positives: A genuine domain controller promotion event will trigger this alert. 
references:
- https://adsecurity.org/?p=1729
- https://www.linkedin.com/pulse/mimikatz-dcsync-event-log-detections-john-dwyer
tags:
  analytic_story:
  - Windows Domain Controller Attacks
  - Credential Dumping
  asset_type: Endpoint
  cis20:
  - CIS 4
  - CIS 6
  confidence: 80
  context:
    - Source:Endpoint
    - Source:AD
    - Stage:Credential Access
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.006/impacket/windows-security-xml.log
  impact: 100
  kill_chain_phases:
  - Actions on Objectives
  message: DCSync Attack Detected from $src$
  mitre_attack_id:
  - T1003.006
  - T1003
  nist:
  - DE.CM
  observable:
  - name: src_user
    type: User
    role:
    - Victim
  - name: src
    type: IP Address
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - ObjectType
  - Properties
  - AccessMask
  - SubjectDomainName
  - SubjectUserName
  - Computer
  - Logon_ID
  - ObjectName
  - ObjectServer
  - ObjectType
  - OperationType
  - status
  risk_score: 80
  security_domain: endpoint
