name: Deleting Of Net Users
id: 1c8c6f66-acce-11eb-aafb-acde48001122
version: 1
date: '2021-05-04'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: This search is to detect a suspicious net.exe/net1.exe commandline to delete a net users in a machine.
  This technique can be use by the network operator to do this task, apparently this commandline was abuse in the wild to impair some user
  or deleting adversaries tracks like created user during its lateral movement to the vulnerable machines.
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  values(Processes.parent_process) as parent_process values(Processes.process_id)
  as process_id count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process_name="net.exe" OR Processes.process_name="net1.exe" AND Processes.process="*user*" AND  Processes.process="*/delete*"
  by  Processes.process_name Processes.dest Processes.user Processes.parent_process_name 
  | `drop_dm_object_name(Processes)` 
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` 
  | `deleting_of_net_users_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. Tune and filter known instances where renamed net.exe may be used.
known_false_positives: network operator can make use of this command
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
tags:
  analytic_story:
  - xmrig
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1531
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_name
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name 
  - Processes.process_id
  - Processes.parent_process
  security_domain: endpoint