author: David Dorsey, Splunk
datamodel:
- Endpoint.Processes
date: '2020-11-09'
description: The vssadmin.exe utility is used to interact with the Volume Shadow Copy
  Service.  Wmic is an interface to the Windows Management Instrumentation.  This
  search looks for either of these tools being used to delete shadow copies.
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
id: b89919ed-ee5f-492c-b139-95dbb162039e
known_false_positives: vssadmin.exe and wmic.exe are standard applications shipped
  with modern versions of windows. They may be used by administrators to legitimately
  delete old backup copies, although this is typically rare.
name: Deleting Shadow Copies
references: []
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  as process values(Processes.parent_process) as parent_process min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name=vssadmin.exe
  OR Processes.process_name=wmic.exe) Processes.process=*delete* Processes.process=*shadow*
  by Processes.user Processes.process_name Processes.parent_process_name Processes.dest  |
  `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `deleting_shadow_copies_filter`'
tags:
  analytic_story:
  - Windows Log Manipulation
  - SamSam Ransomware
  - Ransomware
  - Clop Ransomware
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 8
  - CIS 10
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1490/atomic_red_team/windows-sysmon.log
  impact: 90
  kill_chain_phases:
  - Actions on Objectives
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ attempting to delete shadow copies.
  mitre_attack_id:
  - T1490
  nist:
  - PR.PT
  - DE.CM
  - PR.IP
  observable:
  - name: user
    role:
    - Victim
    type: User
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: parent_process_name
    role:
    - Parent Process
    type: Parent Process
  - name: process_name
    role:
    - Child Process
    type: Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 81
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
type: TTP
version: 4
