name: Detect Certipy File Modifications
id: 7e3df743-b1d8-4631-8fa8-bd5819688876
version: 1
date: '2023-06-25'
author: Steven Dick
status: production
type: TTP
description: The following analytic identifies when the attacker tool Certipy is used to enumerate Active Directory Certificate Services (AD CS) environments. The default behavior of this toolkit drops a number of file uniquely named files or file extensions related to it's information gathering and exfiltration process.
data_source:
- Windows Event Log Security 4663
- Sysmon EventID 11
search: '| tstats `security_content_summariesonly` count min(_time) AS firstTime max(_time) AS lastTime values(Processes.process_current_directory) as process_current_directory FROM datamodel=Endpoint.Processes where Processes.action="allowed" BY _time span=1h Processes.user Processes.dest Processes.process_id Processes.process_name Processes.process Processes.process_path Processes.parent_process_name Processes.parent_process Processes.process_guid Processes.action
  |`drop_dm_object_name(Processes)` 
  | join max=0 dest process_guid [| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Filesystem where Filesystem.file_name IN ("*_certipy.zip", "*_certipy.txt", "*_certipy.json", "*.ccache") by Filesystem.file_create_time Filesystem.process_id Filesystem.process_guid Filesystem.file_name Filesystem.file_path Filesystem.dest
  | `drop_dm_object_name(Filesystem)` 
  ]
  | fields firstTime lastTime user dest file_create_time file_name file_path parent_process_name parent_process process_name process_path process_current_directory process process_guid process_id
  | where isnotnull(file_name)
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)`
  | `detect_certipy_file_modifications_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting logs with the process name, parent process, and command-line executions from your endpoints as well as file creation or deletion events. 
known_false_positives: Unknown
references:
- https://github.com/ly4k/Certipy
tags:
  analytic_story:
  - Windows Certificate Services
  - Data Exfiltration
  - Ingress Tool Transfer
  asset_type: Endpoint
  confidence: 90
  impact: 50
  message: Suspicious files $file_name$ related to Certipy detected on $dest$
  mitre_attack_id:
  - T1649
  - T1560
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  - name: file_name
    type: File Name
    role:
    - Attacker
  - name: process_name
    type: Process Name
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.user 
  - Processes.dest 
  - Processes.process_id 
  - Processes.process_name 
  - Processes.process 
  - Processes.process_path 
  - Processes.parent_process_name 
  - Processes.parent_process 
  - Processes.process_guid 
  - Processes.action
  - Filesystem.file_create_time 
  - Filesystem.process_id 
  - Filesystem.process_guid 
  - Filesystem.file_name 
  - Filesystem.file_path 
  - Filesystem.dest
  risk_score: 45
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1649/certify_abuse/certify_esc1_abuse_sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true