name: Detect HTML Help Renamed
id: 62fed254-513b-460e-953d-79771493a9f3
version: 5
date: '2024-05-16'
author: Michael Haag, Splunk
status: production
type: Hunting
description: The following analytic detects instances where hh.exe (HTML Help) has
  been renamed and is executing a Compiled HTML Help (CHM) file. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process names
  and original file names. This activity is significant because attackers can use
  renamed hh.exe to execute malicious scripts embedded in CHM files, potentially leading
  to code execution. If confirmed malicious, this technique could allow attackers
  to run arbitrary scripts, escalate privileges, or persist within the environment,
  posing a significant security risk.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name!=hh.exe
  AND Processes.original_file_name=HH.EXE by Processes.dest Processes.user Processes.parent_process_name
  Processes.original_file_name Processes.process_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `detect_html_help_renamed_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Although unlikely a renamed instance of hh.exe will be used
  legitimately, filter as needed.
references:
- https://attack.mitre.org/techniques/T1218/001/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.001/T1218.001.md
- https://lolbas-project.github.io/lolbas/Binaries/Hh/
tags:
  analytic_story:
  - Suspicious Compiled HTML Activity
  - Living Off The Land
  asset_type: Endpoint
  confidence: 100
  impact: 80
  message: The following $process_name$ has been identified as renamed, spawning from
    $parent_process_name$ on $dest$ executed by $user$
  mitre_attack_id:
  - T1218
  - T1218.001
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.001/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
