name: Detect PsExec With accepteula Flag
id: 27c3a83d-cada-47c6-9042-67baf19d2574
version: 4
date: '2021-09-16'
author: Bhavin Patel, Splunk
type: TTP
datamodel:
- Endpoint
description: This search looks for events where `PsExec.exe` is run with the `accepteula`
  flag in the command line. PsExec is a built-in Windows utility that enables you
  to execute processes on other systems. It is fully interactive for console applications.
  This tool is widely used for launching interactive command prompts on remote systems.
  Threat actors leverage this extensively for executing code on compromised systems.
  If an attacker is running PsExec for the first time, they will be prompted to accept
  the end-user license agreement (EULA), which can be passed as the argument `accepteula`
  within the command line.
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where `process_psexec` Processes.process=*accepteula* by Processes.dest Processes.user
  Processes.parent_process_name Processes.process_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)`| `security_content_ctime(firstTime)`|
  `security_content_ctime(lastTime)` | `detect_psexec_with_accepteula_flag_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: Administrators can leverage PsExec for accessing remote systems
  and might pass `accepteula` as an argument if they are running this tool for the
  first time. However, it is not likely that you'd see multiple occurrences of this
  event on a machine
references: []
tags:
  analytic_story:
  - SamSam Ransomware
  - DHS Report TA18-074A
  - HAFNIUM Group
  - DarkSide Ransomware
  - Active Directory Lateral Movement
  asset_type: Endpoint
  cis20:
  - CIS 8
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1021.002/atomic_red_team/windows-sysmon.log
  impact: 50
  kill_chain_phases:
  - Actions on Objectives
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ running the utility for possibly the first time.
  mitre_attack_id:
  - T1021
  - T1021.002
  nist:
  - PR.PT
  - DE.CM
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 35
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
