name: Detect LinPeas Execution
id: 4ea6fa10-547c-11ec-a4f9-acde48001122
version: 1
date: '2021-12-03'
author: Rod Soto, Eric McGinnis
type: TTP
datamodel:
- Endpoint
description: Linux local Privilege Escalation Awesome Script (linPEAS) is a script
  that searches for possible paths to escalate privileges.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process= "grep -Ev ._history.|.bashrc|.bluemix|.cer|.cloudflared|.crt|.csr|.db|.der|.env|.erlang.cookie|.ftpconfig|.git|.git-credentials|.gitconfig|.github|.gnupg|.google_authenticator|.gpg|.htpasswd|.irssi|.jks|.k5login|.kdbx|.key|.keyring|.keystore|.ldaprc|.lesshst|.mozilla|.msmtprc|.ovpn|.p12|.pem|.pfx|.pgp|.plan|.profile|.pypirc|.rdg|.recently-used.xbel|.rhosts|.secrets.mkey|.service|.socket|.sqlite|.sqlite3|.sudo_as_admin_successful|.svn|.swp|.timer|.vault-token|.viminfo|.vnc|.wgetrc" OR Processes.process="find /var/log/ /private/var/log -type f -exec grep -R -a -E -o (25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\\.(25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?) {} ;" by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id Processes.process_guid| `drop_dm_object_name(Processes)`| `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`| `detect_linpeas_execution_filter`'
how_to_implement: This detection search is based on Splunk add-on for Microsoft Sysmon-Linux.
  Need to install this add-on to parse fields correctly and execute detection search.
known_false_positives: This search may produce false positives as it will display
  many sudo executed processess however, the cve-list within the command line it is
  a clear indicator, operator is searching for local vulnerabilites.
references:
- https://book.hacktricks.xyz/linux-unix/linux-privilege-escalation-checklist
- https://github.com/carlospolop/PEASS-ng/tree/master/linPEAS
- https://attack.mitre.org/matrices/enterprise/linux/
tags:
  analytic_story:
  - Linux Post-Exploitation
  confidence: 100
  context:
  - Source: endpoint
  - Stage: discovery
  dataset:
  - https://github.com/splunk/attack_data/raw/master/datasets/suspicious_behaviour/linux_post_exploitation/linpeasdataset.txt
  impact: 90
  kill_chain_phases:
  - Exploitation
  - Privilege Escalation
  message: LinPEAS post exploitation tool detected
  mitre_attack_id:
  - T1082
  - T1083
  - T1033
  - T1087
  - T1046
  - T1057
  - T1518
  - T1033
  observable:
  - name: Computer
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Computer
  - CommandLine
  - user
  - parent_process_exec
  - process_path
  risk_score: 90
  security_domain: endpoint
