name: Detect Excessive User Account Lockouts
id: 95a7f9a5-6096-437e-a19e-86f42ac609bd
version: 6
date: '2025-05-20'
author: David Dorsey, Splunk
status: production
type: Anomaly
description: The following analytic identifies user accounts experiencing an excessive
  number of lockouts within a short timeframe. It leverages the 'Change' data model,
  specifically focusing on events where the result indicates a lockout. This activity
  is significant as it may indicate a brute-force attack or misconfiguration, both
  of which require immediate attention. If confirmed malicious, this behavior could
  lead to account compromise, unauthorized access, and potential lateral movement
  within the network.
data_source: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Change.All_Changes where  All_Changes.result="*lock*"
  by All_Changes.user All_Changes.result |`drop_dm_object_name("All_Changes")` |`drop_dm_object_name("Account_Management")`|
  `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | search
  count > 5 | `detect_excessive_user_account_lockouts_filter`'
how_to_implement: ou must ingest your Windows security event logs in the `Change`
  datamodel under the nodename is `Account_Management`, for this search to execute
  successfully. Please consider updating the cron schedule and the count of lockouts
  you want to monitor, according to your environment.
known_false_positives: It is possible that a legitimate user is experiencing an issue
  causing multiple account login failures leading to lockouts.
references: []
tags:
  analytic_story:
  - Active Directory Password Spraying
  asset_type: Windows
  confidence: 60
  impact: 60
  message: Excessive user account lockouts for $user$ in a short period of time
  mitre_attack_id:
  - T1078
  - T1078.003
  observable:
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Changes.result
  - nodename
  - All_Changes.user
  risk_score: 36
  security_domain: access
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1078.002/account_lockout/windows-xml-1.log
    source: XmlWinEventLog:Security
    sourcetype: XmlWinEventLog
