name: Detect Copy of ShadowCopy with Script Block Logging
id: 9251299c-ea5b-11eb-a8de-acde48001122
version: 3
date: '2024-05-31'
author: Michael Haag, Splunk
status: production
type: TTP
description: 'The following analytic detects the use of PowerShell commands to copy
  the SAM, SYSTEM, or SECURITY hives, which are critical for credential theft. It
  leverages PowerShell Script Block Logging (EventCode=4104) to capture and analyze
  the full command executed. This activity is significant as it indicates an attempt
  to exfiltrate sensitive registry hives for offline password cracking. If confirmed
  malicious, this could lead to unauthorized access to credentials, enabling further
  compromise of the system and potential lateral movement within the network.'
data_source:
- Powershell Script Block Logging 4104
search: '`powershell` EventCode=4104 ScriptBlockText IN ("*copy*","*[System.IO.File]::Copy*")
  AND ScriptBlockText IN ("*System32\\config\\SAM*", "*System32\\config\\SYSTEM*","*System32\\config\\SECURITY*")
  | stats count min(_time) as firstTime max(_time) as lastTime by Opcode Computer
  UserID EventCode ScriptBlockText | rename Computer as dest | rename UserID as user
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `detect_copy_of_shadowcopy_with_script_block_logging_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: Limited false positives as the scope is limited to SAM, SYSTEM
  and SECURITY hives.
references:
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-36934
- https://github.com/GossiTheDog/HiveNightmare
- https://github.com/JumpsecLabs/Guidance-Advice/tree/main/SAM_Permissions
tags:
  analytic_story:
  - Credential Dumping
  asset_type: Endpoint
  confidence: 100
  cve:
  - CVE-2021-36934
  impact: 80
  message: PowerShell was identified running a script to capture the SAM hive on endpoint
    $dest$ by user $user$.
  mitre_attack_id:
  - T1003.002
  - T1003
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - ScriptBlockText
  - OpCode
  - Computer
  - UserID
  - EventCode
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.002/detect_copy_of_shadowcopy_with_script_block_logging/windows-xml.log
    source: XmlWinEventLog:Microsoft-Windows-PowerShell/Operational
    sourcetype: XmlWinEventLog
