name: Detect Renamed RClone
id: 6dca1124-b3ec-11eb-9328-acde48001122
version: 1
date: '2021-05-13'
author: Michael Haag, Splunk
type: batch
datamodel: []
description: The following analytic identifies the usage of `rclone.exe`, renamed,
  being used to exfiltrate data to a remote destination. RClone has been used by multiple
  ransomware groups to exfiltrate data. In many instances, it will be downloaded from
  the legitimate site and executed accordingly. During triage, isolate the endpoint
  and begin to review parallel processes for additional behavior. At this stage, the
  adversary may have staged data to be exfiltrated.
search: '`sysmon` EventID=1 OriginalFileName=rclone.exe NOT process_name=rclone.exe
  | stats count min(_time) as firstTime max(_time) as lastTime by Computer, User,
  parent_process_name, process_name, OriginalFileName, process_path, CommandLine |
  rename Computer as dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `detect_renamed_rclone_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: False positives should be limited as this analytic identifies
  renamed instances of `rclone.exe`. Filter as needed if there is a legitimate business
  use case.
references:
- https://redcanary.com/blog/rclone-mega-extortion/
- https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
tags:
  analytic_story:
  - DarkSide Ransomware
  - Ransomware
  automated_detection_testing: passed
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Collection
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1020/windows-sysmon.log
  impact: 30
  kill_chain_phases:
  - Exfiltration
  message: The following $process_name$ has been identified as renamed, spawning from
    $parent_process_name$ on $dest$ by $user$.
  mitre_attack_id:
  - T1020
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Parent Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - OriginalFileName
  - process_name
  - process_path
  - CommandLine
  - dest
  risk_score: 27
  security_domain: endpoint
