name: Detect NL Brute12 Install
id: 93eaedf2-b7e6-41cf-99f3-baed6cf8162a
version: 1
date: '2021-05-08'
author: Rod Soto, Splunk
type: batch
datamodel:
- Endpoint
description: This query detects the install of NL Brute 1.2, a RDP brute force tool found in botnets for further expansion and and acquisition of targets.
search: `sysmon` EventCode=1 | stats values(Image) as Image values(ProcessId) as ProcessId by Computer, User, process_exec | search Image=*NLBrute* | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` |`detect_nl_brute12_install_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: Unknown
references:
- https://www.reddit.com/r/sysadmin/comments/59fhrk/compromised_server_what_is_this_tool/
tags:
  analytic_story:
  - xmrig
  kill_chain_phases:
  - Actions on Objective
  mitre_attack_id:
  - T1570
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.computer
  - Processes.user
  - Processes.Image
  - Processes.process_id
  - Processes.process_exec
  security_domain: endpoint
