name: Detect Regsvcs with Network Connection
id: e3e7a1c0-f2b9-445c-8493-f30a63522d1a
version: 4
date: '2024-05-19'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic identifies instances of Regsvcs.exe establishing
  a network connection to a public IP address, excluding private IP ranges. This detection
  leverages Sysmon Event ID 3 logs to monitor network connections initiated by Regsvcs.exe.
  This activity is significant as Regsvcs.exe, a legitimate Microsoft-signed binary,
  can be exploited to bypass application control mechanisms and establish remote Command
  and Control (C2) channels. If confirmed malicious, this behavior could allow an
  attacker to escalate privileges, persist in the environment, and exfiltrate sensitive
  data. Immediate investigation and remediation are recommended.
data_source:
- Sysmon EventID 3
search: '`sysmon` EventID=3 dest_ip!=10.0.0.0/8 dest_ip!=172.16.0.0/12 dest_ip!=192.168.0.0/16
  process_name=regsvcs.exe  | stats count min(_time) as firstTime max(_time) as lastTime
  by dest, user, process_name, src_ip, dest_ip | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `detect_regsvcs_with_network_connection_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: Although unlikely, limited instances of regsvcs.exe may cause
  a false positive. Filter based endpoint usage, command line arguments, or process
  lineage.
references:
- https://attack.mitre.org/techniques/T1218/009/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.009/T1218.009.md
- https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
tags:
  analytic_story:
  - Suspicious Regsvcs Regasm Activity
  - Living Off The Land
  asset_type: Endpoint
  confidence: 100
  impact: 80
  message: An instance of $process_name$ contacting a remote destination was identified
    on endpoint $dest$ by user $user$. This behavior is not normal for $process_name$.
  mitre_attack_id:
  - T1218
  - T1218.009
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventID
  - dest_ip
  - process_name
  - dest
  - user
  - src_ip
  - dest_host
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.009/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
