name: Detect Rare Executables
id: 44fddcb2-8d3b-454c-874e-7c6de5a4f7ac
version: 5
date: '2024-05-21'
author: Bhavin Patel, Splunk
status: production
type: Anomaly
description: The following analytic detects the execution of rare processes that appear
  only once across the network within a specified timeframe. It leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process execution logs.
  This activity is significant for a SOC as it helps identify potentially malicious
  activities or unauthorized software, which could indicate a security breach or ongoing
  attack. If confirmed malicious, such rare processes could lead to data theft, privilege
  escalation, or complete system compromise, making early detection crucial for minimizing
  impact.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` dc(Processes.dest) as dc_dest values(Processes.dest)
  as dest values(Processes.user) as user min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes by Processes.process_name | `drop_dm_object_name(Processes)`
  | search dc_dest < 10 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `detect_rare_executables_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Some legitimate processes may be only rarely executed in your
  environment.
references: []
tags:
  analytic_story:
  - Unusual Processes
  - Rhysida Ransomware
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: A rare process - [$process_name$] has been detected on less than 10 hosts
    in your environment.
  mitre_attack_id:
  - T1204
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.process_name
  risk_score: 25
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1204/rare_executables/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
