name: Detection of tools built by NirSoft
id: 3d8d201c-aa03-422d-b0ee-2e5ecf9718c0
version: 4
date: '2024-05-20'
author: Bhavin Patel, Splunk
status: experimental
type: TTP
description: The following analytic identifies the execution of tools built by NirSoft
  by detecting specific command-line arguments such as "/stext" and "/scomma". It
  leverages data from Endpoint Detection and Response (EDR) agents, focusing on process
  names, parent processes, and command-line executions. This activity is significant
  because NirSoft tools, while legitimate, can be exploited by attackers for malicious
  purposes such as credential theft or system reconnaissance. If confirmed malicious,
  this activity could lead to unauthorized access, data exfiltration, or further compromise
  of the affected system.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) values(Processes.process)
  as process max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process="*
  /stext *" OR Processes.process="* /scomma *" ) by Processes.parent_process Processes.process_name
  Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  |`security_content_ctime(lastTime)` | `detection_of_tools_built_by_nirsoft_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: While legitimate, these NirSoft tools are prone to abuse. You
  should verfiy that the tool was used for a legitimate purpose.
references: []
tags:
  analytic_story:
  - Emotet Malware DHS Report TA18-201A
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1072
  observable:
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.parent_process
  - Processes.process_name
  - Processes.user
  risk_score: 25
  security_domain: endpoint
