name: Detect Use of cmd exe to Launch Script Interpreters
id: b89919ed-fe5f-492c-b139-95dbb162039e
version: 4
date: '2020-07-21'
author: Bhavin Patel, Mauricio Velazco, Splunk
status: production
type: TTP
description: This search looks for the execution of the cscript.exe or wscript.exe
  processes, with a parent of cmd.exe. The search will return the count, the first
  and last time this execution was seen on a machine, the user, and the destination
  of the machine
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.parent_process_name="cmd.exe" (Processes.process_name=cscript.exe
  OR Processes.process_name =wscript.exe) by Processes.parent_process Processes.process_name
  Processes.user Processes.dest | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`|`security_content_ctime(lastTime)`
  | `detect_use_of_cmd_exe_to_launch_script_interpreters_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Some legitimate applications may exhibit this behavior.
references: []
tags:
  analytic_story:
  - 'Emotet Malware  DHS Report TA18-201A '
  - Suspicious Command-Line Executions
  - Azorult
  asset_type: Endpoint
  confidence: 50
  impact: 70
  message: cmd.exe launching script interpreters on $dest$
  mitre_attack_id:
  - T1059
  - T1059.003
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.parent_process
  - Processes.user
  - Processes.dest
  risk_score: 35
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.003/cmd_spawns_cscript/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
