name: Detect Path Interception By Creation Of program exe
id: c77162d3-f93c-45cc-80c8-22f6v5264g9f
version: 3
date: '2020-07-03'
description: 'The detection Detect Path Interception By Creation Of program exe is
  detecting the abuse of unquoted service paths, which is a popular technique for
  privilege escalation. '
type: batch
references:
- https://medium.com/@SumitVerma101/windows-privilege-escalation-part-1-unquoted-service-path-c7a011a8d8ae
author: Patrick Bareiss, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=services.exe
  by Processes.user Processes.process_name Processes.process Processes.dest | `drop_dm_object_name(Processes)`
  | rex field=process "^.*\\\\(?<service_process>.*\.(?:exe|bat|com|ps1))" | eval
  process_name = lower(process_name) | eval service_process = lower(service_process)|
  where process_name != service_process | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `detect_path_interception_by_creation_of_program_exe_filter`'
known_false_positives: unknown
tags:
  analytics_story:
  - Windows Persistence Techniques
  mitre_attack_id:
  - T1574.009
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 8
  nist:
  - PR.PT
  - DE.CM
  security_domain: endpoint
  asset_type: Endpoint
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1574.009/atomic_red_team/windows-sysmon.log
