name: Detect Rundll32 Inline HTA Execution
id: 91c79f14-5b41-11eb-ae93-0242ac130002
version: 1
date: '2021-01-20'
author: Michael Haag, Splunk
type: batch
datamodel:
- Endpoint
description: The following analytic identifies "rundll32.exe" execution with inline
  protocol handlers. "JavaScript", "VBScript", and "About" are the only supported
  options when invoking HTA content directly on the command-line. This type of behavior
  is commonly observed with fileless malware or application whitelisting bypass techniques.
  The search will return the first time and last time these command-line arguments
  were used for these executions, as well as the target system, the user, process
  "rundll32.exe" and its parent process.
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  as process values(Processes.parent_process) as parent_process min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=rundll32.exe
  (Processes.process=*vbscript* OR Processes.process=*javascript* OR Processes.process=*about*)
  by Processes.user Processes.process_name Processes.parent_process_name Processes.dest  |
  `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `detect_rundll32_inline_hta_execution_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Although unlikely, some legitimate applications may exhibit
  this behavior, triggering a false positive.
references:
- https://github.com/redcanaryco/AtomicTestHarnesses
- https://redcanary.com/blog/introducing-atomictestharnesses/
- https://docs.microsoft.com/en-us/windows/win32/search/-search-3x-wds-extidx-prot-implementing
tags:
  analytic_story:
  - Suspicious MSHTA Activity
  - NOBELIUM Group
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 8
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.005/atomic_red_team/windows-sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1218.005
  nist:
  - PR.PT
  - DE.CM
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.process_name
  - Processes.user
  - Processes.dest
  - Processes.parent_process_name
  - Processes.parent_process
  security_domain: endpoint
  impact: 70
  confidence: 80
  risk_score: 56
  context:
  - Source:Endpoint
  - Stage:Initial Access
  - Stage:Execution
  - Stage:Defense Evasion
  message: Suspicious rundll32.exe inline HTA execution on $dest$
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim