name: Detect Masscan Gui Install
id: 952f15cf-8b46-4a5b-a0eb-5b0210735918
version: 1
date: '2021-05-08'
author: Rod Soto, Splunk
type: batch
datamodel:
- Endpoint
description: This query detects the install and use of Masscan_gui, an internet port scanning tool found in botnets for further expansion and and acquisition of targets.
search: `sysmon` EventCode=3 | stats values(Image) as Image values(ProcessId) as ProcessId by Computer, User, process_exec | search Image=*Masscan* | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
`| `detect_masscan_gui_install_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: Masscan gui could potentially be used for legit purposes.
references:
- https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer/
tags:
  analytic_story:
  - xmrig
  kill_chain_phases:
  - Actions on Objective
  mitre_attack_id:
  - T1570
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.computer
  - Processes.user
  - Processes.Image
  - Processes.process_id
  - Processes.process_exec
  security_domain: endpoint
