name: Detect HTML Help Renamed
id: 62fed254-513b-460e-953d-79771493a9f3
version: 3
date: '2021-09-16'
author: Michael Haag, Splunk
type: Hunting
datamodel:
- Endpoint
description: The following analytic identifies a renamed instance of hh.exe (HTML
  Help) executing a Compiled HTML Help (CHM). This particular technique will load
  Windows script code from a compiled help file. CHM files may contain nearly any
  file type embedded, but only execute html/htm. Upon a successful execution, the
  following script engines may be used for execution - JScript, VBScript, VBScript.Encode,
  JScript.Encode, JScript.Compact. Analyst may identify vbscript.dll or jscript.dll
  loading into hh.exe upon execution. The "htm" and "html" file extensions were the
  only extensions observed to be supported for the execution of Shortcut commands
  or WSH script code. During investigation, identify script content origination. Validate
  it is the legitimate version of hh.exe by reviewing the PE metadata. hh.exe is natively
  found in C:\Windows\system32 and C:\Windows\syswow64.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_hh` by Processes.dest
  Processes.user Processes.parent_process_name Processes.original_file_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `detect_html_help_renamed_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: Although unlikely a renamed instance of hh.exe will be used
  legitimately, filter as needed.
references:
- https://attack.mitre.org/techniques/T1218/001/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.001/T1218.001.md
- https://lolbas-project.github.io/lolbas/Binaries/Hh/
tags:
  analytic_story:
  - Suspicious Compiled HTML Activity
  - Living Off The Land
  asset_type: Endpoint
  cis20:
  - CIS 8
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.001/atomic_red_team/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Actions on Objectives
  message: The following $process_name$ has been identified as renamed, spawning from
    $parent_process_name$.
  mitre_attack_id:
  - T1218
  - T1218.001
  nist:
  - PR.PT
  - DE.CM
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: Computer
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 80
  security_domain: endpoint
