name: Detect NSEXE Ip Scanner Install
id: 70a7c839-7b67-40d5-85b4-59a5ea2c4eb4
version: 1
date: '2021-05-08'
author: Rod Soto, Splunk
type: batch
datamodel:
- Endpoint
description: This query detects the install of NS.EXE, an ip scanner tool found in botnets for further expansion and and acquisition of targets.
search: `sysmon` EventCode=1 | stats values(Image) as Image values(ProcessId) as ProcessId by Computer, User, process_exec | search process_exec=NS.exe | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `detect_nsexe_ip_scanner_install_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: Unknown
references:
- https://thedfirreport.com/2020/06/16/the-little-ransomware-that-couldnt-dharma/
tags:
  analytic_story:
  - xmrig
  kill_chain_phases:
  - Actions on Objective
  mitre_attack_id:
  - T1570
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.computer
  - Processes.user
  - Processes.Image
  - Processes.process_id
  - Processes.process_exec
  security_domain: endpoint
