name: Detect NLAchecker Install
id: 983d892e-33c6-463f-bd46-ad5ef826d624
version: 1
date: '2021-05-08'
author: Rod Soto, Splunk
type: batch
datamodel:
- Endpoint
description: This query detects the install of NLAchecker.exe, a scanner tool that checks for Windows hosts for Network Level Authentication. This tool allows attackers
to detect Windows Servers with RDP without NLA enabled which facilitates the use of brute force non microsoft rdp tools or exploits. 
search: `sysmon` EventCode=3 | stats values(Image) as Image values(ProcessId) as ProcessId by Computer, User, process_exec | search Image=*NLA* | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `detect_nlachecker_install_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: Unknown
references:
- https://posts.specterops.io/revisiting-remote-desktop-lateral-movement-8fb905cb46c3
tags:
  analytic_story:
  - xmrig
  kill_chain_phases:
  - Actions on Objective
  mitre_attack_id:
  - T1570
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.computer
  - Processes.user
  - Processes.Image
  - Processes.process_id
  - Processes.process_exec
  security_domain: endpoint
