name: Detect LinPeas Execution
id: 4ea6fa10-547c-11ec-a4f9-acde48001122
version: 1
date: '2021-12-03'
author: Rod Soto
type: TTP
datamodel:
- Endpoint
description: Linux local Privilege Escalation Awesome Script (linPEAS) is a script
  that searches for possible paths to escalate privileges.
search: ' `sysmon_linux` CommandLine!=null parent_process_exec=sudo OR parent_process_exec=bash
  OR CommandLine="cve-list" | stats count by Computer CommandLine user parent_process_exec
  process_path | `detect_linpeas_execution_filter`'
how_to_implement: This detection search is based on Splunk add-on for Microsoft Sysmon-Linux.
  Need to install this add-on to parse fields correctly and execute detection search.
known_false_positives: This search may produce false positives as it will display
  many sudo executed processess however, the cve-list within the command line it is
  a clear indicator, operator is searching for local vulnerabilites.
references:
- https://book.hacktricks.xyz/linux-unix/linux-privilege-escalation-checklist
- https://github.com/carlospolop/PEASS-ng/tree/master/linPEAS
- https://attack.mitre.org/matrices/enterprise/linux/
tags:
  analytic_story:
  - Linux Post-Exploitation
  confidence: 100
  context:
  - Source: endpoint
  - Stage: discovery
  dataset:
  - https://github.com/splunk/attack_data/raw/master/datasets/suspicious_behaviour/linux_post_exploitation/linpeasdataset.txt
  impact: 90
  kill_chain_phases:
  - Exploitation
  - Privilege Escalation
  message: LinPEAS post exploitation tool detected
  mitre_attack_id:
  - T1082
  - T1083
  - T1033
  - T1087
  - T1046
  - T1057
  - T1518
  - T1033
  observable:
  - name: Computer
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Computer
  - CommandLine
  - user
  - parent_process_exec
  - process_path
  risk_score: 90
  security_domain: endpoint
