name: Detect mshta exe running scripts in command-line arguments
id: b89919ed-fe5f-492c-b139-95dqb161039e
version: 3
date: '2020-07-21'
description: This search looks for the execution of "mshta.exe" with command-line
  arguments that launch a script. The search will return the first time and last time
  these command-line arguments were used for these executions, as well as the target
  system, the user, process "mshta.exe" and its parent process.
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
type: ESCU
references: []
author: Bhavin Patel, Splunk
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  as process values(Processes.parent_process) as parent_process min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=mshta.exe
  by Processes.user Processes.process_name Processes.parent_process_name Processes.dest  |
  `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`|
  search (process=*vbscript* OR process=*javascript*) | `detect_mshta_exe_running_scripts_in_command_line_arguments_filter`'
known_false_positives: Although unlikely, some legitimate applications may exhibit
  this behavior, triggering a false positive.
tags:
  analytics_story:
  - Suspicious MSHTA Activity
  mitre_attack_id:
  - T1059.003
  kill_chain_phases:
  - Exploitation
  cis20:
  - CIS 8
  nist:
  - PR.PT
  - DE.CM
  security_domain: endpoint
  asset_type: Endpoint
