name: Detect Rare Executables
id: 44fddcb2-8d3b-454c-874e-7c6de5a4f7ac
version: 3
date: '2022-11-10'
author: Bhavin Patel, Splunk
status: experimental
type: Anomaly
description: This search will return a table of processes in the a given window, remove
  process names which are in the allowed list and list out the top 30 rare processes
  discovered on different hosts.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count values(Processes.dest) as
  dest values(Processes.user) as user min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes by Processes.process_name | rename Processes.process_name
  as process | `filter_rare_process_allow_list` | sort count | head 30 | rex field=user
  "(?<user_domain>.*)\\\\(?<user_name>.*)" | `security_content_ctime(firstTime)` |
  `security_content_ctime(lastTime)` | `detect_rare_executables_filter` '
how_to_implement: To successfully implement this search, you must be ingesting data
  that records process activity from your hosts and populating the `Endpoint` data
  model with the resultant dataset. The macro `filter_rare_process_allow_list` searches
  two lookup files for allowed processes.  These consist of `rare_process_allow_list_default.csv`
  and `rare_process_allow_list_local.csv`. To add your own processes to the allow
  list, add them to `rare_process_allow_list_local.csv`. If you wish to remove an
  entry from the default lookup file, you will have to modify the macro itself to
  set the allow_list value for that process to false. You can modify the limit parameter
  and search scheduling to better suit your environment.
known_false_positives: Some legitimate processes may be only rarely executed in your
  environment. As these are identified, update `rare_process_allow_list_local.csv`
  to filter them out of your search results.
references: []
tags:
  analytic_story:
  - Unusual Processes
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.process_name
  risk_score: 25
  security_domain: endpoint
