name: Detect mshta exe running scripts in command-line arguments
id: b89919ed-fe5f-492c-b139-95dqb161039e
version: 5
date: '2020-11-09'
description: The following analytic identifies "mshta.exe" execution with inline
  protocol handlers. "JavaScript", "VBScript", and "About" are the only supported
  options when invoking HTA content directly on the command-line. The search will 
  return the first time and last time these command-line arguments were used for 
  these executions, as well as the target system, the user, process "mshta.exe" 
  and its parent process.
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
type: ESCU
references:
- https://github.com/redcanaryco/AtomicTestHarnesses
- https://redcanary.com/blog/introducing-atomictestharnesses/
author: Bhavin Patel, Splunk
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  as process values(Processes.parent_process) as parent_process min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=mshta.exe
  (Processes.process=*vbscript* OR Processes.process=*javascript* OR Processes.process=*about*) by Processes.user
  Processes.process_name Processes.parent_process_name Processes.dest  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`| search
  (process=*vbscript* OR process=*javascript* OR process=*about*) | `detect_mshta_exe_running_scripts_in_command_line_arguments_filter`'
known_false_positives: Although unlikely, some legitimate applications may exhibit
  this behavior, triggering a false positive.
tags:
  analytics_story:
  - Suspicious MSHTA Activity
  mitre_attack_id:
  - T1218.005
  kill_chain_phases:
  - Exploitation
  cis20:
  - CIS 8
  nist:
  - PR.PT
  - DE.CM
  security_domain: endpoint
  asset_type: Endpoint
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.005/atomic_red_team/windows-sysmon.log
