name: Disable Schedule Task
id: db596056-3019-11ec-a9ff-acde48001122
version: 1
date: '2021-10-18'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This analytic is to detect a suspicious commandline to disable existing
  schedule task. This technique is used by adversaries or commodity malware like IceID
  to disable security application (AV products) in the targetted host to evade detections.
  This TTP is a good pivot to check further why and what other process run before
  and after this detection. check which process execute the commandline and what task
  is disabled. parent child process is quite valuable in this scenario too.
search: '| tstats `security_content_summariesonly` count  min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=schtasks.exe
  Processes.process=*/change*  Processes.process=*/disable* by Processes.user Processes.process_name
  Processes.process Processes.parent_process_name Processes.parent_process Processes.dest
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `disable_schedule_task_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: admin may disable problematic schedule task
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
tags:
  analytic_story:
  - IcedID
  - Living Off The Land
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/disable_schtask/sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: schtask process with commandline $process$ to disable schedule task in
    $dest$
  mitre_attack_id:
  - T1562.001
  - T1562
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.user
  - Processes.process_name
  - Processes.parent_process_name
  - Processes.dest
  risk_score: 56
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
