name: Disable Windows App Hotkeys
id: 1490f224-ad8b-11eb-8c4f-acde48001122
version: 4
date: '2023-04-27'
author: Steven Dick, Teoderick Contreras, Splunkk
status: production
type: TTP
description: This analytic detects a suspicious registry modification to disable Windows
  hotkey (shortcut keys) for native Windows applications. This technique is commonly
  used to disable certain or several Windows applications like `taskmgr.exe` and `cmd.exe`.
  This technique is used to impair the analyst in analyzing and removing the attacker
  implant in compromised systems.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  WHERE (Registry.registry_path="*\\Windows NT\\CurrentVersion\\Image File Execution
  Options\\*" AND Registry.registry_value_data= "HotKey Disabled" AND Registry.registry_value_name
  = "Debugger") BY _time span=1h Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.registry_value_data Registry.process_guid
  | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `disable_windows_app_hotkeys_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the registry value name, registry path, and registry value data from your
  endpoints. If you are using Sysmon, you must have at least version 2.0 of the offical
  Sysmon TA. https://splunkbase.splunk.com/app/5709
known_false_positives: unknown
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
tags:
  analytic_story:
  - XMRig
  - Windows Registry Abuse
  asset_type: Endpoint
  confidence: 100
  impact: 40
  message: Disabled 'Windows App Hotkeys' on $dest$
  mitre_attack_id:
  - T1562.001
  - T1562
  - T1112
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.dest
  - Registry.registry_value_name
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.registry_value_data
  - Registry.process_guidr
  risk_score: 40
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.001/hotkey_disabled_hidden_user/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
