name: Disabling Remote User Account Control
id: bbc644bc-37df-4e1a-9c88-ec9a53e2038c
version: 5
date: '2024-05-18'
author: David Dorsey, Patrick Bareiss, Splunk
status: production
type: TTP
description: The following analytic identifies modifications to the registry key that
  controls the enforcement of Windows User Account Control (UAC). It detects changes
  to the registry path `HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\EnableLUA`
  where the value is set to `0x00000000`. This activity is significant because disabling
  UAC can allow unauthorized changes to the system without user consent, potentially
  leading to privilege escalation. If confirmed malicious, an attacker could gain
  elevated privileges, making it easier to execute further attacks or maintain persistence
  within the environment.
data_source:
- Sysmon EventID 12
- Sysmon EventID 13
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path=*HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\EnableLUA*
  Registry.registry_value_data="0x00000000" by Registry.dest, Registry.registry_key_name
  Registry.user Registry.registry_path Registry.registry_value_data Registry.action
  | `drop_dm_object_name(Registry)` | `disabling_remote_user_account_control_filter`'
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black, or via other endpoint data sources, such as Sysmon.
  The data used for this search is typically generated via logs that report registry
  modifications.
known_false_positives: This registry key may be modified via administrators to implement
  a change in system policy. This type of change should be a very rare occurrence.
references: []
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Suspicious Windows Registry Activities
  - Remcos
  - Windows Registry Abuse
  - Azorult
  - AgentTesla
  asset_type: Endpoint
  confidence: 60
  impact: 70
  message: The Windows registry keys that control the enforcement of Windows User
    Account Control (UAC) were modified on $dest$ by $user$.
  mitre_attack_id:
  - T1548.002
  - T1548
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_path
  - Registry.registry_value_name
  - Registry.dest
  - Registry.registry_key_name
  - Registry.user
  - Registry.action
  risk_score: 42
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548.002/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
