name: Disable Schedule Task
id: db596056-3019-11ec-a9ff-acde48001122
version: 1
date: '2021-10-18'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: This analytic is to detect a suspicious commandline to disable existing
  schedule task. This technique is used by adversaries or commodity malware like IcedID
  to disable security application (AV products) in the targetted host to evade detections.
  This TTP is a good pivot to check further why and what other process run before
  and after this detection. check which process execute the commandline and what task
  is disabled. parent child process is quite valuable in this scenario too.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count  min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=schtasks.exe
  Processes.process=*/change*  Processes.process=*/disable* by Processes.user Processes.process_name
  Processes.process Processes.parent_process_name Processes.parent_process Processes.dest
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `disable_schedule_task_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: admin may disable problematic schedule task
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
tags:
  analytic_story:
  - IcedID
  - Living Off The Land
  asset_type: Endpoint
  confidence: 80
  impact: 70
  message: schtask process with commandline $process$ to disable schedule task in
    $dest$
  mitre_attack_id:
  - T1562.001
  - T1562
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.user
  - Processes.process_name
  - Processes.parent_process_name
  - Processes.dest
  risk_score: 56
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/disable_schtask/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
