name: Disabling Windows Local Security Authority Defences via Registry
id: 45cd08f8-a2c9-4f4e-baab-e1a0c624b0ab
version: 3
date: '2024-05-19'
author: Dean Luxton
status: production
type: TTP
data_source:
- Sysmon Event ID 13
description: The following analytic identifies the deletion of registry keys that
  disable Local Security Authority (LSA) protection and Microsoft Defender Device
  Guard. It leverages data from Endpoint Detection and Response (EDR) agents, focusing
  on registry actions and paths associated with LSA and Device Guard settings. This
  activity is significant because disabling these defenses can leave a system vulnerable
  to various attacks, including credential theft and unauthorized code execution.
  If confirmed malicious, this action could allow attackers to bypass critical security
  mechanisms, leading to potential system compromise and persistent access.
search: '| tstats `security_content_summariesonly` min(_time) as _time from datamodel=Endpoint.Registry
  where Registry.registry_path IN ("*\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\LsaCfgFlags",
  "*\\SOFTWARE\\Policies\\Microsoft\\Windows\\DeviceGuard\\*", "*\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\RunAsPPL")
  Registry.action IN (deleted, unknown) by Registry.action Registry.registry_path
  Registry.process_guid Registry.dest Registry.user| `drop_dm_object_name(Registry)`
  | join type=outer process_guid [| tstats `security_content_summariesonly` count
  FROM datamodel=Endpoint.Processes by Processes.user Processes.process_name Processes.process
  Processes.dest Processes.parent_process_name Processes.parent_process Processes.process_guid
  | `drop_dm_object_name(Processes)`] | table _time action dest user parent_process_name
  parent_process process_name process process_guid registry_path | `disabling_windows_local_security_authority_defences_via_registry_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Potential to be triggered by an administrator disabling protections
  for troubleshooting purposes.
references:
- https://docs.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/configuring-additional-lsa-protection
- https://docs.microsoft.com/en-us/windows/security/identity-protection/credential-guard/credential-guard-manage
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Windows Registry Abuse
  asset_type: Endpoint
  confidence: 100
  impact: 60
  message: An attempt to disable Windows LSA defences was detected on $dest$. The
    reg key $registry_path$ was deleted by $user$.
  mitre_attack_id:
  - T1556
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.action
  - Registry.registry_path
  - Registry.dest
  - Registry.user
  risk_score: 60
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1556/disable_lsa_protection/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
