name: Disabling Net User Account
id: c0325326-acd6-11eb-98c2-acde48001122
version: 3
date: '2024-05-23'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: The following analytic detects the use of the `net.exe` utility to disable
  a user account via the command line. It leverages data from Endpoint Detection and
  Response (EDR) agents, focusing on process execution logs and command-line arguments.
  This activity is significant as it may indicate an adversary's attempt to disrupt
  user availability, potentially as a precursor to further malicious actions. If confirmed
  malicious, this could lead to denial of service for legitimate users, aiding the
  attacker in maintaining control or covering their tracks.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  values(Processes.parent_process) as parent_process values(Processes.process_id)
  as process_id count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where `process_net` AND Processes.process="*user*" AND Processes.process="*/active:no*"
  by  Processes.process_name Processes.original_file_name Processes.dest Processes.user
  Processes.parent_process_name | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `disabling_net_user_account_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: unknown
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
tags:
  analytic_story:
  - XMRig
  asset_type: Endpoint
  confidence: 60
  impact: 70
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    disabling a user account on endpoint $dest$ by user $user$.
  mitre_attack_id:
  - T1531
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 42
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/xmrig_miner/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
