author: Teoderick Contreras, Splunk
datamodel:
- Endpoint
date: '2021-10-18'
description: This analytic is to detect a suspicious modification of registry to disable
  windows defender feature. This technique is to bypassed or evade detection from
  Windows Defender AV product specially the Enhanced Notification feature wher user
  or admin set to show or display alerts.
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the registry value name, registry path, and registry value data executions
  from your endpoints. If you are using Sysmon, you must have at least version 6.0.4
  of the Sysmon TA.
id: dc65678c-301f-11ec-8e30-acde48001122
known_false_positives: user may choose to disable windows defender AV
name: Disable Defender Enhanced Notification
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Registry where Registry.registry_path = "*Microsoft\\Windows
  Defender\\Reporting*" Registry.registry_value_name = DisableEnhancedNotifications
  Registry.registry_value_data = 0x00000001 by Registry.dest Registry.user Registry.registry_path
  Registry.registry_value_name Registry.registry_value_data | `drop_dm_object_name(Registry)`
  | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` | `disable_defender_enhanced_notification_filter`'
tags:
  analytic_story:
  - IceID
  automated_detection_testing: passed
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/disable_av/sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: modified/added/deleted registry entry $registry_path$ in $dest$
  mitre_attack_id:
  - T1562.001
  - T1562
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: user
    role:
    - Victim
    type: user
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Registry.dest
  - Registry.registry_path
  - Registry.registry_value_data
  - Registry.registry_value_name
  - Registry.user
  - _time
  risk_score: 49
  security_domain: endpoint
type: TTP
version: 1
