name: Disable Defender MpEngine Registry
id: cc391750-3024-11ec-955a-acde48001122
version: 1
date: '2021-10-18'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This particular behavior is typically executed when an adversaries or
  malware gains access to an endpoint and beings to perform execution and to evade
  detections. Usually, a batch (.bat) will be executed and multiple registry and scheduled
  task modifications will occur. During triage, review parallel processes and identify
  any further file modifications. Endpoint should be isolated.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Registry where Registry.registry_path = "*\\Policies\\Microsoft\\Windows
  Defender\\MpEngine*" Registry.registry_value_name = MpEnablePus Registry.registry_value_data
  = 0x00000000 by Registry.dest Registry.user Registry.registry_path Registry.registry_value_name
  Registry.registry_value_data | `drop_dm_object_name(Registry)` | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)` | `disable_defender_mpengine_registry_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the registry value name, registry path, and registry value data from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: admin or user may choose to disable windows defender product
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
tags:
  analytic_story:
  - IceID
  automated_detection_testing: passed
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/disable_av/sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: modified/added/deleted registry entry $registry_path$ in $dest$
  mitre_attack_id:
  - T1562.001
  - T1562
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: user
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.dest
  - Registry.user
  - Registry.registry_value_name
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.registry_value_data
  risk_score: 49
  security_domain: endpoint
  cim_version: 5.0.0
  tas_with_cim_mapping:
  - Splunk_TA_microsoft_sysmon
  supported_tas:
  - Splunk_TA_microsoft_sysmon
