author: Teoderick Contreras, Splunk
datamodel:
- Endpoint
date: '2021-06-22'
description: this search is to identify modification in registry to disable ETW windows
  feature to evade detections. This technique was seen in several ransomware, RAT
  and even APT to impaire defenses of the compromise machine and to be able to execute
  payload with minimal alert as much as possible.
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node. Also make sure
  that this registry was included in your config files ex. sysmon config to be monitored.
id: f0eacfa4-d33f-11eb-8f9d-acde48001122
known_false_positives: network operator may disable this feature of windows but not
  so common.
name: Disable ETW Through Registry
references:
- https://app.any.run/tasks/c0f98850-af65-4352-9746-fbebadee4f05/
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Registry where Registry.registry_path= "*\\SOFTWARE\\Microsoft\\.NETFramework\\ETWEnabled"
  Registry.registry_value_data = "0x00000000" by Registry.registry_path Registry.registry_key_name
  Registry.registry_value_data Registry.dest | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)`
  |`security_content_ctime(lastTime)` | `disable_etw_through_registry_filter`'
tags:
  analytic_story:
  - Ransomware
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/ransomware_ttp/data2/windows-sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1562.001
  - T1562
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Registry.dest
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.registry_value_data
  - _time
  security_domain: endpoint
type: TTP
version: 1
