name: Disable UAC Remote Restriction
id: 9928b732-210e-11ec-b65e-acde48001122
version: 4
date: '2023-12-27'
author: Steven Dick, Teoderick Contreras, Splunk
status: production
type: TTP
description: This analytic is to detect a suspicious modification of registry to disable
  UAC remote restriction. This technique was well documented in Microsoft page where
  attacker may modify this registry value to bypassed UAC feature of windows host.
  This is a good indicator that some tries to bypassed UAC to suspicious process or
  gain privilege escalation.
data_source:
- Sysmon EventID 12
- Sysmon EventID 13
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  WHERE (Registry.registry_path="*\\CurrentVersion\\Policies\\System*" Registry.registry_value_name="LocalAccountTokenFilterPolicy"
  Registry.registry_value_data="0x00000001"  ) BY _time span=1h Registry.user Registry.dest
  Registry.registry_path Registry.registry_key_name Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid | `drop_dm_object_name(Registry)`| where isnotnull(registry_value_data)
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `disable_uac_remote_restriction_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the registry value name, registry path, and registry value data from your
  endpoints. If you are using Sysmon, you must have at least version 2.0 of the offical
  Sysmon TA. https://splunkbase.splunk.com/app/5709
known_false_positives: admin may set this policy for non-critical machine.
references:
- https://docs.microsoft.com/en-us/troubleshoot/windows-server/windows-security/user-account-control-and-remote-restriction
tags:
  analytic_story:
  - Suspicious Windows Registry Activities
  - Windows Defense Evasion Tactics
  - CISA AA23-347A
  - Windows Registry Abuse
  asset_type: Endpoint
  confidence: 100
  impact: 80
  message: Modified/added/deleted registry entry $registry_path$ in $dest$
  mitre_attack_id:
  - T1548.002
  - T1548
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.dest
  - Registry.registry_value_name
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.registry_value_data
  - Registry.process_guid
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548.002/LocalAccountTokenFilterPolicy/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
