author: Teoderick Contreras, Splunk
datamodel:
- Endpoint.Processes
- Endpoint.Registry
date: '2022-01-26'
description: This particular behavior is typically executed when an adversaries or
  malware gains access to an endpoint and beings to perform execution and to evade
  detections. Usually, a batch (.bat) will be executed and multiple registry and scheduled
  task modifications will occur. During triage, review parallel processes and identify
  any further file modifications. Endpoint should be isolated.
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the registry value name, registry path, and registry value data from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
id: aa4f695a-3024-11ec-9987-acde48001122
known_false_positives: admin or user may choose to disable windows defender product
name: Disable Defender AntiVirus Registry
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
search: '| tstats `security_content_summariesonly` count from datamodel=Endpoint.Registry
  where Registry.registry_path = "*\\Policies\\Microsoft\\Windows Defender*" Registry.registry_value_name
  = DisableAntiVirus Registry.registry_value_data = 0x00000001 by _time span=1h Registry.dest
  Registry.user Registry.registry_path Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid | `drop_dm_object_name(Registry)` |rename process_guid as
  proc_guid |join proc_guid, _time [| tstats `security_content_summariesonly` count
  FROM datamodel=Endpoint.Processes by _time span=1h Processes.process_id Processes.process_name
  Processes.process Processes.dest Processes.parent_process_name Processes.parent_process
  Processes.process_guid | `drop_dm_object_name(Processes)` |rename process_guid as
  proc_guid | fields _time dest user parent_process_name parent_process process_name
  process_path process proc_guid registry_path registry_value_name registry_value_data]
  | table _time dest user parent_process_name parent_process process_name process_path
  process proc_guid registry_path registry_value_name registry_value_data | `disable_defender_antivirus_registry_filter`'
tags:
  analytic_story:
  - IceID
  automated_detection_testing: passed
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/disable_av/sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: modified/added/deleted registry entry $registry_path$ in $dest$
  mitre_attack_id:
  - T1562.001
  - T1562
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: user
    role:
    - Victim
    type: user
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_guid
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Registry.dest
  - Endpoint.Registry.process_guid
  - Endpoint.Registry.registry_path
  - Endpoint.Registry.registry_value_data
  - Endpoint.Registry.registry_value_name
  - Endpoint.Registry.user
  - _time
  risk_score: 49
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
type: TTP
version: 2
