author: Teoderick Contreras, Mauricio Velazco, Splunk
datamodel:
- Endpoint
date: '2021-03-31'
description: The following analytic is to identify a modification in the Windows registry
  to prevent users from seeing all the files with hidden attributes. This event or
  techniques are known on some worm and trojan spy malware that will drop hidden files
  on the infected machine.
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node. Also make sure
  that this registry was included in your config files ex. sysmon config to be monitored.
id: 6f3ccfa2-91fe-11eb-8f9b-acde48001122
known_false_positives: unknown
name: Disable Show Hidden Files
references:
- https://www.sophos.com/en-us/threat-center/threat-analyses/viruses-and-spyware/W32~Tiotua-P/detailed-analysis.aspx
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Registry where (Registry.registry_path= "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced\\Hidden"
  OR Registry.registry_path= "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced\\HideFileExt"
  Registry.registry_value_data = "0x00000001") OR (Registry.registry_path= "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced\\ShowSuperHidden"
  Registry.registry_value_data = "0x00000000") by Registry.registry_path Registry.registry_key_name
  Registry.registry_value_data Registry.dest | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)`
  |`security_content_ctime(lastTime)` | `disable_show_hidden_files_filter`'
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  automated_detection_testing: passed
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.001/win_app_defender_disabling/windows-security.log
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.001/win_app_defender_disabling/windows-system.log
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.001/win_app_defender_disabling/windows-sysmon.log
  impact: 40
  kill_chain_phases:
  - Exploitation
  message: Disabled 'Show Hidden Files' on $dest$
  mitre_attack_id:
  - T1564.001
  - T1562.001
  - T1564
  - T1562
  observable:
  - name: dest
    role:
    - Victim
    type: Endpoint
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Registry.dest
  - Endpoint.Registry.registry_key_name
  - Endpoint.Registry.registry_path
  - Endpoint.Registry.registry_value_data
  - _time
  risk_score: 40
  security_domain: endpoint
type: TTP
version: 1
