name: DNS Exfiltration Using Nslookup App
id: 2452e632-9e0d-11eb-bacd-acde48001122
version: 1
date: '2021-04-15'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: this search is to detect potential DNS exfiltration using nslookup application.
  This technique are seen in couple of malware and APT group to exfiltrated collected
  data in a infected machine or infected network. This detection is looking for unique
  use of nslookup where it tries to use specific record type, TXT, A, AAAA, that are
  commonly used by attacker and also the retry parameter which is designed to query
  C2 DNS multiple tries.
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  values(Processes.process_id) as process_id values(Processes.parent_process) as parent_process
  count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process_name = "nslookup.exe" Processes.process = "*-querytype=*"
  OR Processes.process="*-qt=*" OR Processes.process="*-q=*" OR Processes.process="-type=*"
  OR Processes.process="*-retry=*" by Processes.dest Processes.user Processes.process_name  |
  `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `dns_exfiltration_using_nslookup_app_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. Tune and filter known instances of nslookup.exe may be used.
known_false_positives: admin nslookup usage
references:
- https://www.fireeye.com/blog/threat-research/2017/03/fin7_spear_phishing.html
- https://www.varonis.com/blog/dns-tunneling/
- https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
tags:
  analytic_story:
  - Suspicious DNS Traffic
  - Dynamic DNS
  - Command and Control
  - Data Exfiltration
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1048.003/nslookup_exfil/windows-sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1048
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name #parent process name
  - Processes.parent_process #parent cmdline
  - Processes.original_file_name
  - Processes.process_name #process name
  - Processes.process #process cmdline
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  security_domain: endpoint
  impact: 90
  confidence: 80
  # (impact * confidence)/100
  risk_score: 72
  context:
  - Source:Endpoint
  - Stage:Exfiltration
  message: An instance of $parent_process_name$ spawning $process_name$ was identified on endpoint $dest$ by user $user$ performing activity related to DNS exfiltration.
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Parent Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process