name: Domain Account Discovery with Dsquery
id: b1a8ce04-04c2-11ec-bea7-acde48001122
version: 1
date: '2021-08-24'
author: Teoderick Contreras, Mauricio Velazco, Splunk
type: Hunting
datamodel:
- Endpoint
description: This analytic looks for the execution of `dsquery.exe` with command-line
  arguments utilized to discover  domain users. The `user` argument returns a list
  of all users registered in the domain. Red Teams and adversaries alike engage in
  remote system discovery for situational awareness and Active Directory Discovery.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name="dsquery.exe"
  AND Processes.process = "*user*" by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  Processes.parent_process_name | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `domain_account_discovery_with_dsquery_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: Administrators or power users may use this command for troubleshooting.
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/dsquery.htm
- https://attack.mitre.org/techniques/T1087/002/
tags:
  analytic_story:
  - Active Directory Discovery
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Discovery
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1087.002/AD_discovery/windows-sysmon.log
  impact: 50
  kill_chain_phases:
  - Reconnaissance
  message: an instance of process $process_name$ with commandline $process$ in $dest$
  mitre_attack_id:
  - T1087.002
  - T1087
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  - Processes.parent_process_name
  risk_score: 25
  security_domain: endpoint
  asset_type: Endpoint
