name: Download Files Using Telegram
id: 58194e28-ae5e-11eb-8912-acde48001122
version: 1
date: '2021-05-06'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: The following analytic will identify a suspicious download by the Telegram
  application on a Windows system. This behavior was identified on a honeypot where
  the adversary gained access, installed Telegram and followed through with downloading
  different network scanners (port, bruteforcer, masscan) to the system and later
  used to mapped the whole network and further move laterally.
search: '`sysmon` EventCode= 15 process_name = "telegram.exe" TargetFilename = "*:Zone.Identifier"
  |stats count min(_time) as firstTime max(_time) as lastTime by Computer EventCode
  Image process_id TargetFilename Hash | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `download_files_using_telegram_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name and TargetFilename from your endpoints or Events that
  monitor filestream events which is happened when process download something. (EventCode
  15) If you are using Sysmon, you must have at least version 6.0.4 of the Sysmon
  TA.
known_false_positives: normal download of file in telegram app. (if it was a common
  app in network)
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
tags:
  analytic_story:
  - XMRig
  automated_detection_testing: passed
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/minergate/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: Suspicious files were downloaded with the Telegram application on $dest$
    by $user$.
  mitre_attack_id:
  - T1105
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: Computer
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Computer
  - EventCode
  - Image
  - process_id
  - TargetFilename
  - Hash
  risk_score: 49
  security_domain: endpoint
