name: DSQuery Domain Discovery
id: cc316032-924a-11eb-91a2-acde48001122
version: 2
date: '2024-05-31'
author: Michael Haag, Splunk
status: production
type: TTP
description: 'The following analytic detects the execution of "dsquery.exe" with arguments
  targeting `TrustedDomain` queries directly from the command line. This behavior
  is identified using Endpoint Detection and Response (EDR) telemetry, focusing on
  process names and command-line arguments. This activity is significant as it often
  indicates domain trust discovery, a common step in lateral movement or privilege
  escalation by adversaries. If confirmed malicious, this could allow attackers to
  map domain trusts, potentially leading to further exploitation and unauthorized
  access to trusted domains.'
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=dsquery.exe
  Processes.process=*trustedDomain* by Processes.dest Processes.user Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `dsquery_domain_discovery_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Limited false positives. If there is a true false positive,
  filter based on command-line or parent process.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1482/T1482.md
- https://blog.harmj0y.net/redteaming/a-guide-to-attacking-domain-trusts/
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/cc732952(v=ws.11)
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/cc754232(v=ws.11)
tags:
  analytic_story:
  - Domain Trust Discovery
  - Active Directory Discovery
  asset_type: Endpoint
  confidence: 90
  impact: 80
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    performing domain discovery on endpoint $dest$ by user $user$.
  mitre_attack_id:
  - T1482
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 72
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1482/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
