name: Dump LSASS via procdump
id: 3742ebfe-64c2-11eb-ae93-0242ac130002
version: 1
date: '2021-02-01'
author: Michael Haag, Splunk
type: batch
datamodel:
- Endpoint
description: 'Detect procdump.exe dumping the lsass process. This query looks for
  both -mm and -ma usage. -mm will produce a mini dump file and -ma will write a dump
  file with all process memory. Both are highly suspect and should be reviewed. This
  query does not monitor for the internal name (OriginalFileName=procdump) of the
  PE or look for procdump64.exe. Modify the query as needed.\

  During triage, confirm this is procdump.exe executing. If it is the first time a
  Sysinternals utility has been ran, it is possible there will be a -accepteula on
  the command line. Review other endpoint data sources for cross process (injection)
  into lsass.exe.'
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=procdump.exe
  OR Processes.process_name=procdump64.exe (Processes.process=*-ma* OR Processes.process=*-mm*)
  Processes.process=*lsass* by Processes.user Processes.process_name Processes.process
  Processes.dest | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `dump_lsass_via_procdump_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: None identified.
references:
- https://attack.mitre.org/techniques/T1003/001/
- https://docs.microsoft.com/en-us/sysinternals/downloads/procdump
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.001/T1003.001.md#atomic-test-2---dump-lsassexe-memory-using-procdump
tags:
  analytic_story:
  - Credential Dumping
  - HAFNIUM Group
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.001/atomic_red_team/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Actions on Objectives
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    attempting to dump lsass.exe on endpoint $dest$ by user $user$.
  mitre_attack_id:
  - T1003.001
  nist:
  - DE.CM
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Parent Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 80
  security_domain: endpoint
