name: Dump LSASS via comsvcs DLL
id: 8943b567-f14d-4ee8-a0bb-2121d4ce3184
version: 1
date: '2020-02-21'
description: Detect the usage of comsvcs.dll for dumping the lsass process.
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints, to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
type: ESCU
references:
- https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/
- https://twitter.com/SBousseaden/status/1167417096374050817
author: Patrick Bareiss, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=rundll32.exe
  Processes.process=*comsvcs.dll* Processes.process=*MiniDump* by Processes.user Processes.process_name
  Processes.process Processes.dest | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `dump_lsass_via_comsvcs_dll_filter`'
known_false_positives: None identified.
tags:
  analytics_story:
  - Credential Dumping
  - Suspicious Rundll32 Activity
  mitre_attack_id:
  - T1003.001
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  nist:
  - DE.CM
  security_domain: endpoint
  asset_type: Endpoint
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.001/atomic_red_team/windows-sysmon.log
