name: Enable RDP In Other Port Number
id: 99495452-b899-11eb-96dc-acde48001122
version: 2
date: '2022-01-28'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This search is to detect a modification to registry to enable rdp to
  a machine with different port number. This technique was seen in some atttacker
  tries to do lateral movement and remote access to a compromised machine to gain
  control of it.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path="*HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal
  Server\\WinStations\\RDP-Tcp*" Registry.registry_value_name = "PortNumber" by _time
  span=1h Registry.dest Registry.user Registry.registry_path Registry.registry_value_name
  Registry.process_guid Registry.registry_key_name | `drop_dm_object_name(Registry)`
  |rename process_guid as proc_guid |join proc_guid, _time [| tstats `security_content_summariesonly`
  count FROM datamodel=Endpoint.Processes by _time span=1h Processes.process_id Processes.process_name
  Processes.process Processes.dest Processes.parent_process_name Processes.parent_process
  Processes.process_guid | `drop_dm_object_name(Processes)` |rename process_guid as
  proc_guid | fields _time dest user parent_process_name parent_process process_name
  process_path process proc_guid registry_path registry_value_name registry_value_data
  registry_key_name] | table _time dest user parent_process_name parent_process process_name
  process_path process proc_guid registry_path registry_value_name registry_value_data
  registry_key_name | `enable_rdp_in_other_port_number_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: unknown
references:
- https://www.mvps.net/docs/how-to-secure-remote-desktop-rdp/
tags:
  analytic_story:
  - Prohibited Traffic Allowed or Protocol Mismatch
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/honeypots/casper/datasets1/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: RDP was moved to a non-standard port on $dest$ by $user$.
  mitre_attack_id:
  - T1021
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_path
  - Registry.dest
  - Registry.user
  - Registry.registry_value_name
  risk_score: 80
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
