name: ETW Registry Disabled
id: 8ed523ac-276b-11ec-ac39-acde48001122
version: 1
date: '2021-10-07'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This analytic is to detect a registry modification to disable ETW feature
  of windows. This technique is to evade EDR appliance to evade detections and hide
  its execution from audit logs.
search: '| tstats `security_content_summariesonly` count  min(_time) as firstTime
  max(_time) as lastTime FROM datamodel=Endpoint.Registry where (Registry.registry_path="*\\SOFTWARE\\Microsoft\\.NETFramework*")
  Registry.registry_value_name = ETWEnabled Registry.registry_value_data=0x00000000
  by Registry.dest Registry.user Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.registry_value_data | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)` | `etw_registry_disabled_filter`'
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
known_false_positives: unknown
references:
- https://gist.github.com/Cyb3rWard0g/a4a115fd3ab518a0e593525a379adee3
tags:
  analytic_story:
  - Windows Persistence Techniques
  - Windows Privilege Escalation
  automated_detection_testing: passed
  confidence: 100
  context:
  - source:endpoint
  - stage:Privilege Escalation Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1127/etw_disable/sysmon.log
  impact: 90
  kill_chain_phases:
  - Exploitation
  message: modified/added/deleted registry entry $Registry.registry_path$ in $dest$
  mitre_attack_id:
  - T1562.006
  - T1127
  - T1562
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: user
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.dest
  - Registry.user
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.registry_value_name
  - Registry.registry_value_data
  risk_score: 90
  security_domain: endpoint
  cim_version: 5.0.0
  supported_tas:
  - Splunk_TA_microsoft_sysmon
