name: Eventvwr UAC Bypass
id: 9cf8fe08-7ad8-11eb-9819-acde48001122
version: 2
date: '2022-01-28'
author: Michael Haag, Splunk
type: TTP
datamodel:
- Endpoint
description: The following search identifies Eventvwr bypass by identifying the registry
  modification into a specific path that eventvwr.msc looks to (but is not valid)
  upon execution. A successful attack will include a suspicious command to be executed
  upon eventvwr.msc loading. Upon triage, review the parallel processes that have
  executed. Identify any additional registry modifications on the endpoint that may
  look suspicious. Remediate as necessary.
search: '| tstats `security_content_summariesonly` count values(Registry.registry_key_name)
  as registry_key_name values(Registry.registry_path) as registry_path min(_time)
  as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Registry where  Registry.registry_path="*mscfile\\shell\\open\\command\\*"
  by _time span=1h Registry.dest Registry.user Registry.registry_path Registry.registry_value_name
  Registry.process_guid Registry.registry_key_name Registry.registry_value_data |
  `drop_dm_object_name(Registry)` |rename process_guid as proc_guid |join proc_guid,
  _time [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  by _time span=1h Processes.process_id Processes.process_name Processes.process Processes.dest
  Processes.parent_process_name Processes.parent_process Processes.process_guid |
  `drop_dm_object_name(Processes)` |rename process_guid as proc_guid | fields _time
  dest user parent_process_name parent_process process_name process_path process proc_guid
  registry_path registry_value_name registry_value_data registry_key_name] | table
  _time dest user parent_process_name parent_process process_name process_path process
  proc_guid registry_path registry_value_name registry_value_data registry_key_name
  | `eventvwr_uac_bypass_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node.
known_false_positives: Some false positives may be present and will need to be filtered.
references:
- https://blog.malwarebytes.com/malwarebytes-news/2021/02/lazyscripter-from-empire-to-double-rat/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1548.002/T1548.002.md
- https://attack.mitre.org/techniques/T1548/002
- https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - IcedID
  - Living Off The Land
  - Windows Registry Abuse
  automated_detection_testing: passed
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548.002/atomic_red_team/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: Registry values were modified to bypass UAC using Event Viewer on $dest$
    by $user$.
  mitre_attack_id:
  - T1548.002
  - T1548
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.user
  - Registry.dest
  - Registry.registry_value_name
  risk_score: 80
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
