name: Excessive File Deletion In WinDefender Folder
id: b5baa09a-7a05-11ec-8da4-acde48001122
version: 2
date: '2024-03-05'
author: Teoderick Contreras, Splunk, Steven Dick
status: production
type: TTP
description: This analytic will identify excessive file deletion events in the Windows
  Defender folder. This technique was seen in the WhisperGate malware campaign in
  which adversaries abused Nirsofts advancedrun.exe to gain administrative privilege
  to then execute PowerShell commands to delete files within the Windows Defender
  application folder. This behavior is a good indicator the offending process is trying
  to corrupt a Windows Defender installation.
data_source:
- Sysmon Event ID 23
- Sysmon Event ID 26
search: '`sysmon` EventCode IN ("23","26") TargetFilename = "*\\ProgramData\\Microsoft\\Windows Defender\\*"
| stats count, values(TargetFilename) as deleted_files, min(_time) as firstTime, max(_time) as lastTime by user, dest, signature, signature_id, Image, process_name, process_guid
| rename Image as process
| where count >=50
| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)` 
| `excessive_file_deletion_in_windefender_folder_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting logs with the process name, TargetFilename, and ProcessID executions from your endpoints. If you are using Sysmon, you must have at least version 2.0 of the Sysmon TA.
known_false_positives: Windows Defender AV updates may cause this alert. Please update the filter macros to remove false positives.
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
  analytic_story:
  - Data Destruction
  - WhisperGate
  - BlackByte Ransomware
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: $process_name$ deleted $count$ files from the Windows Defender folder on host $dest$
  mitre_attack_id:
  - T1485
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: deleted_files
    type: File Name
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - TargetFilename
  - user 
  - dest
  - signature
  - signature_id
  - Image
  - process_name
  - process_path
  - process_guid
  risk_score: 25
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1485/excessive_file_del_in_windefender_dir/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
