name: Excel Spawning Windows Script Host
id: 57fe880a-9be3-11eb-9bf3-acde48001122
version: 3
date: '2024-05-20'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic identifies instances where Microsoft Excel spawns
  Windows Script Host processes (`cscript.exe` or `wscript.exe`). This behavior is
  detected using Endpoint Detection and Response (EDR) telemetry, focusing on process
  creation events where the parent process is `excel.exe`. This activity is significant
  because it is uncommon and often associated with malicious actions, such as spearphishing
  attacks. If confirmed malicious, this could allow an attacker to execute scripts,
  potentially leading to code execution, data exfiltration, or further system compromise.
  Immediate investigation and mitigation are recommended.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.parent_process_name="excel.exe" Processes.process_name IN ("cscript.exe",
  "wscript.exe")  by Processes.parent_process Processes.parent_process_name Processes.process_name
  Processes.user Processes.dest | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`|`security_content_ctime(lastTime)`
  | `excel_spawning_windows_script_host_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: False positives should be limited, but if any are present,
  filter as needed. In some instances, `cscript.exe` is used for legitimate business
  practices.
references:
- https://app.any.run/tasks/8ecfbc29-03d0-421c-a5bf-3905d29192a2/
- https://attack.mitre.org/techniques/T1566/001/
tags:
  analytic_story:
  - Spearphishing Attachments
  asset_type: Endpoint
  confidence: 100
  impact: 80
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$, indicating potential suspicious macro execution.
  mitre_attack_id:
  - T1003.002
  - T1003
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - process_name
  - process_id
  - parent_process_name
  - dest
  - user
  - parent_process_id
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1566.001/macro/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
