name: Excessive File Deletion In WinDefender Folder
id: b5baa09a-7a05-11ec-8da4-acde48001122
version: 1
date: '2023-04-14'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: This analytic will identify excessive file deletion events in the Windows
  Defender folder. This technique was seen in the WhisperGate malware campaign in
  which adversaries abused Nirsofts advancedrun.exe to gain administrative privilege
  to then execute PowerShell commands to delete files within the Windows Defender
  application folder. This behavior is a good indicator the offending process is trying
  to corrupt a Windows Defender installation.
data_source:
- Sysmon Event ID 23
search: '`sysmon` EventCode=23 TargetFilename = "*\\ProgramData\\Microsoft\\Windows
  Defender*" | stats values(TargetFilename) as deleted_files min(_time) as firstTime
  max(_time) as lastTime count by user EventCode Image ProcessID Computer |where count
  >=50 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `excessive_file_deletion_in_windefender_folder_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, TargetFilename, and ProcessID executions from your endpoints.
  If you are using Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
known_false_positives: Windows Defender AV updates may cause this alert. Please update
  the filter macros to remove false positives.
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
  analytic_story:
  - Data Destruction
  - WhisperGate
  - BlackByte Ransomware
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: High frequency file deletion activity detected on host $Computer$
  mitre_attack_id:
  - T1485
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: Computer
    type: Endpoint
    role:
    - Victim
  - name: deleted_files
    type: File Name
    role:
    - Target
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - TargetFilename
  - Computer
  - user
  - Image
  - ProcessID
  risk_score: 25
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1485/excessive_file_del_in_windefender_dir/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
