name: Excessive number of taskhost processes
id: f443dac2-c7cf-11eb-ab51-acde48001122
version: 1
date: '2021-06-07'
author: Michael Hart
type: batch
datamodel:
- Endpoint
description: This detection targets behaviors observed in post exploit kits like Meterpreter
  and Koadic that are run in memory.  We have observed that these tools must invoke
  an excessive number of taskhost.exe and taskhostex.exe processes to complete various
  actions (discovery, lateral movement, etc.).  It is extremely uncommon in the course
  of normal operations to see so many distinct taskhost and taskhostex processes running
  concurrently in a short time frame.
search: '| tstats `security_content_summariesonly` values(Processes.process_id) as
  process_ids  min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
  WHERE Processes.process_name = "taskhost.exe" OR Processes.process_name = "taskhostex.exe"
  BY Processes.dest Processes.process_name _time span=1h | `drop_dm_object_name(Processes)`
  | eval pid_count=mvcount(process_ids) | eval taskhost_count_=if(process_name ==
  "taskhost.exe", pid_count, 0) | eval taskhostex_count_=if(process_name == "taskhostex.exe",
  pid_count, 0) | stats sum(taskhost_count_) as taskhost_count, sum(taskhostex_count_)
  as taskhostex_count by _time, dest, firstTime, lastTime | where taskhost_count >
  10 and taskhostex_count > 10 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `excessive_number_of_taskhost_processes_filter`'
how_to_implement: To successfully implement this search you need to be ingesting events
  related to processes on the endpoints that include the name of the process and process
  id into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Administrators, administrative actions or certain applications
  may run many instances of taskhost and taskhostex concurrently.  Filter as needed.
references:
- https://attack.mitre.org/software/S0250/
tags:
  analytic_story:
  - Meterpreter
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059/meterpreter/taskhost_processes/logExcessiveTaskHost.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1033
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_id
  - Processes.process_name
  - Processes.dest
  - Processes.user
  security_domain: endpoint
  impact: 80
  confidence: 70
  # (impact * confidence)/100
  risk_score: 56
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  message: An excessive amount of $process_name$ was executed on $dest$ indicative of suspicious behavior.
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Child Process