name: Excessive File Deletion In WinDefender Folder
id: b5baa09a-7a05-11ec-8da4-acde48001122
version: 2
date: '2024-03-05'
author: Teoderick Contreras, Splunk, Steven Dick
status: production
type: TTP
description: This analytic identifies excessive file deletion events in the Windows
  Defender folder. This technique was observed in the WhisperGate malware campaign,
  where adversaries exploited Nirsoft's advancedrun.exe to gain administrative privileges
  and then executed PowerShell commands to delete files within the Windows Defender
  application folder. Such behavior is a strong indicator that the offending process
  is attempting to corrupt a Windows Defender installation.
data_source:
- Sysmon Event ID 23
- Sysmon Event ID 26
search: '`sysmon` EventCode IN ("23","26") TargetFilename = "*\\ProgramData\\Microsoft\\Windows Defender\\*"
  | stats count, values(TargetFilename) as deleted_files, min(_time) as firstTime, max(_time) as lastTime by user, dest, signature, signature_id, Image, process_name, process_guid
  | rename Image as process
  | where count >=50
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | `excessive_file_deletion_in_windefender_folder_filter`'
how_to_implement: To successfully implement this search, you must ingest logs that include the process name, TargetFilename, and ProcessID executions from your endpoints. If you are utilizing Sysmon, ensure you have at least version 2.0 of the Sysmon TA installed.
known_false_positives: Windows Defender AV updates may trigger this alert. Please adjust the filter macros to mitigate false positives.
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
  analytic_story:
  - Data Destruction
  - WhisperGate
  - BlackByte Ransomware
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: Excessive file deletion events were detected in the Windows Defender folder
    on $dest$ by $user$. Investigate further to determine if this activity is malicious.
  mitre_attack_id:
  - T1485
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: deleted_files
    type: File Name
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - TargetFilename
  - user 
  - dest
  - signature
  - signature_id
  - Image
  - process_name
  - process_path
  - process_guid
  risk_score: 25
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1485/excessive_file_del_in_windefender_dir/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog