name: Excessive Service Stop Attempt
id: ae8d3f4a-acd7-11eb-8846-acde48001122
version: 1
date: '2021-05-04'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: This analytic identifies suspicious series of attempt to kill multiple
  services on a system using either `net.exe` or `sc.exe`. This technique is use by
  adversaries to terminate security services or other related services to continue
  there objective and evade detections.
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  values(Processes.process_id) as process_id count min(_time) as firstTime max(_time)
  as lastTime  from datamodel=Endpoint.Processes where Processes.process_name = "net.exe"
  OR  Processes.process_name = "sc.exe" OR  Processes.process_name = "net1.exe" AND
  Processes.process="*stop*" OR Processes.process="*delete*" by Processes.process_name
  Processes.parent_process_name Processes.dest Processes.user _time span=1m | where
  count >=5 | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `excessive_service_stop_attempt_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. Tune and filter known instances where renamed sc.exe may be used.
known_false_positives: unknown
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
tags:
  analytic_story:
  - XMRig
  - Ransomware
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/xmrig_miner/windows-sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1489
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.process_id
  - Processes.process_name
  - Processes.parent_process_name
  - Processes.dest
  - Processes.user
  security_domain: endpoint
  impact: 80
  confidence: 100
  # (impact * confidence)/100
  risk_score: 80
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  message: An excessive amount of $process_name$ was executed on $dest$ attempting to disable services.
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Child Process