name: Excessive number of taskhost processes
id: f443dac2-c7cf-11eb-ab51-acde48001122
version: 3
date: '2024-04-26'
author: Michael Hart
status: production
type: Anomaly
description: This detection targets behaviors observed in post exploit kits like Meterpreter
  and Koadic that are run in memory.  We have observed that these tools must invoke
  an excessive number of taskhost.exe and taskhostex.exe processes to complete various
  actions (discovery, lateral movement, etc.).  It is extremely uncommon in the course
  of normal operations to see so many distinct taskhost and taskhostex processes running
  concurrently in a short time frame.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` values(Processes.process_id) as
  process_ids  min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
  WHERE Processes.process_name = "taskhost.exe" OR Processes.process_name = "taskhostex.exe"
  BY Processes.dest Processes.process_name _time span=1h | `drop_dm_object_name(Processes)`
  | eval pid_count=mvcount(process_ids) | eval taskhost_count_=if(process_name ==
  "taskhost.exe", pid_count, 0) | eval taskhostex_count_=if(process_name == "taskhostex.exe",
  pid_count, 0) | stats sum(taskhost_count_) as taskhost_count, sum(taskhostex_count_)
  as taskhostex_count by _time, dest, firstTime, lastTime | where taskhost_count >
  10 or taskhostex_count > 10 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `excessive_number_of_taskhost_processes_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Administrators, administrative actions or certain applications
  may run many instances of taskhost and taskhostex concurrently.  Filter as needed.
references:
- https://attack.mitre.org/software/S0250/
tags:
  analytic_story:
  - Meterpreter
  asset_type: Endpoint
  confidence: 70
  impact: 80
  message: An excessive amount of taskhost.exe and taskhostex.exe was executed on $dest$ indicative of suspicious behavior.
  mitre_attack_id:
  - T1059
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_id
  - Processes.process_name
  - Processes.dest
  - Processes.user
  risk_score: 56
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059/excessive_distinct_processes_from_windows_temp/windows-xml.log
    source: XmlWinEventLog:Security
    sourcetype: XmlWinEventLog
