name: Excessive distinct processes from Windows Temp
id: 23587b6a-c479-11eb-b671-acde48001122
version: 3
date: '2024-04-26'
author: Michael Hart, Mauricio Velazco, Splunk
status: production
type: Anomaly
description: This analytic will identify suspicious series of process executions.  We
  have observed that post exploit framework tools like Koadic and Meterpreter will
  launch an excessive number of processes with distinct file paths from Windows\Temp
  to execute actions on objective.  This behavior is extremely anomalous compared
  to typical application behaviors that use Windows\Temp.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  distinct_count(Processes.process) as distinct_process_count  min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_path
  = "*\\Windows\\Temp\\*" by Processes.dest Processes.user  _time span=20m | where
  distinct_process_count > 37 | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `excessive_distinct_processes_from_windows_temp_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Many benign applications will create processes from executables
  in Windows\Temp, although unlikely to exceed the given threshold.  Filter as needed.
references:
- https://www.offensive-security.com/metasploit-unleashed/about-meterpreter/
tags:
  analytic_story:
  - Meterpreter
  asset_type: Endpoint
  confidence: 100
  impact: 80
  message: Multiple processes were executed out of windows\temp within a short amount
    of time on $dest$.
  mitre_attack_id:
  - T1059
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.dest
  - Processes.user
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059/excessive_distinct_processes_from_windows_temp/windows-xml.log
    source: XmlWinEventLog:Security
    sourcetype: XmlWinEventLog
