name: Excessive Service Stop Attempt
id: ae8d3f4a-acd7-11eb-8846-acde48001122
version: 2
date: '2021-05-04'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: This analytic identifies suspicious series of attempt to kill multiple
  services on a system using either `net.exe` or `sc.exe`. This technique is use by
  adversaries to terminate security services or other related services to continue
  there objective and evade detections.
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  values(Processes.process_id) as process_id count min(_time) as firstTime max(_time)
  as lastTime  from datamodel=Endpoint.Processes where `process_net` OR  Processes.process_name
  = "sc.exe" OR  Processes.process_name = "net1.exe" AND Processes.process="*stop*"
  OR Processes.process="*delete*" by Processes.process_name Processes.original_file_name
  Processes.parent_process_name Processes.dest Processes.user _time span=1m | where
  count >=5 | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `excessive_service_stop_attempt_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: unknown
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
tags:
  analytic_story:
  - XMRig
  - Ransomware
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/xmrig_miner/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: An excessive amount of $process_name$ was executed on $dest$ attempting
    to disable services.
  mitre_attack_id:
  - T1489
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 80
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
