author: Teoderick Contreras, Splunk
datamodel: []
date: '2022-01-20'
description: This analytic will identify excessive file deletion events in the Windows
  Defender folder. This technique was seen in the WhisperGate malware campaign in
  which adversaries abused Nirsofts advancedrun.exe to gain administrative privilege
  to then execute PowerShell commands to delete files within the Windows Defender
  application folder. This behavior is a good indicator the offending process is trying
  to corrupt a Windows Defender installation.
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, TargetFilename, and ProcessID executions from your endpoints.
  If you are using Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
id: b5baa09a-7a05-11ec-8da4-acde48001122
known_false_positives: Windows Defender AV updates may cause this alert. Please update
  the filter macros to remove false positives.
name: Excessive File Deletion In WinDefender Folder
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
search: '`sysmon` EventCode=23 TargetFilename = "*\\ProgramData\\Microsoft\\Windows
  Defender*" | stats values(TargetFilename) as deleted_files min(_time) as firstTime
  max(_time) as lastTime count by user EventCode Image ProcessID Computer |where count
  >=50 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `excessive_file_deletion_in_windefender_folder_filter`'
tags:
  analytic_story:
  - WhisperGate
  automated_detection_testing: passed
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1485/excessive_file_del_in_windefender_dir/sysmon.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: High frequency file deletion activity detected on host $Computer$
  mitre_attack_id:
  - T1485
  nist:
  - DE.CM
  observable:
  - name: user
    role:
    - Victim
    type: User
  - name: Computer
    role:
    - Victim
    type: Endpoint
  - name: deleted_files
    role:
    - Target
    type: File Name
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - TargetFilename
  - Computer
  - user
  - Image
  - ProcessID
  risk_score: 25
  security_domain: endpoint
type: TTP
version: 1
