name: Executable File Written in Administrative SMB Share
id: f63c34fe-a435-11eb-935a-acde48001122
version: 2
date: '2023-06-13'
author: Teoderick Contreras, Mauricio Velazco, Splunk
status: production
type: TTP
description: The following analytic identifies executable files (.exe or .dll) being
  written to Windows administrative SMB shares (Admin$, IPC$, C$). This represents
  suspicious behavior as its commonly used by tools like PsExec/PaExec and others
  to stage service binaries before creating and starting a Windows service on remote
  endpoints. Red Teams and adversaries alike may abuse administrative shares for lateral
  movement and remote code execution. The Trickbot malware family also implements
  this behavior to try to infect other machines in the infected network.
data_source:
- Windows Security 5145
search: '`wineventlog_security` EventCode=5145 Relative_Target_Name IN ("*.exe","*.dll")
  Object_Type=File Share_Name IN ("\\\\*\\C$","\\\\*\\IPC$","\\\\*\\admin$") Access_Mask=
  "0x2" | stats min(_time) as firstTime max(_time) as lastTime count by EventCode
  Share_Name Relative_Target_Name Object_Type Access_Mask user src_port Source_Address
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `executable_file_written_in_administrative_smb_share_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  Windows Security Event Logs with 5145 EventCode enabled. The Windows TA is also
  required. Also enable the object Audit access success/failure in your group policy.
known_false_positives: System Administrators may use looks like PsExec for troubleshooting
  or administrations tasks. However, this will typically come only from certain users
  and certain systems that can be added to an allow list.
references:
- https://attack.mitre.org/techniques/T1021/002/
- https://www.rapid7.com/blog/post/2013/03/09/psexec-demystified/
- https://labs.vipre.com/trickbot-and-its-modules/
- https://whitehat.eu/incident-response-case-study-featuring-ryuk-and-trickbot-part-2/
- https://thedfirreport.com/2023/05/22/icedid-macro-ends-in-nokoyawa-ransomware/
tags:
  analytic_story:
  - Active Directory Lateral Movement
  - Prestige Ransomware
  - Graceful Wipe Out Attack
  - Industroyer2
  - IcedID
  - Data Destruction
  - Hermetic Wiper
  - Trickbot
  asset_type: Endpoint
  confidence: 100
  impact: 70
  message: $user$ dropped or created an executable file in known sensitive SMB share.  Share
    name=$Share_Name$, Target name=$Relative_Target_Name$, and Access mask=$Access_Mask$
  mitre_attack_id:
  - T1021
  - T1021.002
  observable:
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - Share_Name
  - Relative_Target_Name
  - Object_Type
  - Access_Mask
  - user
  - src_port
  - Source_Address
  risk_score: 70
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/trickbot/exe_smbshare/windows-security.log
    source: WinEventLog:Security
    sourcetype: WinEventLog
