name: Executables Or Script Creation In Suspicious Path
id: a7e3f0f0-ae42-11eb-b245-acde48001122
version: 1
date: '2021-10-06'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: This analytic will identify suspicious executable or scripts (known file
  extensions) in a list of suspicious file paths in Windows. This technique is used by
  adversaries to evade detection. The suspicious file path are known paths used in
  the wild and are not common to have executable or scripts.
search: '|tstats `security_content_summariesonly` values(Filesystem.file_path) as
  file_path count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Filesystem
  where (Filesystem.file_name = *.exe OR Filesystem.file_name = *.dll OR Filesystem.file_name
  = *.sys OR Filesystem.file_name = *.com OR Filesystem.file_name = *.vbs OR Filesystem.file_name
  = *.vbe OR Filesystem.file_name = *.js OR Filesystem.file_name = *.ps1 OR Filesystem.file_name
  = *.bat OR Filesystem.file_name = *.cmd OR Filesystem.file_name = *.pif) AND ( Filesystem.file_path
  = *\\windows\\fonts\\* OR Filesystem.file_path = *\\windows\\temp\\* OR Filesystem.file_path
  = *\\users\\public\\* OR Filesystem.file_path = *\\windows\\debug\\* OR Filesystem.file_path
  = *\\Users\\Administrator\\Music\\* OR Filesystem.file_path = *\\Windows\\servicing\\*
  OR Filesystem.file_path = *\\Users\\Default\\* OR Filesystem.file_path = *Recycle.bin*
  OR Filesystem.file_path = *\\Windows\\Media\\* OR Filesystem.file_path = *\\Windows\\repair\\*
  OR Filesystem.file_path = *\\AppData\\Local\\Temp* OR Filesystem.file_path = *\\PerfLogs\\*)
  by Filesystem.file_create_time Filesystem.process_id  Filesystem.file_name Filesystem.user
  | `drop_dm_object_name(Filesystem)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `executables_or_script_creation_in_suspicious_path_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the Filesystem responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Filesystem` node.
known_false_positives: Administrators may allow creation of script or exe in the paths
  specified. Filter as needed.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- https://twitter.com/pr0xylife/status/1590394227758104576
tags:
  analytic_story:
  - Double Zero Destructor
  - Data Destruction
  - XMRig
  - Remcos
  - WhisperGate
  - Hermetic Wiper
  - Industroyer2
  - Azorult
  - DarkCrystal RAT
  - Brute Ratel C4
  - AgentTesla
  - Qakbot
  - IcedID
  - Trickbot
  - Chaos Ransomware
  - LockBit Ransomware
  - AsyncRAT
  - Swift Slicer
  automated_detection_testing: passed
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/xmrig_miner/windows-sysmon.log
  impact: 40
  kill_chain_phases:
  - Exploitation
  message: Suspicious executable or scripts with file name $file_name$, $file_path$
    and process_id $process_id$ executed in suspicious file path in Windows by $user$
  mitre_attack_id:
  - T1036
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: process_id
    type: Process
    role:
    - Attacker
  - name: file_name
    type: File Name
    role:
    - Other
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Filesystem.file_path
  - Filesystem.file_create_time
  - Filesystem.process_id
  - Filesystem.file_name
  - Filesystem.user
  risk_score: 20
  security_domain: endpoint
  asset_type: Endpoint
