name: Firewall Allowed Program Enable
id: 9a8f63a8-43ac-11ec-904c-acde48001122
version: 1
date: '2021-11-12'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: This analytic detects a potential suspicious modification of firewall
  rule allowing to execute specific application. This technique was identified when
  an adversary and red teams to bypassed firewall file execution restriction in a
  targetted host. Take note that this event or command can run by administrator during
  testing or allowing legitimate tool or application.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process = "*firewall*"
  Processes.process = "*allow*" Processes.process = "*add*" Processes.process = "*ENABLE*"
  by Processes.dest Processes.user Processes.parent_process_name Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `firewall_allowed_program_enable_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: A network operator or systems administrator may utilize an
  automated or manual execution of this firewall rule that may generate false positives.
  Filter as needed.
references:
- https://app.any.run/tasks/ad4c3cda-41f2-4401-8dba-56cc2d245488/
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Azorult
  - BlackByte Ransomware
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: firewall allowed program commandline $process$ of $process_name$ on $dest$
    by $user$
  mitre_attack_id:
  - T1562.004
  - T1562
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 25
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/vilsel/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
