name: Fsutil Zeroing File
id: 4e5e024e-fabb-11eb-8b8f-acde48001122
version: 1
date: '2021-08-11'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This search is to detect a suspicious fsutil process to zeroing a target
  file. This technique was seen in lockbit ransomware where it tries to zero out its
  malware path as part of its defense evasion after encrypting the compromised host.
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  as process values(Processes.parent_process) as parent_process min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=fsutil.exe
  Processes.process="*setzerodata*" by Processes.user Processes.process_name Processes.parent_process_name
  Processes.dest  Processes.process Processes.parent_process | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `fsutil_zeroing_file_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: unknown
references:
- https://app.any.run/tasks/e0ac072d-58c9-4f53-8a3b-3e491c7ac5db/
tags:
  analytic_story:
  - Ransomware
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1070/fsutil_file_zero/windows-sysmon.log
  impact: 60
  kill_chain_phases:
  - Exploitation
  message: Possible file data deletion on $dest$ using $process$
  mitre_attack_id:
  - T1070
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.user
  - Processes.process_name
  - Processes.parent_process_name
  - Processes.dest
  - Processes.process
  - Processes.parent_process
  risk_score: 54
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
