name: Get-ForestTrust with PowerShell
id: 584f4884-0bf1-11ec-a5ec-acde48001122
version: 1
date: '2021-09-02'
author: Michael Haag, Splunk
type: TTP
datamodel:
- Endpoint
description: This analytic identifies Get-ForestTrust from PowerSploit in order to
  gather domain trust information. Typically, this is utilized within a script being
  executed and used to enumerate the domain trust information. This grants the adversary
  an understanding of how large or small the domain is. During triage, review parallel
  processes using an EDR product or 4688 events. It will be important to understand
  the timeline of events around this activity.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=powershell.exe
  OR Processes.process_name=cmd.exe Processes.process=*get-foresttrust* by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `get_foresttrust_with_powershell_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: Limited false positives as this requires an active Administrator
  or adversary to bring in, import, and execute.
references:
- https://powersploit.readthedocs.io/en/latest/Recon/Get-ForestTrust/
tags:
  analytic_story:
  - Active Directory Discovery
  confidence: 40
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1482/discovery/windows-sysmon.log
  impact: 30
  kill_chain_phases:
  - Reconnaissance
  message: Suspicious PowerShell Get-ForestTrust was identified on endpoint $dest$
    by user $user$.
  mitre_attack_id:
  - T1482
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 12
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
