name: Get_DomainUser with PowerShell
id: 9a5a41d6-04e7-11ec-923c-acde48001122
version: 1
date: '2021-08-24'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This search is to detect a cmdlet Get-DomainUser that are common on powerview or powersploit tool. 
  This cmdlet is used to recon on the targetted machine to enumerate all users in active directory.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where (Processes.process_name="cmd.exe" OR Processes.process_name="powershell*") AND Processes.process = "*Get-DomainUser*" 
  by Processes.dest Processes.user Processes.parent_process Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  Processes.parent_process_name | `drop_dm_object_name(Processes)` 
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `get_domainuser_with_powershell_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. 
known_false_positives: unknown
references:
- https://powersploit.readthedocs.io/en/latest/Recon/Get-DomainUser/
tags:
  analytic_story:
  - Active Directory Discovery
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1087.002/AD_discovery/windows-sysmon.log
  kill_chain_phases:
  - Reconnaissance
  mitre_attack_id:
  - T1087.002
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest 
  - Processes.user 
  - Processes.parent_process 
  - Processes.process_name 
  - Processes.process 
  - Processes.process_id 
  - Processes.parent_process_id
  - Processes.parent_process_name
  security_domain: endpoint
  impact: 50
  confidence: 50 
  # (impact * confidence)/100
  risk_score: 25
  context:
  - Source:Endpoint
  - Stage:Reconnaissance
  message: an instance of process $process_name$ with commandline $process$ in $dest$
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Parent Process
    role:
    - Parent Process