name: GetDomainComputer with PowerShell
id: ed550c19-712e-43f6-bd19-6f58f61b3a5e
version: 1
date: '2021-09-07'
author: Mauricio Velazco, Splunk
type: TTP
datamodel:
- Endpoint
description: This analytic looks for the execution of `powershell.exe` with command-line
  arguments utilized to discover remote systems. `Get-DomainComputer` is part of PowerView,
  a PowerShell tool used to perform enumeration on Windows domains. Red Teams and
  adversaries alike may leverage PowerView to enumerate domain groups for situational
  awareness and Active Directory Discovery.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name="powershell.exe")
  (Processes.process=*Get-DomainComputer*) by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `getdomaincomputer_with_powershell_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Administrators or power users may use PowerView for troubleshooting.
references:
- https://attack.mitre.org/techniques/T1018/
tags:
  analytic_story:
  - Active Directory Discovery
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Discovery
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1018/AD_discovery/windows-sysmon.log
  impact: 30
  kill_chain_phases:
  - Reconnaissance
  message: Remote system discovery enumeration on $dest$ by $user$
  mitre_attack_id:
  - T1018
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 24
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
