name: GetDomainComputer with PowerShell Script Block
id: f64da023-b988-4775-8d57-38e512beb56e
version: 1
date: '2021-09-02'
author: Mauricio Velazco, Splunk
type: TTP
datamodel: []
description: The following analytic utilizes PowerShell Script Block Logging (EventCode=4104)
  to identify the execution of the `Get-DomainComputer` commandlet. `GetDomainComputer`
  is part of PowerView, a PowerShell tool used to perform enumeration on Windows domains.
  Red Teams and adversaries alike may use PowerView to enumerate domain computers
  for situational awareness and Active Directory Discovery.
search: '`powershell` EventCode=4104 (Message = "*Get-DomainComputer*") | stats count
  min(_time) as firstTime max(_time) as lastTime by EventCode Message ComputerName
  User | `security_content_ctime(firstTime)` | `getdomaincomputer_with_powershell_script_block_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: Administrators or power users may use PowerView for troubleshooting.
references:
- https://attack.mitre.org/techniques/T1018/
- https://powersploit.readthedocs.io/en/latest/Recon/Get-DomainComputer/
tags:
  analytic_story:
  - Active Directory Discovery
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Discovery
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1018/AD_discovery/windows-powershell.log
  impact: 30
  kill_chain_phases:
  - Reconnaissance
  message: Remote system discovery with PowerView on $dest$ by $user$
  mitre_attack_id:
  - T1018
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - Message
  - ComputerName
  - User
  risk_score: 24
  security_domain: endpoint
  asset_type: Endpoint
