name: GetLocalUser with PowerShell
id: 85fae8fa-0427-11ec-8b78-acde48001122
version: 1
date: '2021-08-23'
author: Mauricio Velazco, Splunk
type: hunt
datamodel:
- Endpoint
description: This analytic looks for the execution of `powershell.exe` with command-line
  arguments utilized to query for local users. The `Get-LocalUser` commandlet is used to return a list of all local users.  
  Red Teams and adversaries may leverage this commandlet to enumerate users for situational awareness and Active Directory Discovery.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name="powershell.exe") (Processes.process=*Get-WmiObject* 
  AND Processes.process=*Win32_UserAccount*)
  by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `getlocaluser_with_powershell_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Administrators or power users may use this PowerShell commandlet for troubleshooting.
references:
- https://attack.mitre.org/techniques/T1087/001/
tags:
  analytic_story:
  - Active Directory Discovery
  dataset:
  - UPDATE_DATASET_URL
  kill_chain_phases:
  - Reconnaissance
  mitre_attack_id:
  - T1087.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  security_domain: endpoint
  impact: 30
  confidence: 50
  risk_score: 15
  context:
  - Source:Endpoint
  - Stage:Discovery
  - Stage:Recon
  message: Local user discovery enumeration using PowerShell on $dest$ by $user$
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  