name: GetWmiObject DS User with PowerShell Script Block
id: fabd364e-04f3-11ec-b34b-acde48001122
version: 1
date: '2021-08-24'
author: Teoderick Contreras, Mauricio Velazco, Splunk
type: TTP
datamodel: []
description: The following analytic utilizes PowerShell Script Block Logging (EventCode=4104)
  to identify the execution of the `Get-WmiObject` commandlet. The `DS_User` class
  parameter leverages WMI to query for all domain users. Red Teams and adversaries
  may leverage this commandlet to enumerate domain users for situational awareness
  and Active Directory Discovery.
search: '`powershell` EventCode=4104 Message = "*get-wmiobject*" Message = "*ds_user*"
  Message = "*-namespace*" Message = "*root\\directory\\ldap*" | stats count min(_time)
  as firstTime max(_time) as lastTime by EventCode Message ComputerName User | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `getwmiobject_ds_user_with_powershell_script_block_filter`'
how_to_implement: he following Hunting analytic requires PowerShell operational logs
  to be imported. Modify the powershell macro as needed to match the sourcetype or
  add index. This analytic is specific to 4104, or PowerShell Script Block Logging.
known_false_positives: Administrators or power users may use this command for troubleshooting.
references:
- https://www.blackhillsinfosec.com/red-blue-purple/
- https://docs.microsoft.com/en-us/windows/win32/wmisdk/describing-the-ldap-namespace
tags:
  analytic_story:
  - Active Directory Discovery
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Discovery
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1087.002/AD_discovery/windows-powershell.log
  impact: 50
  kill_chain_phases:
  - Reconnaissance
  message: powershell process having commandline $Message$ for user enumeration
  mitre_attack_id:
  - T1087.002
  - T1087
  observable:
  - name: ComputerName
    type: Hostname
    role:
    - Victim
  - name: User
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - Message
  - ComputerName
  - User
  risk_score: 25
  security_domain: endpoint
  asset_type: Endpoint
