name: Gsuite Drive Share In External Email
id: f6ee02d6-fea0-11eb-b2c2-acde48001122
version: 1
date: '2021-08-16'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: This search is to detect suspicious google drive or google docs files shared outside or externally. 
  This behavior might be a good hunting query to monitor exfitration of data made by an attacker to a compromise machine.
search: 'index=obs-gsuite sourcetype=gsuite:drive:json NOT(email IN ("*splunk.com", "null"))
  | stats values(parameters.doc_title) as doc_title count min(_time) as firstTime max(_time) as lastTime by 
  parameters.doc_type parameters.owner email 
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` 
  | `gsuite_drive_share_in_external_email_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs related to gsuite having the file attachment metadata like file type, file 
  extension, source email, destination email, num of attachment and etc.
known_false_positives: network admin or normal user may share files to customer and external team.
references:
tags:
  analytic_story:
  - UPDATE_STORY_NAME
  dataset:
  - UPDATE_DATASET_URL
  kill_chain_phases:
  - Exfiltration
  mitre_attack_id:
  - T1003.002
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  security_domain: endpoint
  impact: 30
  confidence: 30
  # (impact * confidence)/100
  risk_score: 9
  context:
  message: 
  observable:
  