name: GSuite Email Suspicious Attachment
id: 6d663014-fe92-11eb-ab07-acde48001122
version: 1
date: '2021-08-16'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: This search is to detect a suspicious attachment file extension in Gsuite email that may related to spear phishing attack. 
  This file type is commonly used by malware to lure user to click on it to execute malicious code to compromised targetted machine. 
  But this search can also catch some normal files related to this file type that maybe send by employee or network admin.
 
search: 'index=obs-gsuite sourcetype="gsuite:gmail:bigquery" "attachment{}.file_extension_type" 
  IN ("pl", "py", "rb", "sh", "bat", "exe", "dll", "cpl", "com", "js", "vbs", "ps1", "reg","swf", "cmd", "go") 
  | stats count min(_time) as firstTime max(_time) as lastTime by attachment{}.file_extension_type attachment{}.sha256 
  destination{}.service num_message_attachments payload_size subject destination{}.address source.address
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` 
  | `gsuite_suspicious_attachment_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs related to gsuite having the file attachment metadata like file type, file 
  extension, source email, destination email, num of attachment and etc.
known_false_positives: network admin and normal user may send this file attachment as part of their day to day work. having a good protocol 
  in attaching this file type to an e-mail may reduce the risk of having a spear phishing attack.
references:
tags:
  analytic_story:
  - UPDATE_STORY_NAME
  dataset:
  - UPDATE_DATASET_URL
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1566.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  security_domain: endpoint
  impact: 70
  confidence: 70 
  # (impact * confidence)/100
  risk_score: 49
  context:
  message: 
  observable: