name: Headless Browser Mockbin or Mocky Request
id: 94fc85a1-e55b-4265-95e1-4b66730e05c0
version: 2
date: '2024-05-29'
author: Michael Haag, Splunk
status: production
type: TTP
data_source:
- Sysmon EventID 1
description: The following analytic detects headless browser activity accessing mockbin.org
  or mocky.io. It identifies processes with the "--headless" and "--disable-gpu" command
  line arguments, along with references to mockbin.org or mocky.io. This behavior
  is significant as headless browsers are often used for automated tasks, including
  malicious activities like web scraping or automated attacks. If confirmed malicious,
  this activity could indicate an attempt to bypass traditional browser security measures,
  potentially leading to data exfiltration or further exploitation of web applications.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process="*--headless*"
  AND Processes.process="*--disable-gpu*" AND (Processes.process="*mockbin.org/*"
  OR Processes.process="*mocky.io/*")) by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `headless_browser_mockbin_or_mocky_request_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: False positives are not expected with this detection, unless
  within the organization there is a legitimate need for headless browsing accessing
  mockbin.org or mocky.io.
references:
- https://mockbin.org/
- https://www.mocky.io/
tags:
  analytic_story:
  - Forest Blizzard
  asset_type: Endpoint
  atomic_guid: []
  confidence: 70
  impact: 80
  message: Headless browser activity accessing mockbin.org or mocky.io detected on
    $dest$ by $user$.
  mitre_attack_id:
  - T1564.003
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 56
  required_fields:
  - Processes.dest
  - Processes.user
  - Processes.parent_process
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1185/headlessbrowser/headless_mockbin.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
