name: Headless Browser Usage
id: 869ba261-c272-47d7-affe-5c0aa85c93d6
version: 2
date: '2024-05-26'
author: Michael Haag, Splunk
status: production
type: Hunting
data_source:
- Sysmon EventID 1
description: 'The following analytic detects the usage of headless browsers within
  an organization. It identifies processes containing the "--headless" and "--disable-gpu"
  command line arguments, which are indicative of headless browsing. This detection
  leverages data from the Endpoint.Processes datamodel to identify such processes.
  Monitoring headless browser usage is significant as these tools can be exploited
  by adversaries for malicious activities like web scraping, automated testing, and
  undetected web interactions. If confirmed malicious, this activity could lead to
  unauthorized data extraction, automated attacks, or other covert operations on web
  applications.'
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process="*--headless*"
  AND Processes.process="*--disable-gpu*") by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`|
  `headless_browser_usage_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: This hunting analytic is meant to assist with baselining and
  understanding headless browsing in use. Filter as needed.
references:
- https://cert.gov.ua/article/5702579
tags:
  analytic_story:
  - Forest Blizzard
  asset_type: Endpoint
  atomic_guid: []
  confidence: 50
  impact: 30
  message: Behavior related to headless browser usage detected on $dest$ by $user$.
  mitre_attack_id:
  - T1564.003
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 15
  required_fields:
  - Processes.dest
  - Processes.user
  - Processes.parent_process
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  - sourcetype
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1185/headlessbrowser/headless_mockbin.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
