name: Hiding Files And Directories With Attrib exe
id: c77162d3-f93c-45cc-80c8-22f6b5264g9f
version: 4
date: '2020-07-21'
description: Attackers leverage an existing Windows binary, attrib.exe, to mark specific
  as hidden by using specific flags so that the victim does not see the file.  The
  search looks for specific command-line arguments to detect the use of attrib.exe
  to hide files.
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
type: batch
references: []
author: Bhavin Patel, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) values(Processes.process)
  as process max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=attrib.exe
  (Processes.process=*+h*) by Processes.parent_process Processes.process_name Processes.user
  Processes.dest | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`|`security_content_ctime(lastTime)`|
  `hiding_files_and_directories_with_attrib_exe_filter` '
known_false_positives: 'Some applications and users may legitimately use attrib.exe
  to interact with the files. '
tags:
  analytics_story:
  - Windows Defense Evasion Tactics
  - Windows Persistence Techniques
  mitre_attack_id:
  - T1222.001
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 8
  nist:
  - DE.CM
  security_domain: endpoint
  asset_type: ''
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1222.001/atomic_red_team/windows-sysmon.log
