name: Hiding Files And Directories With Attrib exe
id: 6e5a3ae4-90a3-462d-9aa6-0119f638c0f1
version: 4
date: '2020-07-21'
author: Bhavin Patel, Splunk
status: production
type: TTP
description: Attackers leverage an existing Windows binary, attrib.exe, to mark specific
  as hidden by using specific flags so that the victim does not see the file.  The
  search looks for specific command-line arguments to detect the use of attrib.exe
  to hide files.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) values(Processes.process)
  as process max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=attrib.exe
  (Processes.process=*+h*) by Processes.parent_process Processes.process_name Processes.user
  Processes.dest | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`|`security_content_ctime(lastTime)`|
  `hiding_files_and_directories_with_attrib_exe_filter` '
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
known_false_positives: 'Some applications and users may legitimately use attrib.exe
  to interact with the files. '
references: []
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Windows Persistence Techniques
  - Azorult
  asset_type: ''
  confidence: 80
  impact: 90
  message: Attrib.exe with +h flag to hide files on $dest$ executed by $user$ is detected.
  mitre_attack_id:
  - T1222
  - T1222.001
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: parent_process
    type: Other
    role:
    - Attacker
    - Parent Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.process_name
  - Processes.parent_process
  - Processes.user
  - Processes.dest
  risk_score: 72
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1222.001/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
