name: Hiding Files And Directories With Attrib exe
id: c77162d3-f93c-45cc-80c8-22f6b5264g9f
version: 4
date: '2020-07-21'
author: Bhavin Patel, Splunk
type: batch
datamodel:
- Endpoint
description: Attackers leverage an existing Windows binary, attrib.exe, to mark specific
  as hidden by using specific flags so that the victim does not see the file.  The
  search looks for specific command-line arguments to detect the use of attrib.exe
  to hide files.
search: '| tstats `security_content_summariesonly` count min(_time) values(Processes.process)
  as process max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=attrib.exe
  (Processes.process=*+h*) by Processes.parent_process Processes.process_name Processes.user
  Processes.dest | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`|`security_content_ctime(lastTime)`|
  `hiding_files_and_directories_with_attrib_exe_filter` '
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
known_false_positives: 'Some applications and users may legitimately use attrib.exe
  to interact with the files. '
references: []
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Windows Persistence Techniques
  asset_type: ''
  automated_detection_testing: passed
  cis20:
  - CIS 8
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1222.001/atomic_red_team/windows-sysmon.log
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1222.001
  nist:
  - DE.CM
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.process_name
  - Processes.parent_process
  - Processes.user
  - Processes.dest
  security_domain: endpoint
  impact: 90
  confidence: 80
  # (impact * confidence)/100
  risk_score: 72
  context:
  - Source:Endpoint
  - Stage:Defense Evasion 
  - Stage:Persistence
  message: Attrib.exe with +h flag to hide files on $dest$ executed by $user$ is detected.
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: parent_process
    type: Other
    role:
    - Attacker
    - Parent Process