name: Impacket Lateral Movement WMIExec Commandline Parameters
id: d6e464e4-5c6a-474e-82d2-aed616a3a492
version: 2
date: '2024-05-26'
author: Michael Haag, Splunk
status: production
type: TTP
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
description: The following analytic detects the use of Impacket's `wmiexec.py` tool
  for lateral movement by identifying specific command-line parameters. It leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on processes spawned
  by `wmiprvse.exe` with command-line patterns indicative of Impacket usage. This
  activity is significant as Impacket tools are commonly used by adversaries for remote
  code execution and lateral movement within a network. If confirmed malicious, this
  could allow attackers to execute arbitrary commands on remote systems, potentially
  leading to further compromise and data exfiltration.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=wmiprvse.exe
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | where match(process, "(?i)cmd\.exe\s+\/Q\s+\/c") AND match(process, "\\\\127\.0\.0\.1\\.*")
  AND match(process, "__\\d{1,10}\\.\\d{1,10}") | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`| `impacket_lateral_movement_wmiexec_commandline_parameters_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Although uncommon, Administrators may leverage Impackets tools
  to start a process on remote systems for system administration or automation use
  cases.
references:
- https://attack.mitre.org/techniques/T1021/002/
- https://attack.mitre.org/techniques/T1021/003/
- https://attack.mitre.org/techniques/T1047/
- https://attack.mitre.org/techniques/T1053/
- https://attack.mitre.org/techniques/T1053/005/
- https://github.com/SecureAuthCorp/impacket
- https://vk9-sec.com/impacket-remote-code-execution-rce-on-windows-from-linux/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
tags:
  analytic_story:
  - Active Directory Lateral Movement
  - CISA AA22-277A
  - WhisperGate
  - Prestige Ransomware
  - Volt Typhoon
  - Graceful Wipe Out Attack
  - Industroyer2
  - Data Destruction
  - Gozi Malware
  asset_type: Endpoint
  atomic_guid: []
  confidence: 70
  impact: 90
  message: Suspicious command-line parameters on $dest$ may represent lateral movement
    using wmiexec.
  mitre_attack_id:
  - T1021
  - T1021.002
  - T1021.003
  - T1047
  - T1543.003
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Processes.process_name
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 63
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1021.002/atomic_red_team/wmiexec_windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
