name: Impacket Lateral Movement Commandline Parameters
id: 8ce07472-496f-11ec-ab3b-3e22fbd008af
version: 2
date: '2022-01-18'
author: Mauricio Velazco, Splunk
status: production
type: TTP
description: This analytic looks for the presence of suspicious commandline parameters
  typically present when using Impacket tools. Impacket is a collection of python
  classes meant to be used with Microsoft network protocols. There are multiple scripts
  that leverage impacket libraries like `wmiexec.py`, `smbexec.py`, `dcomexec.py`
  and `atexec.py` used to execute commands on remote endpoints. By default, these
  scripts leverage administrative shares and hardcoded parameters that can be used
  as a signature to detect its use. Red Teams and adversaries alike may leverage Impackets
  tools for lateral movement and remote code execution.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process = "*/c* \\\\127.0.0.1\\*"
  OR Processes.process= "*/c* 2>&1") by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `impacket_lateral_movement_commandline_parameters_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints.
known_false_positives: Although uncommon, Administrators may leverage Impackets tools
  to start a process on remote systems for system administration or automation use
  cases.
references:
- https://attack.mitre.org/techniques/T1021/002/
- https://attack.mitre.org/techniques/T1021/003/
- https://attack.mitre.org/techniques/T1047/
- https://attack.mitre.org/techniques/T1053/
- https://attack.mitre.org/techniques/T1053/005/
- https://github.com/SecureAuthCorp/impacket
- https://vk9-sec.com/impacket-remote-code-execution-rce-on-windows-from-linux/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
  analytic_story:
  - Active Directory Lateral Movement
  - WhisperGate
  - Industroyer2
  - CISA AA22-277A
  - Prestige Ransomware
  asset_type: Endpoint
  confidence: 70
  impact: 90
  message: Suspicious command line parameters on $dest may represent a lateral movement
    attack with Impackets tools
  mitre_attack_id:
  - T1021
  - T1021.002
  - T1021.003
  - T1047
  - T1543.003
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 63
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1021.003/impacket/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
