name: Impacket Lateral Movement WMIExec Commandline Parameters
id: d6e464e4-5c6a-474e-82d2-aed616a3a492
version: 1
date: '2023-06-13'
author: Michael Haag, Splunk
status: production
type: TTP
data_source:
- Sysmon EventID 1
description: This analytic looks for the presence of suspicious commandline parameters
  typically present when using Impacket tools. Impacket is a collection of python
  classes meant to be used with Microsoft network protocols. There are multiple scripts
  that leverage impacket libraries like `wmiexec.py`, `smbexec.py`, `dcomexec.py`
  and `atexec.py` used to execute commands on remote endpoints. By default, these
  scripts leverage administrative shares and hardcoded parameters that can be used
  as a signature to detect its use. Red Teams and adversaries alike may leverage Impackets
  tools for lateral movement and remote code execution.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=wmiprvse.exe
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | where match(process, "(?i)cmd\.exe\s+\/Q\s+\/c") AND match(process, "\\\\127\.0\.0\.1\\.*")
  AND match(process, "__\\d{1,10}\\.\\d{1,10}") | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`| `impacket_lateral_movement_wmiexec_commandline_parameters_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Although uncommon, Administrators may leverage Impackets tools
  to start a process on remote systems for system administration or automation use
  cases.
references:
- https://attack.mitre.org/techniques/T1021/002/
- https://attack.mitre.org/techniques/T1021/003/
- https://attack.mitre.org/techniques/T1047/
- https://attack.mitre.org/techniques/T1053/
- https://attack.mitre.org/techniques/T1053/005/
- https://github.com/SecureAuthCorp/impacket
- https://vk9-sec.com/impacket-remote-code-execution-rce-on-windows-from-linux/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
tags:
  analytic_story:
  - Active Directory Lateral Movement
  - CISA AA22-277A
  - WhisperGate
  - Prestige Ransomware
  - Volt Typhoon
  - Graceful Wipe Out Attack
  - Industroyer2
  - Data Destruction
  asset_type: Endpoint
  atomic_guid: []
  confidence: 70
  impact: 90
  message: Suspicious command-line parameters on $dest$ may represent lateral movement
    using wmiexec.
  mitre_attack_id:
  - T1021
  - T1021.002
  - T1021.003
  - T1047
  - T1543.003
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Processes.process_name
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 63
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1021.002/atomic_red_team/wmiexec_windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
