name: Java Class File download by Java User Agent
id: 8281ce42-5c50-11ec-82d2-acde48001122
version: 1
date: '2021-12-13'
author: Michael Haag, Splunk
type: TTP
datamodel:
  - Web
description: The following analytic identifies a Java user agent performing a GET request for a .class file from the remote site. This is potentially indicative of exploitation of the Java application and may be related to current event CVE-2021-44228 (Log4Shell). 
search: '| tstats count from datamodel=Web where 
  Web.http_user_agent="*Java*" Web.http_method="GET" Web.url="*.class*"
  by Web.http_user_agent Web.http_method, Web.url,Web.url_length Web.src, Web.dest 
  | `drop_dm_object_name("Web")` 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)`
  | `java_class_file_download_by_java_user_agent_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. Restrict the analytic to publicly facing endpoints to reduce false positives. Add any additional identified web application process name to the query. Add any further Windows process names to the macro (ex. LOLBins) to further expand this query.
known_false_positives: Filtering may be required on internal developer build systems or classify assets as web facing and restrict the analytic based on that.
references:
  - https://arstechnica.com/information-technology/2021/12/as-log4shell-wreaks-havoc-payroll-service-reports-ransomware-attack/
tags:
  analytic_story:
  - Log4Shell CVE-2021-44228
  asset_type: Web Server
  dataset: []
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1190
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Web.http_method
  - Web.url
  - Web.url_length
  - Web.src
  - Web.dest
  - Web.http_user_agent
  security_domain: network
  impact: 80
  confidence: 50
  # (impact * confidence)/100
  risk_score: 40
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  message: A Java user agent $http_user_agent$ was performing a $http_method$ to retrieve a remote class file. 
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: http_user_agent
    type: Other
    role:
    - other
  - name: http_method
    type: Other
    role:
    - other