name: Java Class File download by Java User Agent
id: 8281ce42-5c50-11ec-82d2-acde48001122
version: 1
date: '2021-12-13'
author: Michael Haag, Splunk
type: TTP
datamodel:
- Web
description: The following analytic identifies a Java user agent performing a GET
  request for a .class file from the remote site. This is potentially indicative of
  exploitation of the Java application and may be related to current event CVE-2021-44228
  (Log4Shell).
search: '| tstats count from datamodel=Web where Web.http_user_agent="*Java*" Web.http_method="GET"
  Web.url="*.class*" by Web.http_user_agent Web.http_method, Web.url,Web.url_length
  Web.src, Web.dest | `drop_dm_object_name("Web")` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `java_class_file_download_by_java_user_agent_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  web or proxy logs, or ensure it is being filled by a proxy like device, into the
  Web Datamodel. For additional filtering, allow list private IP space or restrict
  by known good.
known_false_positives: Filtering may be required in some instances, filter as needed.
references:
- https://arstechnica.com/information-technology/2021/12/as-log4shell-wreaks-havoc-payroll-service-reports-ransomware-attack/
tags:
  analytic_story:
  - Log4Shell CVE-2021-44228
  asset_type: Web Server
  confidence: 50
  context:
  - Scope:Network
  cve:
  - CVE-2021-44228
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1190/java/java.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: A Java user agent $http_user_agent$ was performing a $http_method$ to retrieve
    a remote class file.
  mitre_attack_id:
  - T1190
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: http_user_agent
    type: Other
    role:
    - Other
  - name: http_method
    type: Other
    role:
    - Other
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Web.http_method
  - Web.url
  - Web.url_length
  - Web.src
  - Web.dest
  - Web.http_user_agent
  risk_score: 40
  security_domain: network
