name: Jscript Execution Using Cscript App
id: 002f1e24-146e-11ec-a470-acde48001122
version: 2
date: '2024-05-12'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: The following analytic detects the execution of JScript using the cscript.exe
  process. It leverages data from Endpoint Detection and Response (EDR) agents, focusing
  on process and command-line telemetry. This behavior is significant because JScript
  files are typically executed by wscript.exe, making cscript.exe execution unusual
  and potentially indicative of malicious activity, such as the FIN7 group's tactics.
  If confirmed malicious, this activity could allow attackers to execute arbitrary
  scripts, leading to code execution, data exfiltration, or further system compromise.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.parent_process_name
  = "cscript.exe" AND Processes.parent_process = "*//e:jscript*") OR (Processes.process_name
  = "cscript.exe" AND Processes.process = "*//e:jscript*") by Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.process_id Processes.process
  Processes.dest Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `jscript_execution_using_cscript_app_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: unknown
references:
- https://www.mandiant.com/resources/fin7-pursuing-an-enigmatic-and-evasive-global-criminal-operation
- https://attack.mitre.org/groups/G0046/
tags:
  analytic_story:
  - FIN7
  - Remcos
  asset_type: Endpoint
  confidence: 70
  impact: 70
  message: Process name $process_name$ with commandline $process$ to execute jscript
    in $dest$
  mitre_attack_id:
  - T1059
  - T1059.007
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_name
  - Processes.process_id
  - Processes.process
  - Processes.dest
  - Processes.user
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/fin7/fin7_macro_js_1/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
