name: Kerberos Pre-Authentication Flag Disabled with PowerShell
id: 59b51620-94c9-11ec-b3d5-acde48001122
version: 1
date: '2022-02-23'
author: Mauricio Velazco, Splunk
type: TTP
datamodel: []
description: The following analytic utilizes PowerShell Script Block Logging (EventCode=4104)
  to identify the execution of the `Set-ADAccountControl` commandlet with specific
  parameters. `Set-ADAccountControl` is part of the Active Directory PowerShell module
  used to manage Windows Active Directory networks. As the name suggests, `Set-ADAccountControl`
  is used to modify User Account Control values for an Active Directory domain account.
  With the appropiate parameters, Set-ADAccountControl allows adversaries to disable
  Kerberos Pre-Authentication for an account to to easily perform a brute force attack
  against the user's password offline leveraging the ASP REP Roasting technique. Red
  Teams and adversaries alike who have obtained privileges in an Active Directory
  network may use this technique as a backdoor or a way to escalate privileges.
search: ' `powershell` EventCode=4104 (Message = "*Set-ADAccountControl*" AND Message="*DoesNotRequirePreAuth:$true*")
  | stats count min(_time)  as firstTime max(_time) as lastTime by EventCode Message
  ComputerName User | `security_content_ctime(firstTime)` | `kerberos_pre_authentication_flag_disabled_with_powershell_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: Although unlikely, Administrators may need to set this flag
  for legitimate purposes.
references:
- https://docs.microsoft.com/en-us/troubleshoot/windows-server/identity/useraccountcontrol-manipulate-account-properties
- https://m0chan.github.io/2019/07/31/How-To-Attack-Kerberos-101.html
- https://stealthbits.com/blog/cracking-active-directory-passwords-with-as-rep-roasting/
tags:
  analytic_story:
  - Active Directory Kerberos Attacks
  asset_type: endpoint
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  - Stage:Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1558.004/powershell/windows-powershell.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: Kerberos Pre Authentication was Disabled using PowerShell on $dest$
  mitre_attack_id:
  - T1558
  - T1558.004
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  risk_score: 45
  security_domain: endpoint
