name: Kerberos Pre-Authentication Flag Disabled with PowerShell
id: 59b51620-94c9-11ec-b3d5-acde48001122
version: 3
date: '2024-05-12'
author: Mauricio Velazco, Splunk
status: production
type: TTP
description: The following analytic detects the use of the `Set-ADAccountControl`
  PowerShell cmdlet with parameters that disable Kerberos Pre-Authentication. It leverages
  PowerShell Script Block Logging (EventCode=4104) to identify this specific command
  execution. Disabling Kerberos Pre-Authentication is significant because it allows
  adversaries to perform offline brute force attacks against user passwords using
  the AS-REP Roasting technique. If confirmed malicious, this activity could enable
  attackers to escalate privileges or maintain persistence within an Active Directory
  environment, posing a severe security risk.
data_source:
- Powershell Script Block Logging 4104
search: '`powershell` EventCode=4104 (ScriptBlockText = "*Set-ADAccountControl*" AND
  ScriptBlockText="*DoesNotRequirePreAuth:$true*") | stats count min(_time) as firstTime
  max(_time) as lastTime by EventCode ScriptBlockText Computer user_id | rename Computer
  as dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `kerberos_pre_authentication_flag_disabled_with_powershell_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: Although unlikely, Administrators may need to set this flag
  for legitimate purposes.
references:
- https://docs.microsoft.com/en-us/troubleshoot/windows-server/identity/useraccountcontrol-manipulate-account-properties
- https://m0chan.github.io/2019/07/31/How-To-Attack-Kerberos-101.html
- https://stealthbits.com/blog/cracking-active-directory-passwords-with-as-rep-roasting/
tags:
  analytic_story:
  - Active Directory Kerberos Attacks
  asset_type: Endpoint
  confidence: 90
  impact: 50
  message: Kerberos Pre Authentication was Disabled using PowerShell on $dest$
  mitre_attack_id:
  - T1558
  - T1558.004
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - ScriptBlockText
  - Computer
  - user_id
  risk_score: 45
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1558.004/powershell/windows-powershell-xml.log
    source: XmlWinEventLog:Microsoft-Windows-PowerShell/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
