name: Linux Unix Shell Enable All SysRq Functions
id: e7a96937-3b58-4962-8dce-538e4763cf15
version: 1
date: '2023-04-14'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: This analytic is to look for possible execution of SysReq hack to enable
  all functions of kernel system requests of the Linux system host. This technique
  was seen in AwfulShred malware wiper to reboot the compromised host by using the
  linux magic sysreq key. This kernel configuration can be triggered by piping out
  bitmask '1' to /proc/sys/kernel/sysrq. This TTP detection can be a good indicator
  of possible suspicious processes running on the Linux host since this command is
  not so common shell commandline.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name IN ("dash",
  "sudo", "bash")  Processes.process =  "* echo 1 &gt; *" Processes.process = "*/proc/sys/kernel/sysrq"
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id Processes.process_guid
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `linux_unix_shell_enable_all_sysrq_functions_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you can use the Add-on for Linux Sysmon from
  Splunkbase.
known_false_positives: unknown
references:
- https://www.kernel.org/doc/html/latest/admin-guide/sysrq.html
- https://cert.gov.ua/article/3718487
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/overview-of-the-cyber-weapons-used-in-the-ukraine-russia-war/
tags:
  analytic_story:
  - AwfulShred
  - Data Destruction
  asset_type: Endpoint
  confidence: 60
  impact: 60
  message: a $process_name$ execute sysrq command $process$ to enable all function
    of system request in $dest$
  mitre_attack_id:
  - T1059.004
  - T1059
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_name
  - Processes.process_path
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 36
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/awfulshred/test2/sysmon_linux.log
    source: Syslog:Linux-Sysmon/Operational
    sourcetype: sysmon_linux
    update_timestamp: true
