name: Linux Iptables Firewall Modification
id: 309d59dc-1e1b-49b2-9800-7cf18d12f7b7
version: 3
date: '2023-04-12'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
datamodel:
- Endpoint
description: This analytic looks for suspicious commandline that modify the iptables
  firewall setting of a linux machine. This technique was seen in cyclopsblink malware
  where it modifies the firewall setting of the compromised machine to allow traffic
  to its tcp port that will be used to communicate with its C2 server.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where  Processes.process = "*iptables
  *" AND Processes.process = "* --dport *" AND Processes.process = "* ACCEPT*" AND
  Processes.process = "*&amp;&gt;/dev/null*" AND Processes.process = "* tcp *" AND
  NOT(Processes.parent_process_path IN("/bin/*", "/lib/*", "/usr/bin/*", "/sbin/*"))
  by Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  Processes.process_guid Processes.dest _time span=10s Processes.user Processes.parent_process_name  Processes.parent_process_path
  Processes.process_path | rex field=Processes.process "--dport (?<port>3269|636|989|994|995|8443)"
  | stats values(Processes.process) as processes_exec values(port) as ports values(Processes.process_guid)
  as guids values(Processes.process_id) as pids dc(port) as port_count count by Processes.process_name
  Processes.parent_process_name Processes.parent_process_id Processes.dest Processes.user
  Processes.parent_process_path Processes.process_path | where port_count >=3 | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `linux_iptables_firewall_modification_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you can use the Add-on for Linux Sysmon from
  Splunkbase.
known_false_positives: administrator may do this commandline for auditing and testing
  purposes. In this scenario filter is needed.
references:
- https://www.ncsc.gov.uk/files/Cyclops-Blink-Malware-Analysis-Report.pdf
- https://www.trendmicro.com/en_us/research/22/c/cyclops-blink-sets-sights-on-asus-routers--.html
tags:
  analytic_story:
  - Sandworm Tools
  - CyclopsBLink
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: A commandline $process$ that may modify iptables firewall on $dest$
  mitre_attack_id:
  - T1562.004
  - T1562
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 25
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/cyclopsblink/sysmon_linux.log
    source: Syslog:Linux-Sysmon/Operational
    sourcetype: sysmon_linux
