name: Linux Visudo Utility Execution
id: 08c41040-624c-11ec-a71f-acde48001122
version: 1
date: '2021-12-21'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: This analytic is to looks for suspicious commandline that add entry to /etc/sudoers by using visudo utility tool in linux platform. 
  This technique may abuse by adversaries, malware author and red teamers to gain elevated privilege to targeted or compromised host. 
  /etc/sudoers file controls who can run what commands as what users on what machines and can also control special things such as whether you need a password for particular commands. 
  The file is composed of aliases (basically variables) and user specifications (which control who can run what).
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where 
  Processes.process_name = visudo
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name Processes.process Processes.process_id Processes.parent_process_id Processes.process_guid
  | `drop_dm_object_name(Processes)` 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)`
  | `linux_visudo_utility_execution_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. 
known_false_positives: administrator or network operator can execute this command. filter is needed 
references:
-  https://askubuntu.com/questions/334318/sudoers-file-enable-nopasswd-for-user-all-commands
tags:
  analytic_story:
  - Linux Privilege Escalation
  - Linux Persistence Techniques
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548.003/visudo/sysmon_linux.log
  kill_chain_phases:
  - Privilege Escalation
  mitre_attack_id:
  - T1548.003
  - T1548
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest 
  - Processes.user 
  - Processes.parent_process_name 
  - Processes.process_name 
  - Processes.process 
  - Processes.process_id 
  - Processes.parent_process_id
  security_domain: endpoint
  impact: 40
  confidence: 40 
  # (impact * confidence)/100
  risk_score: 16 
  context:
  - source:endpoint
  - stage:Privilege Escalation Persistence
  message: a commandline $process$ executed on $dest$
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  nist:
  - DE.CM
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16