author: Teoderick Contreras, Splunk
datamodel:
- Endpoint.Processes
date: '2021-12-17'
description: The following analytic identifies a suspicious cronjobs modification
  using crontab edit parameter. This commandline parameter can be abuse by malware
  author, adversaries, and red red teamers to add cronjob entry to their malicious
  code to execute to the schedule they want. This event can also be executed by administrator
  or normal user for automation purposes so filter is needed.
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you can use the Add-on for Linux Sysmon from
  Splunkbase.
id: 0d370304-5f26-11ec-a4bb-acde48001122
known_false_positives: Administrator or network operator can use this application
  for automation purposes. Please update the filter macros to remove false positives.
name: Linux Edit Cron Table Parameter
references:
- https://attack.mitre.org/techniques/T1053/003/
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name = crontab
  Processes.process = "*crontab *" Processes.process = "* -e*" by Processes.dest Processes.user
  Processes.parent_process_name Processes.process_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `linux_edit_cron_table_parameter_filter`'
tags:
  analytic_story:
  - Linux Privilege Escalation
  - Linux Persistence Techniques
  automated_detection_testing: passed
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 30
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  - Stage:Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1053.003/crontab_edit_parameter/sysmon_linux.log
  impact: 30
  kill_chain_phases:
  - Privilege Escalation
  message: A possible crontab edit command $process$ executed on $dest$
  mitre_attack_id:
  - T1053.003
  - T1053
  nist:
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process_id
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 9
  security_domain: endpoint
type: Hunting
version: 1
