name: Linux c99 Privilege Escalation
id: e1c6dec5-2249-442d-a1f9-99a4bd228183
version: 1
date: '2022-08-11'
author: Gowthamaraj Rajendran, Splunk
status: production
type: Anomaly
description: The c99 utility is an interface to the standard C compilation system;
  it shall accept source code conforming to the ISO C standard. The system conceptually
  consists of a compiler and link editor. If sudo right is given to ruby application
  for the user, then the user can run system commands as root and possibly get a root
  shell.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process="*c99*" AND
  Processes.process="*-wrapper*" AND Processes.process="*sudo*" by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id Processes.process_guid | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `linux_c99_privilege_escalation_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints into the Endpoint datamodel. If you are using Sysmon, you can use the
  Add-on for Linux Sysmon from Splunkbase.
known_false_positives: False positives may be present, filter as needed.
references:
- https://gtfobins.github.io/gtfobins/c99/
- https://pubs.opengroup.org/onlinepubs/009604499/utilities/c99.html
tags:
  analytic_story:
  - Linux Privilege Escalation
  - Linux Living Off The Land
  asset_type: Endpoint
  confidence: 50
  impact: 60
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$
  mitre_attack_id:
  - T1548.003
  - T1548
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 30
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548/c99/sysmon_linux.log
    source: Syslog:Linux-Sysmon/Operational
    sourcetype: sysmon_linux
    update_timestamp: true
