author: Teoderick Contreras, Splunk
datamodel:
- Endpoint.Processes
date: '2022-02-14'
description: This analytic is to look for dd command to overwrite file. This technique
  was abused by adversaries or threat actor to destroy files or data on specific system
  or in a large number of host within network to interrupt host avilability, services
  and many more. This is also used to destroy data where it make the file irrecoverable
  by forensic techniques through overwriting files, data or local and remote drives.
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you can use the Add-on for Linux Sysmon from
  Splunkbase.
id: 9b6aae5e-8d85-11ec-b2ae-acde48001122
known_false_positives: Administrator or network operator can execute this command.
  Please update the filter macros to remove false positives.
name: Linux DD File Overwrite
references:
- https://gtfobins.github.io/gtfobins/dd/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1485/T1485.md
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name = "dd"
  AND Processes.process = "*of=*" by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  Processes.process_guid | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `linux_dd_file_overwrite_filter`'
tags:
  analytic_story:
  - Data Destruction
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Impact
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1485/linux_dd_file_overwrite/sysmon_linux.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: A commandline $process$ executed on $dest$
  mitre_attack_id:
  - T1485
  nist:
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process_id
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_guid
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 64
  security_domain: endpoint
type: TTP
version: 1
