author: Teoderick Contreras, Splunk
datamodel:
- Endpoint.Processes
date: '2021-12-21'
description: This analytic looks for commands to create user accounts on the linux
  platform. This technique is commonly abuse by adversaries, malware author and red
  teamers to persist on the targeted or compromised host by creating new user with
  an elevated privilege. This Hunting query may catch normal creation of user by administrator
  so filter is needed.
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you can use the Add-on for Linux Sysmon from
  Splunkbase.
id: 51fbcaf2-6259-11ec-b0f3-acde48001122
known_false_positives: Administrator or network operator can execute this command.
  Please update the filter macros to remove false positives.
name: Linux Add User Account
references:
- https://linuxize.com/post/how-to-create-users-in-linux-using-the-useradd-command/
search: '| tstats `security_content_summariesonly` count from datamodel=Endpoint.Processes
  where Processes.process_name IN ("useradd", "adduser") OR Processes.process IN ("*useradd
  *", "*adduser *") by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  Processes.process_guid | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `linux_add_user_account_filter`'
tags:
  analytic_story:
  - Linux Privilege Escalation
  - Linux Persistence Techniques
  automated_detection_testing: passed
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  - Stage:Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548.003/linux_adduser/sysmon_linux.log
  impact: 50
  kill_chain_phases:
  - Privilege Escalation
  message: A commandline $process$ that may create user account on $dest$
  mitre_attack_id:
  - T1136.001
  - T1136
  nist:
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process_id
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_guid
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  risk_score: 25
  security_domain: endpoint
type: Hunting
version: 1
