name: Linux Deletion Of Cron Jobs
id: 3b132a71-9335-4f33-9932-00bb4f6ac7e8
version: 1
date: '2022-04-12'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint.Filesystem
- Endpoint.Processes
description: This analytic is to detect a deletion of cron job in a linux machine.
  This technique can be related to an attacker, threat actor or malware to disable
  scheduled cron jobs that might be related to security or to evade some detections.
  We also saw that this technique can be a good indicator for malware that is trying
  to wipe or delete several files on the compromised host like the acidrain malware.
  This anomaly detection can be a good pivot detection to look for process and user
  doing it why they doing. Take note that this event can be done by administrator
  so filtering on those possible false positive event is needed.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.action=deleted Filesystem.file_path
  ="/etc/cron.*" by _time span=1h Filesystem.file_name Filesystem.file_path Filesystem.dest
  Filesystem.process_guid Filesystem.action | `drop_dm_object_name(Filesystem)` |rename
  process_guid as proc_guid |join proc_guid, _time [ | tstats `security_content_summariesonly`
  count FROM datamodel=Endpoint.Processes where Processes.parent_process_name != unknown
  by _time span=1h Processes.process_id Processes.process_name Processes.process Processes.dest
  Processes.parent_process_name Processes.parent_process Processes.process_path Processes.process_guid
  | `drop_dm_object_name(Processes)` |rename process_guid as proc_guid | fields _time
  dest user parent_process_name parent_process process_name process_path process proc_guid
  registry_path registry_value_name registry_value_data registry_key_name action]
  | table  process_name process proc_guid file_name file_path action _time parent_process_name
  parent_process  process_path dest user | `linux_deletion_of_cron_jobs_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you can use the Add-on for Linux Sysmon from
  Splunkbase.
known_false_positives: Administrator or network operator can execute this command.
  Please update the filter macros to remove false positives.
references:
- https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/
tags:
  analytic_story:
  - AcidRain
  asset_type: endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/acidrain/sysmon_linux.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: a $process_name$ deleting cron jobs in $dest$
  mitre_attack_id:
  - T1485
  - T1070.004
  - T1070
  nist:
  - DE.CM
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Filesystem.dest
  - Filesystem.file_create_time
  - Filesystem.file_name
  - Filesystem.process_guid
  - Filesystem.file_path
  - Filesystem.action
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_name
  - Processes.process_path
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 49
  security_domain: endpoint
