name: Linux High Frequency Of File Deletion In Etc Folder
id: 9d867448-2aff-4d07-876c-89409a752ff8
version: 1
date: '2022-04-12'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: This analytic is to detect a high frequency of file deletion relative
  to process name and process id /etc/ folder. These events was seen in acidrain wiper
  malware where it tries to delete all files in a non-standard directory in linux
  directory. This detection already contains some filter that might cause false positive
  during our testing. But we recommend to add more filter if needed.
data_source:
- Sysmon Event ID 11
search: '| tstats `security_content_summariesonly` values(Filesystem.file_name) as
  deletedFileNames values(Filesystem.file_path) as deletedFilePath dc(Filesystem.file_path)
  as numOfDelFilePath count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem
  where Filesystem.action=deleted Filesystem.file_path = "/etc/*" by _time span=1h  Filesystem.dest
  Filesystem.process_guid Filesystem.action | `drop_dm_object_name(Filesystem)` |rename
  process_guid as proc_guid |join proc_guid, _time [ | tstats `security_content_summariesonly`
  count FROM datamodel=Endpoint.Processes where Processes.parent_process_name != unknown
  NOT (Processes.parent_process_name IN ("/usr/bin/dpkg", "*usr/bin/python*", "*/usr/bin/apt-*",
  "/bin/rm", "*splunkd", "/usr/bin/mandb")) by _time span=1h Processes.process_id
  Processes.process_name Processes.process Processes.dest Processes.parent_process_name
  Processes.parent_process Processes.process_path Processes.process_guid | `drop_dm_object_name(Processes)`
  |rename process_guid as proc_guid | fields _time dest user parent_process_name parent_process
  process_name process_path process proc_guid registry_path registry_value_name registry_value_data
  registry_key_name action] | table  process_name process proc_guid action _time  deletedFileNames
  deletedFilePath numOfDelFilePath parent_process_name parent_process  process_path
  dest user | where  numOfDelFilePath >= 200 | `linux_high_frequency_of_file_deletion_in_etc_folder_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you can use the Add-on for Linux Sysmon from
  Splunkbase.
known_false_positives: linux package installer/uninstaller may cause this event. Please
  update you filter macro to remove false positives.
references:
- https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/
tags:
  analytic_story:
  - AcidRain
  asset_type: endpoint
  confidence: 70
  impact: 70
  message: a $process_name$ deleting multiple files in /etc/ folder in $dest$
  mitre_attack_id:
  - T1485
  - T1070.004
  - T1070
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/acidrain/sysmon_linux.log
    source: Syslog:Linux-Sysmon/Operational
    sourcetype: sysmon_linux
