name: Linux Node Privilege Escalation
id: 2e58a4ff-398f-42f4-8fd0-e01ebfe2a8ce
version: 1
date: '2022-07-31'
author: Gowthamaraj Rajendran, Splunk
status: production
type: Anomaly
description: Node.js is a back-end JavaScript runtime environment that is open-source,
  cross-platform, runs on the V8 engine, and executes JavaScript code outside of a
  web browser. It was created to help create scalable network applications. If the
  binary is allowed to run as superuser by sudo, it does not drop the elevated privileges
  and may be used to access the file system, escalate or maintain privileged access.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process="*sudo*node*"
  AND Processes.process="*-e*" AND Processes.process="*child_process.spawn*" AND Processes.process="*stdio*"
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id Processes.process_guid
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `linux_node_privilege_escalation_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints into the Endpoint datamodel. If you are using Sysmon, you can use the
  Add-on for Linux Sysmon from Splunkbase.
known_false_positives: False positives are present based on automated tooling or system
  administrative usage. Filter as needed.
references:
- https://gtfobins.github.io/gtfobins/docker/
- https://en.wikipedia.org/wiki/Node.js
tags:
  analytic_story:
  - Linux Privilege Escalation
  - Linux Living Off The Land
  asset_type: Endpoint
  confidence: 50
  impact: 80
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$
  mitre_attack_id:
  - T1548.003
  - T1548
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 40
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548/node/sysmon_linux.log
    source: Syslog:Linux-Sysmon/Operational
    sourcetype: sysmon_linux
    update_timestamp: true
