author: Teoderick Contreras, Splunk
datamodel:
- Endpoint.Processes
date: '2021-12-21'
description: This analytic is to looks for suspicious commandline that add entry to
  /etc/sudoers by using visudo utility tool in linux platform. This technique may
  abuse by adversaries, malware author and red teamers to gain elevated privilege
  to targeted or compromised host. /etc/sudoers file controls who can run what commands
  as what users on what machines and can also control special things such as whether
  you need a password for particular commands. The file is composed of aliases (basically
  variables) and user specifications (which control who can run what).
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you can use the Add-on for Linux Sysmon from
  Splunkbase.
id: 08c41040-624c-11ec-a71f-acde48001122
known_false_positives: Administrator or network operator can execute this command.
  Please update the filter macros to remove false positives.
name: Linux Visudo Utility Execution
references:
- https://askubuntu.com/questions/334318/sudoers-file-enable-nopasswd-for-user-all-commands
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name = visudo
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id Processes.process_guid
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `linux_visudo_utility_execution_filter`'
tags:
  analytic_story:
  - Linux Privilege Escalation
  - Linux Persistence Techniques
  automated_detection_testing: passed
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 40
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  - Stage:Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548.003/visudo/sysmon_linux.log
  impact: 40
  kill_chain_phases:
  - Privilege Escalation
  message: A commandline $process$ executed on $dest$
  mitre_attack_id:
  - T1548.003
  - T1548
  nist:
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process_id
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_guid
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 16
  security_domain: endpoint
type: Anomaly
version: 1
