author: Teoderick Contreras, Splunk
datamodel:
- Endpoint.Filesystem
date: '2021-12-20'
description: This analytic looks for suspicious file creation in /etc/profile.d directory
  to automatically execute scripts by shell upon boot up of a linux machine. This
  technique is commonly abused by adversaries, malware and red teamers as a persistence
  mechanism to the targeted or compromised host. This Anomaly detection is a good
  indicator that someone wants to run a code after boot up which can be done also
  by the administrator or network operator for automation purposes.
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the file name, file path, and process_guid executions from your endpoints.
  If you are using Sysmon, you can use the Add-on for Linux Sysmon from Splunkbase.
id: 46ba0082-61af-11ec-9826-acde48001122
known_false_positives: Administrator or network operator can create file in profile.d
  folders for automation purposes. Please update the filter macros to remove false
  positives.
name: Linux File Creation In Profile Directory
references:
- https://attack.mitre.org/techniques/T1546/004/
- https://www.intezer.com/blog/research/kaiji-new-chinese-linux-malware-turning-to-golang/
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_path IN ("*/etc/profile.d/*")
  by Filesystem.dest Filesystem.file_create_time Filesystem.file_name Filesystem.process_guid
  Filesystem.file_path | `drop_dm_object_name(Filesystem)` | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)` | `linux_file_creation_in_profile_directory_filter`'
tags:
  analytic_story:
  - Linux Privilege Escalation
  - Linux Persistence Techniques
  automated_detection_testing: passed
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  - Stage:Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1546.004/linux_init_profile/sysmon_linux.log
  impact: 70
  kill_chain_phases:
  - Privilege Escalation
  message: A file $file_name$ is created in $file_path$ on $dest$
  mitre_attack_id:
  - T1546.004
  - T1546
  nist:
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Filesystem.dest
  - Endpoint.Filesystem.file_create_time
  - Endpoint.Filesystem.file_name
  - Endpoint.Filesystem.file_path
  - Endpoint.Filesystem.process_guid
  - _time
  risk_score: 56
  security_domain: endpoint
type: Anomaly
version: 1
