name: Linux Find Privilege Escalation
id: 2ff4e0c2-8256-4143-9c07-1e39c7231111
version: 1
date: '2022-08-09'
author: Gowthamaraj Rajendran, Splunk
status: production
type: Anomaly
description: Find is a command-line utility that locates files based on some user-specified
  criteria and either prints the pathname of each matched object or, if another action
  is requested, performs that action on each matched object. If sudo right is given
  to find utility for the user, then the user can run system commands as root and
  possibly get a root shell.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process="*find*" AND
  Processes.process="*-exec*" AND Processes.process="*sudo*" by Processes.dest Processes.user
  Processes.parent_process_name Processes.process_name Processes.process Processes.process_id
  Processes.parent_process_id Processes.process_guid | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `linux_find_privilege_escalation_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints into the Endpoint datamodel. If you are using Sysmon, you can use the
  Add-on for Linux Sysmon from Splunkbase.
known_false_positives: False positives are present based on automated tooling or system
  administrative usage. Filter as needed.
references:
- https://gtfobins.github.io/gtfobins/find/
- https://en.wikipedia.org/wiki/Find_(Unix)
tags:
  analytic_story:
  - Linux Privilege Escalation
  - Linux Living Off The Land
  asset_type: Endpoint
  confidence: 50
  impact: 10
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$
  mitre_attack_id:
  - T1548.003
  - T1548
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 5
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548/find/sysmon_linux.log
    source: Syslog:Linux-Sysmon/Operational
    sourcetype: sysmon_linux
    update_timestamp: true
