name: Linux Indicator Removal Service File Deletion
id: 6c077f81-2a83-4537-afbc-0e62e3215d55
version: 1
date: '2023-02-08'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: This analytic looks for suspicious linux processes that delete service unit configuration files. 
  This technique was seen in several malware to delete service configuration files to corrupt a services or security product as part of its defense evasion. 
  This TTP detection can be a good indicator of possible malware try to kill several services or a wiper like AwfulShred shell script that wipes the 
  targeted linux host
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes 
  where Processes.process_name = "rm"  AND Processes.process = "*rm *"  AND Processes.process = "*.service"
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name Processes.process Processes.process_id 
  Processes.parent_process_id Processes.process_guid 
  | `drop_dm_object_name(Processes)` 
  | `security_content_ctime(firstTime)` 
  | `linux_indicator_removal_service_file_deletion_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you can use the Add-on for Linux Sysmon from
  Splunkbase.
known_false_positives: network admin can delete services unit configuration file as part of normal software installation. Filter is needed.
references:
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/overview-of-the-cyber-weapons-used-in-the-ukraine-russia-war/
- https://cert.gov.ua/article/3718487
tags:
  analytic_story:
  - AwfulShred
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 60
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/awfulshred/test1/sysmon_linux.log
  impact: 60
  kill_chain_phases:
  - Exploitation
  message: a $process_name$ has a commandline $process$ to delete service configuration file in $dest$
  mitre_attack_id:
  - T1070.004
  - T1070
  nist:
  - DE.CM
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 49
  security_domain: endpoint
