name: Linux Doas Conf File Creation
id: f6343e86-6e09-11ec-9376-acde48001122
version: 1
date: '2022-01-05'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: This analytic is to detect the creation of doas.conf file in linux host
  platform. This configuration file can be use by doas utility tool to allow or permit
  standard users to perform tasks as root, the same way sudo does. This tool is developed
  as a minimalistic alternative to sudo application. This tool can be abused advesaries,
  attacker or malware to gain elevated privileges to the targeted or compromised host.
  On the other hand this can also be executed by administrator for a certain task
  that needs admin rights. In this case filter is needed.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_path IN ("*/etc/doas.conf")
  by Filesystem.dest Filesystem.file_create_time Filesystem.file_name Filesystem.process_guid
  Filesystem.file_path | `drop_dm_object_name(Filesystem)` | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)` | `linux_doas_conf_file_creation_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: administrator or network operator can execute this command.
  filter is needed
references:
- https://wiki.gentoo.org/wiki/Doas
- https://www.makeuseof.com/how-to-install-and-use-doas/
tags:
  analytic_story:
  - Linux Privilege Escalation
  - Linux Persistence Techniques
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548.003/doas/sysmon_linux.log
  kill_chain_phases:
  - Privilege Escalation
  mitre_attack_id:
  - T1548.003
  - T1548
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Filesystem.dest
  - Filesystem.file_create_time
  - Filesystem.file_name
  - Filesystem.process_guid
  - Filesystem.file_path
  security_domain: endpoint
  impact: 70
  confidence: 70
  risk_score: 49
  context:
  - source:endpoint
  - stage:Privilege Escalation Persistence
  message: a file $file_name$ is created in $file_path$ on $dest$
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  nist:
  - DE.CM
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  automated_detection_testing: passed
