name: Linux System Network Discovery
id: 535cb214-8b47-11ec-a2c7-acde48001122
version: 1
date: '2022-02-11'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: This analytic is to look for possible enumeration of local network configuration.
  This technique is commonly used as part of recon of adversaries or threat actor
  to know some network information for its next or further attack. This anomaly detections
  may capture normal event made by administrator during auditing or testing network
  connection of specific host or network to network.
search: '| tstats `security_content_summariesonly` count values(Processes.process_name)
  as process_name_list values(Processes.process) as process_list values(Processes.process_id)
  as process_id_list values(Processes.parent_process_id) as parent_process_id_list
  values(Processes.process_guid) as process_guid_list dc(Processes.process_name) as
  process_name_count from datamodel=Endpoint.Processes where Processes.process_name
  IN ("arp", "ifconfig", "ip", "netstat", "firewall-cmd", "ufw", "iptables", "ss",
  "route") by _time span=30m Processes.dest Processes.user | where process_name_count
  >=4 | `drop_dm_object_name(Processes)`| `linux_system_network_discovery_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you can use the Add-on for Linux Sysmon from
  Splunkbase.
known_false_positives: Administrator or network operator can execute this command.
  Please update the filter macros to remove false positives.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1016/T1016.md
tags:
  analytic_story:
  - Network Discovery
  asset_type: endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 30
  context:
  - Source:Endpoint
  - Stage:Recon
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1016/atomic_red_team/linux_net_discovery/sysmon_linux.log
  impact: 30
  kill_chain_phases:
  - Reconnaissance
  message: A commandline $process$ executed on $dest$
  mitre_attack_id:
  - T1016
  nist:
  - DE.CM
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 9
  security_domain: endpoint
