name: Linux Possible Append Command To At Allow Config File
id: 7bc20606-5f40-11ec-a586-acde48001122
version: 1
date: '2021-12-17'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: This analytic looks for suspicious commandline that may use to append
  user entry to /etc/at.allow or /etc/at.deny. These 2 files are commonly abused by
  malware, adversaries or red teamers to persist on the targeted or compromised host.
  These config file can restrict user that can only execute at application (another
  schedule task application in linux). attacker can create a user or add the compromised
  username to that config file to execute at to schedule it malicious code. This anomaly
  detection can be a good indicator to investigate further the entry in created config
  file and who created it to verify if it is a false positive.
search: '| tstats `security_content_summariesonly` count from datamodel=Endpoint.Processes
  where Processes.process = "*echo*" AND Processes.process IN("*/etc/at.allow", "*/etc/at.deny")
  by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id Processes.process_guid
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `linux_possible_append_command_to_at_allow_config_file_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you can use the Add-on for Linux Sysmon from
  Splunkbase.
known_false_positives: Administrator or network operator can use this commandline
  for automation purposes. Please update the filter macros to remove false positives.
references:
- https://linuxize.com/post/at-command-in-linux/
- https://attack.mitre.org/techniques/T1053/001/
tags:
  analytic_story:
  - Linux Privilege Escalation
  - Linux Persistence Techniques
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 30
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  - Stage:Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1053.001/at_execution/sysmon_linux.log
  impact: 30
  kill_chain_phases:
  - Exploitation
  message: A commandline $process$ that may modify at allow config file in $dest$
  mitre_attack_id:
  - T1053.001
  - T1053
  nist:
  - DE.CM
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 9
  security_domain: endpoint
  asset_type: Endpoint
