name: Living Off The Land
id: 1be30d80-3a39-4df9-9102-64a467b24abc
version: 1
date: '2022-07-08'
author: Michael Haag, Splunk
type: Correlation
datamodel:
  - Risk
description: The following correlation identifies a distinct amount of analytics associated with the Living Off The Land analytic story that identify potentially suspicious behavior. 
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Risk.All_Risk where All_Risk.analyticstories="Living Off The Land" All_Risk.risk_object_type="system" by All_Risk.risk_object All_Risk.annotations.mitre_attack.mitre_tactic source 
  | `drop_dm_object_name(All_Risk)` 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | stats  values(source) as detection_name values(annotations.mitre_attack.mitre_tactic) as tactics values(firstTime) as firstTime values(lastTime) as lastTime dc(annotations.mitre_attack.mitre_tactic) as distinct_tactics dc(source) as distinct_detection_name by risk_object
  | where distinct_detection_name >= 2
  | `living_off_the_land_filter`'
how_to_implement: To implement this correlation search a user needs to enable all
  detections in the Living Off The Land Analytic Story and confirm it is generating risk events.
  A simple search `index=risk analyticstories="Living Off The Land"` should contain
  events.
known_false_positives: There are no known false positive for this search, but it could
  contain false positives as multiple detections can trigger and not have successful
  exploitation. Modify the static value distinct_detection_name to a higher value. It is also required to tune analytics that are also tagged to ensure volume is never too much.
references:
  - https://www.splunk.com/en_us/blog/security/living-off-the-land-threat-research-february-2022-release.html
  - https://research.splunk.com/stories/living_off_the_land/
tags:
  analytic_story:
  - Living Off The Land
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 70
  context:
  - Source:Endpoint
  dataset:
    - https://raw.githubusercontent.com/splunk/attack_data/master/datasets/attack_techniques/T1218/living_off_the_land/lolbinrisk.log
  impact: 90
  kill_chain_phases:
  - Reconnaissance
  - Exploitation
  message: An increase of Living Off The Land behavior has been detected on $affected_systems$
  mitre_attack_id:
  - T1105
  - T1190
  - T1059
  nist:
  - DE.CM
  observable:
  - name: affected_systems
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Risk.analyticstories
  - All_Risk.risk_object_type
  - All_Risk.risk_object
  - All_Risk.annotations.mitre_attack.mitre_tactic
  - source
  risk_score: 63
  security_domain: endpoint
