name: Local Account Discovery With Wmic
id: 4902d7aa-0134-11ec-9d65-acde48001122
version: 1
date: '2021-08-19'
author: Mauricio Velazco, Splunk
type: batch
datamodel:
- Endpoint
description: This analytic looks for the execution of `wmic.exe` with command-line
  arguments utilized to query for local users. The argument `useraccount` is used to leverage WMI to return a list of all local users. 
  Red Teams and adversaries alike use net.exe to enumerate users for situational awareness and Active Directory Discovery.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name="wmic.exe") (Processes.process=*useraccount*) 
  by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `local_account_discovery_with_wmic_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Administrators or power users may use this command for troubleshooting.
references:
- https://attack.mitre.org/techniques/T1087/001/
tags:
  analytic_story:
  - Active Directory Discovery
  dataset:
  - UPDATE_DATASET_URL
  kill_chain_phases:
  - Reconnaissance
  mitre_attack_id:
  - T1087.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  security_domain: endpoint
  impact: 30
  confidence: 50
  risk_score: 15
  context:
  - Source:Endpoint
  - Stage:Discovery
  - Stage:Recon
  message: Local user discovery enumeration on $dest$ by $user$
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim