name: Malicious PowerShell Process - Connect To Internet With Hidden Window
id: ee18ed37-0802-4268-9435-b3b91aaa18db
version: 5
date: '2020-11-20'
author: David Dorsey, Splunk
type: batch
datamodel:
- Endpoint
description: This search looks for PowerShell processes started with parameters to
  modify the execution policy of the run, run in a hidden window, and connect to the
  Internet. This combination of command-line options is suspicious because it's overriding
  the default PowerShell execution policy, attempts to hide its activity from the
  user, and connects to the Internet. Deprecated becaue hidden is not needed when
  download file with System.Net.WebClient.
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  as process values(Processes.parent_process) as parent_process min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=powershell.exe
  Processes.process=*-WindowStyle* Processes.process=*hidden* Processes.process="*New-Object*"
  by Processes.user Processes.process_name Processes.parent_process_name Processes.process
  Processes.dest | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`|
  `security_content_ctime(lastTime)` | `malicious_powershell_process___connect_to_internet_with_hidden_window_filter`'
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
known_false_positives: Legitimate process can have this combination of command-line
  options, but it's not common.
references: []
tags:
  analytic_story:
  - Malicious PowerShell
  - Possible Backdoor Activity Associated With MUDCARP Espionage Campaigns
  - HAFNIUM Group
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 3
  - CIS 7
  - CIS 8
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Execution
  - Stage:Command And Control
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.001/hidden_powershell/windows-sysmon.log
  impact: 90
  kill_chain_phases:
  - Command and Control
  - Actions on Objectives
  message: PowerShell processes $process$ started with parameters to modify the execution
    policy of the run, run in a hidden window, and connect to the Internet on host
    $dest$ executed by user $user$.
  mitre_attack_id:
  - T1059.001
  nist:
  - PR.PT
  - DE.CM
  - PR.IP
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  - name: process
    type: Process
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.process_name
  - Processes.user
  - Processes.parent_process_name
  - Processes.dest
  risk_score: 81
  security_domain: endpoint
