name: Malicious PowerShell Process With Obfuscation Techniques
id: cde75cf6-3c7a-4dd6-af01-27cdb4511fd4
version: 5
date: '2021-01-19'
author: David Dorsey, Splunk
type: TTP
datamodel:
- Endpoint
description: This search looks for PowerShell processes launched with arguments that
  have characters indicative of obfuscation on the command-line.
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  as process values(Processes.parent_process) as parent_process min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where `process_powershell`
  by Processes.user Processes.process_name Processes.original_file_name Processes.parent_process_name
  Processes.dest Processes.process | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`|
  `security_content_ctime(lastTime)`| eval num_obfuscation = (mvcount(split(process,"`"))-1)
  + (mvcount(split(process, "^"))-1) + (mvcount(split(process, "''"))-1) | `malicious_powershell_process_with_obfuscation_techniques_filter`
  | search num_obfuscation > 10 '
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: These characters might be legitimately on the command-line,
  but it is not common.
references: []
tags:
  analytic_story:
  - Hermetic Wiper
  - Malicious PowerShell
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 7
  - CIS 8
  confidence: 60
  context:
  - Source:Endpoint
  - Stage:Initial Access
  - Stage:Execution
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.001/obfuscated_powershell/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Command & Control
  - Actions on Objectives
  message: Powershell.exe running with potential obfuscated arguments on $dest$
  mitre_attack_id:
  - T1059
  - T1059.001
  nist:
  - PR.PT
  - DE.CM
  - PR.IP
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 42
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
