name: Monitor Registry Keys for Print Monitors
id: f5f6af30-7ba7-4295-bfe9-07de87c01bbc
version: 5
date: '2023-04-27'
author: Steven Dick, Bhavin Patel, Teoderick Contreras, Splunk
status: production
type: TTP
description: This search looks for registry activity associated with modifications
  to the registry key `HKLM\SYSTEM\CurrentControlSet\Control\Print\Monitors`. In this
  scenario, an attacker can load an arbitrary .dll into the print-monitor registry
  by giving the full path name to the after.dll. The system will execute the .dll
  with elevated (SYSTEM) permissions and will persist after reboot.
data_source:
- Sysmon EventID 12
- Sysmon EventID 13
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  WHERE (Registry.action=modified AND Registry.registry_path="*CurrentControlSet\\Control\\Print\\Monitors*")
  BY _time span=1h Registry.dest Registry.user Registry.registry_path Registry.registry_key_name Registry.registry_value_name
  Registry.registry_value_data Registry.process_guid | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `monitor_registry_keys_for_print_monitors_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the registry value name, registry path, and registry value data from your
  endpoints. If you are using Sysmon, you must have at least version 2.0 of the offical
  Sysmon TA. https://splunkbase.splunk.com/app/5709
known_false_positives: You will encounter noise from legitimate print-monitor registry
  entries.
references: []
tags:
  analytic_story:
  - Suspicious Windows Registry Activities
  - Windows Persistence Techniques
  - Windows Registry Abuse
  asset_type: Endpoint
  confidence: 80
  impact: 80
  message: New print monitor added on $dest$
  mitre_attack_id:
  - T1547.010
  - T1547
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.dest
  - Registry.registry_value_name
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.registry_value_data
  - Registry.process_guid
  risk_score: 64
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1547.010/atomic_red_team/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
