author: Bhavin Patel, Teoderick Contreras, Splunk
datamodel:
- Endpoint.Processes
- Endpoint.Registry
date: '2020-01-28'
description: This search looks for registry activity associated with modifications
  to the registry key `HKLM\SYSTEM\CurrentControlSet\Control\Print\Monitors`. In this
  scenario, an attacker can load an arbitrary .dll into the print-monitor registry
  by giving the full path name to the after.dll. The system will execute the .dll
  with elevated (SYSTEM) permissions and will persist after reboot.
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black, or via other endpoint data sources, such as Sysmon.
  The data used for this search is typically generated via logs that report registry
  modifications.
id: f5f6af30-7ba7-4295-bfe9-07de87c01bbc
known_false_positives: You will encounter noise from legitimate print-monitor registry
  entries.
name: Monitor Registry Keys for Print Monitors
references: []
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  where Registry.action=modified AND Registry.registry_path="*CurrentControlSet\\Control\\Print\\Monitors*"
  by _time span=1h Registry.dest Registry.user Registry.registry_path Registry.registry_value_name
  Registry.process_guid Registry.registry_key_name Registry.registry_value_data |
  `drop_dm_object_name(Registry)` |rename process_guid as proc_guid |join proc_guid,
  _time [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  by _time span=1h Processes.process_id Processes.process_name Processes.process Processes.dest
  Processes.parent_process_name Processes.parent_process Processes.process_guid |
  `drop_dm_object_name(Processes)` |rename process_guid as proc_guid | fields _time
  dest user parent_process_name parent_process process_name process_path process proc_guid
  registry_path registry_value_name registry_value_data registry_key_name] | table
  _time dest user parent_process_name parent_process process_name process_path process
  proc_guid registry_path registry_value_name registry_value_data registry_key_name
  | `monitor_registry_keys_for_print_monitors_filter`'
tags:
  analytic_story:
  - Suspicious Windows Registry Activities
  - Windows Persistence Techniques
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 8
  - CIS 5
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Execution
  - Stage:Persistence
  - Stage:Privilege Escalation
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1547.010/atomic_red_team/sysmon.log
  impact: 80
  kill_chain_phases:
  - Actions on Objectives
  message: New print monitor added on $dest$
  mitre_attack_id:
  - T1547.010
  - T1547
  nist:
  - PR.PT
  - DE.CM
  - PR.AC
  observable:
  - name: dest
    role:
    - Victim
    type: Endpoint
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_guid
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Registry.action
  - Endpoint.Registry.dest
  - Endpoint.Registry.process_guid
  - Endpoint.Registry.registry_key_name
  - Endpoint.Registry.registry_path
  - Endpoint.Registry.registry_value_data
  - Endpoint.Registry.registry_value_name
  - Endpoint.Registry.user
  - _time
  risk_score: 64
  security_domain: endpoint
type: TTP
version: 3
