name: MSHTML Module Load in Office Product
id: 5f1c168e-118b-11ec-84ff-acde48001122
version: 2
date: '2023-11-07'
author: Michael Haag, Mauricio Velazco, Splunk
status: production
type: TTP
description: The following detection identifies the module load of mshtml.dll into
  an Office product. This behavior has been related to CVE-2021-40444, whereas the
  malicious document will load ActiveX, which activates the MSHTML component. The
  vulnerability resides in the MSHTML component. During triage, identify parallel
  processes and capture any file modifications for analysis.
data_source:
- Sysmon Event ID 7
search: '`sysmon` EventID=7  parent_process_name IN ("winword.exe","excel.exe","powerpnt.exe","mspub.exe","visio.exe","wordpad.exe","wordview.exe","onenote.exe","onenotem.exe","onenoteviewer.exe","onenoteim.exe",
  "msaccess.exe","Graph.exe","winproj.exe") ImageLoaded IN ("*\\mshtml.dll", "*\\Microsoft.mshtml.dll","*\\IE.Interop.MSHTML.dll","*\\MshtmlDac.dll","*\\MshtmlDed.dll","*\\MshtmlDer.dll")
  | stats count min(_time) as firstTime max(_time) as lastTime by dest, process_name,
  ImageLoaded, OriginalFileName, ProcessGuid  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `mshtml_module_load_in_office_product_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process names and image loads from your endpoints. If you are using
  Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
known_false_positives: Limited false positives will be present, however, tune as necessary.
references:
- https://app.any.run/tasks/36c14029-9df8-439c-bba0-45f2643b0c70/
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-40444
- https://strontic.github.io/xcyclopedia/index-dll
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/trojanized-onenote-document-leads-to-formbook-malware/
tags:
  analytic_story:
  - Spearphishing Attachments
  - Microsoft MSHTML Remote Code Execution CVE-2021-40444
  - CVE-2023-36884 Office and Windows HTML RCE Vulnerability
  asset_type: Endpoint
  confidence: 100
  cve:
  - CVE-2021-40444
  impact: 80
  message: An instance of $process_name$ was identified on endpoint $dest$ loading mshtml.dll.
  mitre_attack_id:
  - T1566
  - T1566.001
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - ImageLoaded
  - process_name
  - OriginalFileName
  - process_id
  - dest
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1566.001/macro/windows-sysmon_mshtml.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
