name: Non Chrome Process Accessing Chrome Default Dir
id: 81263de4-160a-11ec-944f-acde48001122
version: 1
date: '2023-04-25'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: This search is to detect an anomaly event of a non-chrome process accessing
  the files in chrome user default folder. This folder contains all the sqlite database
  of the chrome browser related to users login, history, cookies and etc. Most of
  the RAT, trojan spy as well as FIN7 jssloader try to parse the those sqlite database
  to collect information on the compromised host. This SACL Event (4663) need to be
  enabled to tthe firefox profile directory to be eable to use this. Since you monitoring
  this access to the folder,  we observed noise that needs to be filter out and hence
  added sqlite db browser and explorer .exe to make this detection more stable.
data_source:
- Windows Security 4663
search: '`wineventlog_security` EventCode=4663 NOT (process_name IN ("*\\chrome.exe",
  "*\\explorer.exe", "*sql*")) Object_Name="*\\Google\\Chrome\\User Data\\Default*"
  | stats count min(_time) as firstTime max(_time) as lastTime by Object_Name Object_Type
  process_name Access_Mask Accesses process_id EventCode dest user | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `non_chrome_process_accessing_chrome_default_dir_filter`'
how_to_implement: To successfully implement this search, you must ingest Windows Security
  Event logs and track event code 4663. For 4663, enable "Audit Object Access" in
  Group Policy. Then check the two boxes listed for both "Success" and "Failure."
known_false_positives: other browser not listed related to firefox may catch by this
  rule.
references: []
tags:
  analytic_story:
  - Remcos
  - 3CX Supply Chain Attack
  - AgentTesla
  - RedLine Stealer
  - FIN7
  - Warzone RAT
  - NjRAT
  - DarkGate Malware
  asset_type: Endpoint
  confidence: 70
  impact: 50
  message: a non firefox browser process $process_name$ accessing $Object_Name$
  mitre_attack_id:
  - T1555
  - T1555.003
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Object_Name
  - Object_Type
  - process_name
  - Access_Mask
  - Accesses
  - process_id
  - EventCode
  - dest
  - user
  risk_score: 35
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/fin7/fin7_sacl/security2.log
    source: WinEventLog:Security
    sourcetype: WinEventLog
