name: Non Firefox Process Access Firefox Profile Dir
id: e6fc13b0-1609-11ec-b533-acde48001122
version: 2
date: '2024-04-26'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: This search is to detect an anomaly event of a non-firefox process accessing
  the files in the profile folder. This folder contains all the sqlite database of
  the firefox browser related to users login, history, cookies and etc. Most of the
  RAT, trojan spy as well as FIN7 jssloader try to parse the those sqlite database
  to collect information on the compromised host. This SACL Event (4663) needs to
  be enabled to the firefox profile directory to use this. Since this is monitoring
  the access to the folder, we have obsevered noise and hence added `sqlite db browser`
  and `explorer.exe` to make this detection more stable.
data_source:
- Windows Event Log Security 4663
search: '`wineventlog_security` EventCode=4663 NOT (ProcessName IN ("*\\firefox.exe",
  "*\\explorer.exe", "*sql*")) ObjectName="*\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles*"
  | stats count min(_time) as firstTime max(_time) as lastTime by ObjectName ObjectType
  ProcessName AccessMask EventCode dest | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `non_firefox_process_access_firefox_profile_dir_filter`'
how_to_implement: To successfully implement this search, you must ingest Windows Security
  Event logs and track event code 4663. For 4663, enable "Audit Object Access" in
  Group Policy. Then check the two boxes listed for both "Success" and "Failure."
known_false_positives: other browser not listed related to firefox may catch by this
  rule.
references: []
tags:
  analytic_story:
  - Azorult
  - Remcos
  - NjRAT
  - Warzone RAT
  - 3CX Supply Chain Attack
  - RedLine Stealer
  - FIN7
  - DarkGate Malware
  - AgentTesla
  - CISA AA23-347A
  - Phemedrone Stealer
  - Snake Keylogger
  asset_type: Endpoint
  confidence: 70
  impact: 50
  message: a non firefox browser process $ProcessName$ accessing $ObjectName$
  mitre_attack_id:
  - T1555
  - T1555.003
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Object_Name
  - Object_Type
  - process_name
  - Access_Mask
  - Accesses
  - process_id
  - EventCode
  - dest
  - user
  risk_score: 35
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1555/non_chrome_process_accessing_chrome_default_dir/windows-xml.log
    source: XmlWinEventLog:Security
    sourcetype: XmlWinEventLog
