name: Office Product Spawning Wmic
id: ffc236d6-a6c9-11eb-95f1-acde48001122
version: 1
date: '2021-04-26'
author: Michael Haag, Splunk
type: batch
datamodel:
- Endpoint
description: The following detection identifies the latest behavior utilized by Ursnif
  malware family. This detection identifies any Windows Office Product spawning `wmic.exe`.
  In malicious instances, the command-line of `wmic.exe` will contain `wmic process
  call create`. In addition, Threat Research has released a detection identifying
  the use of `wmic process call create` on the command-line of `wmic.exe`. In this
  instance, we narrow our detection down to the Office suite as a parent process.
  During triage, review all file modifications. Capture and analyze any artifacts
  on disk. The Office Product, or `wmic.exe` will have reached out to a remote destination,
  capture and block the IPs or domain. Review additional parallel processes for further
  activity.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name
  IN ("winword.exe","excel.exe","powerpnt.exe","mspub.exe","visio.exe") Processes.process_name=wmic.exe
  by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `office_product_spawning_wmic_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: No false positives known. Filter as needed.
references:
- https://app.any.run/tasks/fb894ab8-a966-4b72-920b-935f41756afd/
- https://attack.mitre.org/techniques/T1047/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1047/T1047.md
tags:
  analytic_story:
  - Spearphishing Attachments
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1566.001/macro/windows-sysmon_macros.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1566.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - process_name
  - process_id
  - parent_process_name
  - dest
  - user
  - parent_process_id
  security_domain: endpoint
  impact: 70 
  confidence: 90  
  # (impact * confidence)/100
  risk_score: 63 
  context:
  - source:endpoint
  - stage: recon
  message: office parent process $parent_process_name$ will execute a suspicious child process $process_name$ with process id $process_id$ in host $dest$ 
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: process_name
    role:
    - Attacker
