name: Office Product Spawning MSHTA
id: 6078fa20-a6d2-11eb-b662-acde48001122
version: 4
date: '2023-07-11'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following detection identifies the latest behavior utilized by different
  malware families (including TA551, IcedID). This detection identifies any Windows
  Office Product spawning `mshta.exe`. In malicious instances, the command-line of
  `mshta.exe` will contain the `hta` file locally, or a URL to the remote destination.
  In addition, Threat Research has released a detections identifying suspicious use
  of `mshta.exe`. In this instance, we narrow our detection down to the Office suite
  as a parent process. During triage, review all file modifications. Capture and analyze
  any artifacts on disk. The Office Product, or `mshta.exe` will have reached out
  to a remote destination, capture and block the IPs or domain. Review additional
  parallel processes for further activity.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name
  IN ("winword.exe","excel.exe","powerpnt.exe","mspub.exe","visio.exe", "onenote.exe","onenotem.exe",
  "msaccess.exe","Graph.exe","winproj.exe") `process_mshta` by Processes.dest Processes.user Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.original_file_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `office_product_spawning_mshta_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: No false positives known. Filter as needed.
references:
- https://redcanary.com/threat-detection-report/threats/TA551/
tags:
  analytic_story:
  - Spearphishing Attachments
  - IcedID
  - Azorult
  - CVE-2023-36884 Office and Windows HTML RCE Vulnerability
  - NjRAT
  asset_type: Endpoint
  confidence: 90
  impact: 70
  message: office parent process $parent_process_name$ will execute a suspicious child
    process $process_name$ with process id $process_id$ in host $dest$
  mitre_attack_id:
  - T1566
  - T1566.001
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 63
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1566.001/macro/windows-sysmon_macros.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
