name: Office Product Spawn CMD Process
id: b8b19420-e892-11eb-9244-acde48001122
version: 5
date: '2023-07-11'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: this search is to detect a suspicious office product process that spawn
  cmd child process. This is commonly seen in a ms office product having macro to
  execute shell command to download or execute malicious lolbin relative to its malicious
  code. This is seen in trickbot spear phishing doc where it execute shell cmd to
  run mshta payload.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.parent_process_name
  = "winword.exe" OR Processes.parent_process_name= "excel.exe" OR Processes.parent_process_name
  = "powerpnt.exe" OR Processes.parent_process_name= "onenote.exe" OR Processes.parent_process_name
  = "onenotem.exe" OR Processes.parent_process_name = "onenoteviewer.exe" OR Processes.parent_process_name
  = "onenoteim.exe" OR Processes.parent_process_name = "msaccess.exe" OR  Processes.parent_process_name="Graph.exe"
  OR Processes.parent_process_name="winproj.exe") `process_cmd` by  Processes.parent_process_name Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.process_guid
  Processes.user Processes.dest Processes.original_file_name | `drop_dm_object_name("Processes")`
  | `security_content_ctime(firstTime)` |`security_content_ctime(lastTime)` | `office_product_spawn_cmd_process_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: IT or network admin may create an document automation that
  will run shell script.
references:
- https://twitter.com/cyb3rops/status/1416050325870587910?s=21
- https://bazaar.abuse.ch/sample/02cbc1ab80695fc12ff8822b926957c3a600247b9ca412a137f69cb5716c8781/
- https://www.fortinet.com/blog/threat-research/latest-remcos-rat-phishing
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/trojanized-onenote-document-leads-to-formbook-malware/
tags:
  analytic_story:
  - Trickbot
  - DarkCrystal RAT
  - Azorult
  - Remcos
  - Qakbot
  - AgentTesla
  - CVE-2023-21716 Word RTF Heap Corruption
  - CVE-2023-36884 Office and Windows HTML RCE Vulnerability
  - Warzone RAT
  - PlugX
  - NjRAT
  asset_type: Endpoint
  confidence: 80
  impact: 70
  message: an office product parent process $parent_process_name$ spawn child process
    $process_name$ in host $dest$
  mitre_attack_id:
  - T1566
  - T1566.001
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 56
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/trickbot/spear_phish/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
