name: Office Product Spawn CMD Process
id: b8b19420-e892-11eb-9244-acde48001122
version: 1
date: '2021-07-19'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: this search is to detect a suspicious office product process that spawn cmd child process.
  This is commonly seen in a ms office product having macro to execute shell command to download or execute malicious lolbin 
  relative to its malicious code. This is seen in trickbot spear phishing doc where it execute shell cmd to run mshta payload.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where (Processes.parent_process_name = "winword.exe" OR Processes.parent_process_name= "excel.exe" OR Processes.parent_process_name = "powerpnt.exe") 
  Processes.process_name=cmd.exe by Processes.parent_process Processes.process_name Processes.process Processes.process_id Processes.process_guid
  Processes.user Processes.dest 
  | `drop_dm_object_name("Processes")` 
  | `security_content_ctime(firstTime)`
  |`security_content_ctime(lastTime)` 
  | `office_product_spawn_cmd_process_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. 
known_false_positives: IT or network admin may create an document automation that will run shell script.
references:
- https://twitter.com/cyb3rops/status/1416050325870587910?s=21
tags:
  analytic_story:
  - Trickbot
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/trickbot/spear_phish/windows-sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1218.005
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - parent_process 
  - process_name 
  - process 
  - process_id 
  - process_guid
  security_domain: endpoint
  impact: 70
  confidence: 80
  # (impact * confidence)/100
  risk_score: 56
  context: 
  - source:endpoint
  - stage: executions
  message: an office product parent process $parent_process_name$ spawn child process $process_name$ in host $dest$
  observable:
    - name: dest
      type: Hostname
      role:
      - Victim
    - name: user
      type: user
      role:
      - Victim 
  