name: Office Product Writing cab or inf
id: f48cd1d4-125a-11ec-a447-acde48001122
version: 4
date: '2023-02-15'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic identifies behavior related to CVE-2021-40444.
  Whereas the malicious document will load ActiveX and download the remote payload
  (.inf, .cab). During triage, review parallel processes and further activity on endpoint
  to identify additional patterns. Retrieve the file modifications and analyze further.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where Processes.process_name IN ("winword.exe","excel.exe","powerpnt.exe","mspub.exe","visio.exe","wordpad.exe","wordview.exe","onenote.exe","onenotem.exe","onenoteviewer.exe","onenoteim.exe","msaccess.exe")
  by _time span=1h Processes.process_id Processes.process_name Processes.process Processes.dest
  Processes.process_guid | `drop_dm_object_name(Processes)` |rename process_guid as
  proc_guid | join proc_guid, _time [ | tstats `security_content_summariesonly` count
  min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem
  where Filesystem.file_name IN ("*.inf","*.cab") by _time span=1h Filesystem.dest
  Filesystem.file_create_time Filesystem.file_name Filesystem.file_path Filesystem.process_guid
  | `drop_dm_object_name(Filesystem)` |rename process_guid as proc_guid | fields _time
  dest file_create_time file_name file_path process_name process_path process proc_guid]
  | dedup file_create_time | table dest, process_name, process, file_create_time,
  file_name, file_path, proc_guid | `office_product_writing_cab_or_inf_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node and `Filesystem`
  node.
known_false_positives: The query is structured in a way that `action` (read, create)
  is not defined. Review the results of this query, filter, and tune as necessary.
  It may be necessary to generate this query specific to your endpoint product.
references:
- https://twitter.com/vxunderground/status/1436326057179860992?s=20
- https://app.any.run/tasks/36c14029-9df8-439c-bba0-45f2643b0c70/
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-40444
- https://twitter.com/RonnyTNL/status/1436334640617373699?s=20
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/trojanized-onenote-document-leads-to-formbook-malware/
tags:
  analytic_story:
  - Spearphishing Attachments
  - Microsoft MSHTML Remote Code Execution CVE-2021-40444
  asset_type: Endpoint
  confidence: 100
  cve:
  - CVE-2021-40444
  impact: 80
  message: An instance of $process_name$ was identified on $dest$ writing an inf or
    cab file to this. This is not typical of $process_name$.
  mitre_attack_id:
  - T1566
  - T1566.001
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - dest
  - process_name
  - process
  - file_create_time
  - file_name
  - file_path
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1566.001/macro/windows-sysmon_cabinf.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
