name: Office Product Spawning Rundll32 with no DLL
id: c661f6be-a38c-11eb-be57-acde48001122
version: 1
date: '2021-04-22'
author: Michael Haag, Splunk
type: batch
datamodel:
- Endpoint
description: The following detection identifies the latest behavior utilized by IcedID
  malware family. This detection identifies any Windows Office Product spawning `rundll32.exe`
  without a `.dll` file extension. In malicious instances, the command-line of `rundll32.exe`
  will look like `rundll32 ..\oepddl.igk2,DllRegisterServer`. In addition, Threat
  Research has released a detection identifying the use of `DllRegisterServer` on
  the command-line of `rundll32.exe`. In this instance, we narrow our detection down
  to the Office suite as a parent process. During triage, review all file modifications.
  Capture and analyze the `DLL` that was dropped to disk. The Office Product will
  have reached out to a remote destination, capture and block the IPs or domain. Review
  additional parallel processes for further activity.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name
  IN ("winword.exe","excel.exe","powerpnt.exe","mspub.exe","visio.exe") Processes.process_name=rundll32.exe
  (Processes.process!=*.dll*) by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `office_product_spawning_rundll32_with_no_dll_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: False positives should be limited, but if any are present,
  filter as needed.
references:
- https://www.joesandbox.com/analysis/395471/0/html
- https://app.any.run/tasks/cef4b8ba-023c-4b3b-b2ef-6486a44f6ed9/
- https://any.run/malware-trends/icedid
tags:
  analytic_story:
  - Spearphishing Attachments
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1566.001/macro/windows-sysmon_icedid.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1566.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - process_name
  - process_id
  - parent_process_name
  - dest
  - user
  - parent_process_id
  security_domain: endpoint
  impact: 70 
  confidence: 90  
  # (impact * confidence)/100
  risk_score: 63 
  context:
  - source:endpoint
  - stage: recon
  message: office parent process $parent_process_name$ will execute a suspicious child process $process_name$ with process id $process_id$ and no dll commandline $process$ in host $dest$ 
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: process name 
    role:
    - Attacker
