name: Outbound Network Connection from Java Using Default Ports
id: d2c14d28-5c47-11ec-9892-acde48001122
version: 1
date: '2021-12-13'
author: Mauricio Velazco, Splunk
type: TTP
datamodel: []
description: A required step while exploiting the CVE-2021-44228-Log4j vulnerability
  is that the victim server will perform outbound connections to attacker-controlled
  infrastructure. This is required as part of the JNDI lookup as well as for retrieving
  the second stage .class payload. The following analytic identifies the Java process
  reaching out to default ports used by the LDAP and RMI protocols. This behavior
  could represent successfull exploitation. Note that adversaries can easily decide
  to use arbitrary ports for these protocols and potentially bypass this detection.
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where (Processes.process_name="java.exe" OR Processes.process_name=javaw.exe OR
  Processes.process_name=javaw.exe) by _time Processes.process_guid Processes.process_name
  Processes.dest Processes.process_path Processes.process Processes.parent_process_name
  |  `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | join  process_guid [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Ports
  where (Ports.dest_port= 389 OR Ports.dest_port= 636 OR Ports.dest_port = 1389 OR
  Ports.dest_port = 1099 ) by Ports.process_guid Ports.dest Ports.dest_port| `drop_dm_object_name(Ports)`
  |  rename  dest as connection_to_CNC] | table _time dest parent_process_name process_name
  process_path process connection_to_CNC dest_port | `outbound_network_connection_from_java_using_default_ports_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Legitimate Java applications may use perform outbound connections
  to these ports. Filter as needed
references:
- https://www.lunasec.io/docs/blog/log4j-zero-day/
- https://www.govcert.admin.ch/blog/zero-day-exploit-targeting-popular-java-library-log4j/
tags:
  analytic_story:
  - Log4Shell CVE-2021-44228
  confidence: 60
  context:
  - Source:Endpoint
  - Stage:Execution
  cve:
  - CVE-2021-44228
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1190/outbound_java/windows-sysmon.log
  impact: 90
  kill_chain_phases:
  - Exploitation
  message: Java performed outbound connections to default ports of LDAP or RMI on
    $dest$
  mitre_attack_id:
  - T1190
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_guid
  - Processes.process_name
  - Processes.dest
  - Processes.process_path
  - Processes.process
  - Processes.parent_process_name
  - Ports.process_guid
  - Ports.dest
  - Ports.dest_port
  risk_score: 54
  security_domain: endpoint
  asset_type: Endpoint
