name: Outbound Network Connection from Java Using Default Ports
id: d2c14d28-5c47-11ec-9892-acde48001122
version: 2
date: '2022-06-28'
author: Mauricio Velazco, Lou Stella, Splunk
status: production
type: TTP
description: A required step while exploiting the CVE-2021-44228-Log4j vulnerability
  is that the victim server will perform outbound connections to attacker-controlled
  infrastructure. This is required as part of the JNDI lookup as well as for retrieving
  the second stage .class payload. The following analytic identifies the Java process
  reaching out to default ports used by the LDAP and RMI protocols. This behavior
  could represent successfull exploitation. Note that adversaries can easily decide
  to use arbitrary ports for these protocols and potentially bypass this detection.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where (Processes.process_name="java.exe" OR Processes.process_name=javaw.exe OR
  Processes.process_name=javaw.exe) by _time Processes.process_id Processes.process_name
  Processes.dest Processes.process_path Processes.process Processes.parent_process_name
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | join process_id [| tstats `security_content_summariesonly` count FROM datamodel=Network_Traffic.All_Traffic
  where (All_Traffic.dest_port= 389 OR All_Traffic.dest_port= 636 OR All_Traffic.dest_port
  = 1389 OR All_Traffic.dest_port = 1099 ) by All_Traffic.process_id All_Traffic.dest
  All_Traffic.dest_port | `drop_dm_object_name(All_Traffic)` | rename dest as connection_to_CNC]
  | table _time dest parent_process_name process_name process_path process connection_to_CNC
  dest_port| `outbound_network_connection_from_java_using_default_ports_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Legitimate Java applications may use perform outbound connections
  to these ports. Filter as needed
references:
- https://www.lunasec.io/docs/blog/log4j-zero-day/
- https://www.govcert.admin.ch/blog/zero-day-exploit-targeting-popular-java-library-log4j/
tags:
  analytic_story:
  - Log4Shell CVE-2021-44228
  asset_type: Endpoint
  confidence: 60
  cve:
  - CVE-2021-44228
  impact: 90
  message: Java performed outbound connections to default ports of LDAP or RMI on
    $dest$
  mitre_attack_id:
  - T1190
  - T1133
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_id
  - Processes.process_name
  - Processes.dest
  - Processes.process_path
  - Processes.process
  - Processes.parent_process_name
  - All_Traffic.process_id
  - All_Traffic.dest
  - All_Traffic.dest_port
  risk_score: 54
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1190/outbound_java/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
