name: Password Policy Discovery with Net
id: 09336538-065a-11ec-8665-acde48001122
version: 1
date: '2021-08-26'
author: Teoderick Contreras, Splunk
type: Hunting
datamodel:
- Endpoint
description: This search is to detect a net application command to discover password policy. 
  This commandline can be used by IT and admin to list all account domain policy but also can be use by attacker as part of recon. 
  this hunting query can be a good pivot to locate credential dumping or lateral movement as part of post attack.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where (Processes.process_name="net.exe" OR Processes.process_name="net1.exe") AND Processes.process = "*accounts*" AND Processes.process = "*/domain*"
  by Processes.dest Processes.user Processes.parent_process Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  Processes.parent_process_name | `drop_dm_object_name(Processes)` 
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` 
  | `password_policy_discovery_with_net_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. Tune and filter known instances where renamed rundll32.exe may be used.
known_false_positives: network operator or admin may use this command
references:
- https://github.com/S1ckB0y1337/Active-Directory-Exploitation-Cheat-Sheet
tags:
  analytic_story:
  - Active Directory Discovery
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1201/pwd_policy_discovery/windows-sysmon.log
  kill_chain_phases:
  - Reconnaissance
  mitre_attack_id:
  - T1201
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest 
  - Processes.user 
  - Processes.parent_process 
  - Processes.process_name 
  - Processes.process 
  - Processes.process_id 
  - Processes.parent_process_id
  - Processes.parent_process_name
  security_domain: endpoint
  impact: 30
  confidence: 30 
  # (impact * confidence)/100
  risk_score: 9
  context:
  - Source:Endpoint
  - Stage:Reconnaissance
  message: an instance of process $process_name$ with commandline $process$ in $dest$
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Parent Process
    role:
    - Parent Process
  