name: PetitPotam Network Share Access Request
id: 95b8061a-0a67-11ec-85ec-acde48001122
version: 2
date: '2024-04-26'
author: Michael Haag, Mauricio Velazco, Splunk
status: production
type: TTP
description: 'The following analytic utilizes Windows Event Code 5145, "A network
  share object was checked to see whether client can be granted desired access". During
  our research into PetitPotam, CVE-2021-36942, we identified the ocurrence of this
  event on the target host with specific values. 

  To enable 5145 events via Group Policy - Computer Configuration->Polices->Windows
  Settings->Security Settings->Advanced Audit Policy Configuration. Expand this node,
  go to Object Access (Audit Polices->Object Access), then select the Setting Audit
  Detailed File Share Audit 

  It is possible this is not enabled by default and may need to be reviewed and enabled.
  

  During triage, review parallel security events to identify further suspicious activity.'
data_source:
- Sysmon Event ID 5
search: '`wineventlog_security` SubjectUserName="ANONYMOUS LOGON" EventCode=5145 RelativeTargetName=lsarpc
  | stats count min(_time) as firstTime max(_time) as lastTime by dest, SubjectUserSid,
  ShareName, src, AccessMask, AccessReason | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `petitpotam_network_share_access_request_filter`'
how_to_implement: Windows Event Code 5145 is required to utilize this analytic and
  it may not be enabled in most environments.
known_false_positives: False positives have been limited when the Anonymous Logon
  is used for Account Name.
references:
- https://attack.mitre.org/techniques/T1187/
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=5145
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5145
tags:
  analytic_story:
  - PetitPotam NTLM Relay on Active Directory Certificate Services
  asset_type: Endpoint
  confidence: 70
  cve:
  - CVE-2021-36942
  impact: 80
  message: A remote host is enumerating a $dest$ to identify permissions. This is
    a precursor event to CVE-2021-36942, PetitPotam.
  mitre_attack_id:
  - T1187
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - dest
  - SubjectUserSid
  - Share_Name
  - src
  - AccessMask
  - AccessReason
  risk_score: 56
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1187/petitpotam/windows-xml.log
    source: XmlWinEventLog:Security
    sourcetype: XmlWinEventLog
