name: Plink Remote Forwarding
id: 773e26e4-461a-11ec-a9be-acde48001122
version: 1
date: '2021-11-15'
author: Michael Haag, Splunk
type: TTP
datamodel:
- Endpoint
description: The following analytic identifies the use of `plink` being utilized as a way to tunnel protocols outbound. Adversaries utilize this application to reverse proxy ssh and RDP outbound to a remote destination.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name=plink.exe OR Processes.original_file_name="plink") Processes.process IN ("*-D *", "*-L *", "*-R *") OR Processes.process IN ("*-l *","*-pw *") OR Processes.process IN ("*-ssh*", "*-telnet*", "*-rlogin*" "*-raw*", "*-serial*") OR Processes.process IN ("*-T *","*-N *") by Processes.dest Processes.user Processes.parent_process_name Processes.process_name Processes.original_file_name
  Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` 
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `plink_remote_forwarding_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information on process that include the name of the process responsible for the changes from your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition, confirm the latest CIM App 4.20 or higher is installed and the latest TA for the endpoint product.
known_false_positives: False positives should be limited, however filter as needed.
references:
  - https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/
  - https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html
  - https://documentation.help/PuTTY/plink-usage.html
tags:
  analytic_story:
  - Command and Control
  - Data Exfiltration
  dataset: []
  kill_chain_phases:
  - Exploitation
  - Exfiltration
  mitre_attack_id:
  - T1572
  - T1090
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name #parent process name
  - Processes.parent_process #parent cmdline
  - Processes.original_file_name
  - Processes.process_name #process name
  - Processes.process #process cmdline
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  security_domain: endpoint
  impact: 80
  confidence: 100
  # (impact * confidence)/100
  risk_score: 80
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  message: An instance of $parent_process_name$ spawning $process_name$ was identified on endpoint $dest$ by user $user$ attempting to tunnel network communication.
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Parent Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process