name: Potentially malicious code on commandline
id: 9c53c446-757e-11ec-871d-acde48001122
version: 1
date: '2022-01-14'
author: Michael Hart, Splunk
type: Anomaly
datamodel:
- Endpoint
description: Uses machine learning to detect potentially malicious command lines
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel="Endpoint.Processes" by Processes.parent_process_name Processes.process_name Processes.process Processes.user Processes.dest  | `drop_dm_object_name(Processes)`  | `potentially_malicious_code_on_cmdline_tokenize_score` | where score > 2.5 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `potentially_malicious_code_on_commandline_filter`'
how_to_implement: Need endpoint model
known_false_positives: This model can output false positives
references: []
tags:
  analytic_story:
  - Suspicious Command-Line Executions
  dataset:
  - https://github.com/splunk/attack_data/blob/master/datasets/attack_techniques/T1059.001/malicious_cmd_line_samples/windows-sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1059.001
  - T1059.003
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  security_domain: endpoint
  impact: 60
  confidence: 20
  risk_score: 12
  context:
    - source:endpoint
    - stage:Execution
  message: Unusual commandline execution with hallmarks of malicious activity found on $dest$ with commandline $process$
  observable:
    - name: ComputerName
      type: Hostname
      role:
        - Victim
    - name: User
      type: User
      role:
        - Victim