name: Powershell Execute COM Object
id: 65711630-f9bf-11eb-8d72-acde48001122
version: 1
date: '2021-08-10'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This search is to detect a COM CLSID execution through powershell. This
  technique was seen in several adversaries and malware like ransomware conti where
  it has a feature to execute command using COM Object. This technique may use by
  network operator at some cases but a good indicator if some application want to
  gain privilege escalation or bypass uac.
search: '`powershell` EventCode=4104 Message = "*CreateInstance([type]::GetTypeFromCLSID*"
  OR Message = "*CreateInstance([Type]::GetTypeFromProgID*"| stats count min(_time)
  as firstTime max(_time) as lastTime by EventCode Message ComputerName User | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `powershell_execute_com_object_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: network operrator may use this command.
references:
- https://threadreaderapp.com/thread/1423361119926816776.html
tags:
  analytic_story:
  - Malicious PowerShell
  - Ransomware
  automated_detection_testing: passed
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/conti/conti_leak/windows-powershell.log
  impact: 10
  kill_chain_phases:
  - Exploitation
  message: A suspicious powershell script contains COM CLSID command in $Message$
    with EventCode $EventCode$ in host $ComputerName$
  mitre_attack_id:
  - T1546.015
  - T1546
  observable:
  - name: ComputerName
    type: Hostname
    role:
    - Victim
  - name: User
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  risk_score: 5
  security_domain: endpoint
  cim_version: 5.0.0
  tas_with_cim_mapping:
  - Splunk_TA_microsoft-cloudservices
  - Splunk_TA_cisco-ucs
  - Splunk_TA_citrix-netscaler
  - Splunk_TA_nix
  - Splunk_TA_nginx
  - Splunk_TA_microsoft-iis
  - Splunk_TA_microsoft-sqlserver
  - Splunk_TA_rsa-securid
  - Splunk_TA_remedy
  - Splunk_TA_bluecoat-proxysg
  - Splunk_TA_aws-kinesis-firehose
  - Splunk_TA_rsa_securid_cas
  - Splunk_TA_jboss
  - Splunk_TA_websense-cg
  - Splunk_TA_ossec
  - Splunk_TA_bromium
  - Splunk_TA_nagios-core
  - Splunk_TA_isc-bind
  - Splunk_TA_bit9-carbonblack
  - Splunk_TA_snow
  - Splunk_TA_squid
  - Splunk_TA_apache
  - Splunk_TA_imperva-waf
  - Splunk_TA_juniper
  - Splunk_TA_cisco-esa
  - Splunk_TA_microsoft_sysmon
  - Splunk_TA_cisco-ise
  - splunk_ta_o365
  - Splunk_TA_f5-bigip
  - Splunk_TA_symantec-ep
  - Splunk_TA_google-cloudplatform
  - Splunk_TA_sophos
  - Splunk_TA_mcafee_epo_syslog
  - Splunk_TA_haproxy
  - Splunk_TA_tomcat
  - Splunk_TA_jmx
  - Splunk_TA_cyberark
  - Splunk_TA_symantec-dlp
  - Splunk_TA_ibm-was
  - Splunk_TA_microsoft-hyperv
  - Splunk_TA_windows
  - Splunk_TA_stream_wire_data
  - Splunk_TA_mcafee-wg
  - Splunk_TA_isc-dhcp
  - Splunk_TA_websense-dlp
  - Splunk_TA_box
  - Splunk_TA_microsoft-scom
  - Splunk_TA_CrowdStrike_FDR
  - Splunk_TA_rsa-dlp
  - Splunk_TA_cisco-wsa
  - Splunk_TA_mysql
  - Splunk_TA_cisco-asa
  - Splunk_TA_infoblox
  - Splunk_TA_salesforce
  - Splunk_TA_cyberark_epm
  - Splunk_TA_linux
  - Splunk_TA_oracle
  supported_tas:
  - Splunk_TA_windows
