author: Teoderick Contreras, Splunk
datamodel: []
date: '2022-01-18'
description: This analytic will identify a suspicious PowerShell command used to delete
  the Windows Defender folder. This technique was seen used by the WhisperGate malware
  campaign where it used Nirsofts advancedrun.exe to gain administrative privileges
  to then execute a PowerShell command to delete the Windows Defender folder. This
  is a good indicator the offending process is trying corrupt a Windows Defender installation.
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
id: adf47620-79fa-11ec-b248-acde48001122
known_false_positives: unknown
name: Powershell Remove Windows Defender Directory
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
search: '`powershell` EventCode=4104 Message = "*rmdir *" AND Message = "*\\Microsoft\\Windows
  Defender*" | stats count min(_time) as firstTime max(_time) as lastTime by EventCode
  Message ComputerName User | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `powershell_remove_windows_defender_directory_filter` '
tags:
  analytic_story:
  - WhisperGate
  automated_detection_testing: passed
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.001/rmdir_defender_pwsh/powershell.log
  impact: 100
  kill_chain_phases:
  - Exploitation
  message: suspicious powershell script $Message$ was executed on the $ComputerName$
  mitre_attack_id:
  - T1562.001
  - T1562
  nist:
  - DE.CM
  observable:
  - name: ComputerName
    role:
    - Victim
    type: Hostname
  - name: User
    role:
    - Victim
    type: User
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - Message
  - ComputerName
  - User
  risk_score: 90
  security_domain: endpoint
type: TTP
version: 2
