name: Powershell Remove Windows Defender Directory
id: adf47620-79fa-11ec-b248-acde48001122
version: 3
date: '2023-04-14'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: This analytic will identify a suspicious PowerShell command used to delete
  the Windows Defender folder. This technique was seen used by the WhisperGate malware
  campaign where it used Nirsofts advancedrun.exe to gain administrative privileges
  to then execute a PowerShell command to delete the Windows Defender folder. This
  is a good indicator the offending process is trying corrupt a Windows Defender installation.
data_source:
- Powershell 4104
search: '`powershell` EventCode=4104 ScriptBlockText = "*rmdir *" AND ScriptBlockText
  = "*\\Microsoft\\Windows Defender*" | stats count min(_time) as firstTime max(_time)
  as lastTime by Opcode Computer UserID EventCode ScriptBlockText | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `powershell_remove_windows_defender_directory_filter` '
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: unknown
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
  analytic_story:
  - Data Destruction
  - WhisperGate
  asset_type: Endpoint
  confidence: 90
  impact: 100
  message: suspicious powershell script $ScriptBlockText$ was executed on the $Computer$
  mitre_attack_id:
  - T1562.001
  - T1562
  observable:
  - name: Computer
    type: Hostname
    role:
    - Victim
  - name: UserID
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - ScriptBlockText
  - Opcode
  - Computer
  - UserID
  - EventCode
  risk_score: 90
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.001/powershell_script_block_logging/sbl_xml.log
    source: XmlWinEventLog:Microsoft-Windows-PowerShell/Operational
    sourcetype: xmlwineventlog
