name: Powershell Disable Security Monitoring
id: d08ca0be-db70-11eb-88b0-acde48001122
version: 1
date: '2021-07-02'
author: Michael Haag, Splunk
type: batch
datamodel:
- Endpoint
description: |
	The following analytic identifies PowerShell disabling Defender security features. The following methods will 
	WHAT IS THIS?
	WHAT DOES IT LOOK LIKE?
	HOW DO YOU TRIAGE IT?
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name IN ("powershell.exe", "pwsh.exe", "sqlps.exe", "sqltoolsps.exe")
  Processes.process="*set-mppreference*" AND Processes.process IN ("*disablerealtimemonitoring*","*disableioavprotection*","*disableintrusionpreventionsystem*","*disablescriptscanning*","*disableblockatfirstseen*") by Processes.dest
  Processes.user Processes.parent_process Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` 
  | `powershell_disable_security_monitoring_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Limited false positives. However, tune based on scripts that may perform this action.
references:
  - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md#atomic-test-15---tamper-with-windows-defender-atp-powershell
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  dataset: []
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1003.002
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  security_domain: endpoint
  impact: 
  confidence: 
  # (impact * confidence)/100
  risk_score: 
  context:
  message: 
  observable: