name: Powershell Remove Windows Defender Directory
id: adf47620-79fa-11ec-b248-acde48001122
version: 1
date: '2022-01-20'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This analytic is to detect a suspicious powershell command to delete
  Windows Defender folder. This technique was seen in whispergate operation where
  it uses advancedrun.exe nirsoft too gain admin privilege to execute this powershell
  command to delete or evade windows defender application. This is a good indicator
  that some suspicious behavior is happening on the system.
search: '`powershell` EventCode=4104 Message = "* rmdir *" OR Message = "*\\Microsoft\\Windows
  Defender*" | stats count min(_time) as firstTime max(_time) as lastTime by EventCode
  Message ComputerName User | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `powershell_remove_windows_defender_directory_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: unknown
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
  analytic_story:
  - WhisperGate
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.001/rmdir_defender_pwsh/powershell.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1562.001
  - T1562
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - Message
  - ComputerName
  - User
  security_domain: endpoint
  impact: 100
  confidence: 90
  risk_score: 90
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  message: suspicious powershell script $Message$ was executed on the $ComputerName$
  observable:
  - name: ComputerName
    type: Hostname
    role:
    - Victim
  - name: User
    type: User
    role:
    - Victim
  nist:
  - DE.CM
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  automated_detection_testing: passed
