name: PowerShell - Connect To Internet With Hidden Window
id: ee18ed37-0802-4268-9435-b3b91aaa18db
version: 8
date: '2023-04-14'
author: David Dorsey, Michael Haag Splunk
status: production
type: Hunting
description: The following hunting analytic identifies PowerShell commands utilizing
  the WindowStyle parameter to hide the window on the compromised endpoint. This combination
  of command-line options is suspicious because it is overriding the default PowerShell
  execution policy, attempts to hide its activity from the user, and connects to the
  Internet. Removed in this version of the query is New-Object. The analytic identifies
  all variations of WindowStyle, as PowerShell allows the ability to shorten the parameter.
  For example w, win, windowsty and so forth. In addition, through our research it
  was identified that PowerShell will interpret different command switch types beyond
  the hyphen. We have added endash, emdash, horizontal bar, and forward slash.
data_source:
- Sysmon Event ID 1
search: "| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)\
  \ as lastTime from datamodel=Endpoint.Processes where `process_powershell` by Processes.user\
  \ Processes.process_name Processes.process Processes.parent_process_name Processes.original_file_name\
  \ Processes.dest Processes.process_id | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`\
  \ | `security_content_ctime(lastTime)` | where match(process,\"(?i)[\\-|\\/|\u2013\
  |\u2014|\u2015]w(in*d*o*w*s*t*y*l*e*)*\\s+[^-]\") | `powershell___connect_to_internet_with_hidden_window_filter`"
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Legitimate process can have this combination of command-line
  options, but it's not common.
references:
- https://regexr.com/663rr
- https://github.com/redcanaryco/AtomicTestHarnesses/blob/master/TestHarnesses/T1059.001_PowerShell/OutPowerShellCommandLineParameter.ps1
- https://ss64.com/ps/powershell.html
- https://twitter.com/M_haggis/status/1440758396534214658?s=20
- https://blog.netlab.360.com/ten-families-of-malicious-samples-are-spreading-using-the-log4j2-vulnerability-now/
tags:
  analytic_story:
  - AgentTesla
  - HAFNIUM Group
  - Hermetic Wiper
  - Possible Backdoor Activity Associated With MUDCARP Espionage Campaigns
  - Malicious PowerShell
  - Data Destruction
  - Log4Shell CVE-2021-44228
  asset_type: Endpoint
  confidence: 90
  cve:
  - CVE-2021-44228
  impact: 90
  message: PowerShell processes $process$ started with parameters to modify the execution
    policy of the run, run in a hidden window, and connect to the Internet on host
    $dest$ executed by user $user$.
  mitre_attack_id:
  - T1059.001
  - T1059
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  - name: process
    type: Process
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.process_name
  - Processes.user
  - Processes.parent_process_name
  - Processes.dest
  risk_score: 81
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.001/hidden_powershell/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
