name: Powershell Reflective Load
id: 8aa0d0a2-24f4-11ec-b77a-acde48001122
version: 1
date: '2021-10-04'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This analytic is to detect a suspicious powershell loading a dll or executable
  using reflective load function. this technique is commonly seen in file less malware
  where it download a file and directly load the downloaded file that are place in
  a stream memory to execute it. this TTP is a good indicator to check the powershell
  that execute and what file or stream it execute.
search: '`powershell` EventCode=4104 Message = "*[Reflection.Assembly]::Load*" | stats
  count min(_time) as firstTime max(_time) as lastTime by EventCode Message ComputerName
  User | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `powershell_reflective_load_filter`'
how_to_implement: o successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: third party powershell may use this function to execute binary.
references:
- https://app.any.run/tasks/dc93ee63-050c-4ff8-b07e-8277af9ab939/#
tags:
  analytic_story:
  - Malicious PowerShell
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1127.001/regsvr32_silent/powershell.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1059.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - Message
  - ComputerName
  - User
  security_domain: endpoint
  impact: 70
  confidence: 70
  risk_score: 49
  context:
  - source:endpoint
  - stage: Defense Evasion
  message: a powershell that execute binary using reflective load in command $Message$
    in $ComputerName$
  observable:
  - name: ComputerName
    type: Hostname
    role:
    - Victim
  - name: User
    type: User
    role:
    - Victim
  automated_detection_testing: passed
