name: Powershell Using memory As Backing Store
id: c396a0c4-c9f2-11eb-b4f5-acde48001122
version: 1
date: '2021-06-10'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: this search is to detect suspicious powershell script that using memory
  stream as new object backstore. This technique is commonly seen in malicious powershell
  contain a stream flate data and will be decompressed in memory to run or drop the
  actual payload to the compromise machine.
search: '`powershell` EventCode=4104 Message = "*New-Object IO.MemoryStream*"
  | stats count min(_time) as firstTime max(_time) as lastTime by EventCode Message ComputerName User 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | `powershell_using_memory_as_backing_store_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the powershell logs  from your endpoints. make sure you enable needed
  registry to monitor this event.
known_false_positives: powershell may used this function to store out object into
  memory.
references:
- https://www.carbonblack.com/blog/decoding-malicious-powershell-streams/
tags:
  analytic_story:
  - Malicious PowerShell
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1140
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - Message
  - ComputerName
  - User
  security_domain: endpoint
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/honeypots/pwsh/windows-powershell.log
