name: PowerShell - Connect To Internet With Hidden Window
id: ee18ed37-0802-4268-9435-b3b91aaa18db
version: 8
date: '2022-01-12'
author: David Dorsey, Michael Haag Splunk
type: Hunting
datamodel:
- Endpoint
description: The following hunting analytic identifies PowerShell commands utilizing
  the WindowStyle parameter to hide the window on the compromised endpoint. This combination
  of command-line options is suspicious because it is overriding the default PowerShell
  execution policy, attempts to hide its activity from the user, and connects to the
  Internet. Removed in this version of the query is New-Object. The analytic identifies
  all variations of WindowStyle, as PowerShell allows the ability to shorten the parameter.
  For example w, win, windowsty and so forth. In addition, through our research it
  was identified that PowerShell will interpret different command switch types beyond
  the hyphen. We have added endash, emdash, horizontal bar, and forward slash.
search: "| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)\
  \ as lastTime from datamodel=Endpoint.Processes where `process_powershell` by Processes.user\
  \ Processes.process_name Processes.process Processes.parent_process_name Processes.original_file_name\
  \ Processes.dest Processes.process_id | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`\
  \ | `security_content_ctime(lastTime)` | where match(process,\"(?i)[\\-|\\/|\u2013\
  |\u2014|\u2015]w(in*d*o*w*s*t*y*l*e*)*\\s+[^-]\") | `powershell___connect_to_internet_with_hidden_window_filter`"
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
known_false_positives: Legitimate process can have this combination of command-line
  options, but it's not common.
references:
- https://regexr.com/663rr
- https://github.com/redcanaryco/AtomicTestHarnesses/blob/master/TestHarnesses/T1059.001_PowerShell/OutPowerShellCommandLineParameter.ps1
- https://ss64.com/ps/powershell.html
- https://twitter.com/M_haggis/status/1440758396534214658?s=20
- https://blog.netlab.360.com/ten-families-of-malicious-samples-are-spreading-using-the-log4j2-vulnerability-now/
tags:
  analytic_story:
  - Malicious PowerShell
  - Possible Backdoor Activity Associated With MUDCARP Espionage Campaigns
  - HAFNIUM Group
  - Log4Shell CVE-2021-44228
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 7
  - CIS 8
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Execution
  - Stage:Command And Control
  cve:
  - CVE-2021-44228
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.001/hidden_powershell/windows-sysmon.log
  impact: 90
  kill_chain_phases:
  - Command & Control
  - Actions on Objectives
  message: PowerShell processes $process$ started with parameters to modify the execution
    policy of the run, run in a hidden window, and connect to the Internet on host
    $dest$ executed by user $user$.
  mitre_attack_id:
  - T1059.001
  - T1059
  nist:
  - PR.PT
  - DE.CM
  - PR.IP
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  - name: process
    type: Process
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.process_name
  - Processes.user
  - Processes.parent_process_name
  - Processes.dest
  risk_score: 81
  security_domain: endpoint
