name: Previously seen command line arguments
id: 56059acf-50fe-4f60-98d1-b75b51b5c2f3
version: 3
date: '2019-03-01'
author: Bhavin Patel, Splunk
type: Baseline
datamodel:
- Endpoint
description: This search looks for command-line arguments where `cmd.exe /c` is used
  to execute a program, then creates a baseline of the earliest and latest times we
  have encountered this command-line argument in our dataset within the last 30 days.
search: '| tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_cmd`
  AND Processes.process="* /c *" by Processes.process Processes.original_file_name| `drop_dm_object_name(Processes)`'
how_to_implement: To successfully implement this search you need to be ingesting information on process that include the name of the process responsible for the changes from your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition, confirm the latest CIM App 4.20 or higher is installed and the latest TA for the endpoint product.
known_false_positives: none
references: []
tags:
  analytic_story:
  - DHS Report TA18-074A
  - Disabling Security Tools
  - Hidden Cobra Malware
  - Netsh Abuse
  - Orangeworm Attack Group
  - Possible Backdoor Activity Associated With MUDCARP Espionage Campaigns
  - Suspicious Command-Line Executions
  - Suspicious MSHTA Activity
  - Icedid
  detections:
  - First time seen command line argument
  deployments:
  - Daily Cache Updates
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name #parent process name
  - Processes.parent_process #parent cmdline
  - Processes.original_file_name
  - Processes.process_name #process name
  - Processes.process #process cmdline
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  security_domain: endpoint