author: Rico Valdez, Michael Haag, Splunk
datamodel:
- Endpoint
date: '2020-03-16'
description: The following analytic identifies `WmiPrvSE.exe` spawning a process.
  This typically occurs when a process is instantiated from a local or remote process
  using `wmic.exe`. During triage, review parallel processes for suspicious behavior
  or commands executed. Review the process and command-line spawning from `wmiprvse.exe`.
  Contain and remediate the endpoint as necessary.
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
id: 24869767-8579-485d-9a4f-d9ddfd8f0cac
known_false_positives: Although unlikely, administrators may use wmi to execute commands
  for legitimate purposes.
name: Process Execution via WMI
references: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name="WmiPrvSE.exe"
  by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `process_execution_via_wmi_filter` '
tags:
  analytic_story:
  - Suspicious WMI Use
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 3
  - CIS 5
  confidence: 70
  context:
  - source:endpoint
  - stage: Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1047/atomic_red_team/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Actions on Objectives
  message: A remote instance execution of wmic.exe that will spawn $parent_process_name$
    in host $dest$
  mitre_attack_id:
  - T1047
  nist:
  - PR.PT
  - PR.AT
  - PR.AC
  - PR.IP
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: user
    role:
    - Victim
    type: user
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process
  - Endpoint.Processes.parent_process_id
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 49
  security_domain: endpoint
type: TTP
version: 4
