name: Process Execution via WMI
id: 24869767-8579-485d-9a4f-d9ddfd8f0cac
version: 3
date: '2020-03-16'
description: This search looks for processes launched via WMI.
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
type: ESCU
references: []
author: Rico Valdez, Splunk
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  as process min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
  where Processes.parent_process_name = *WmiPrvSE.exe by Processes.user Processes.dest
  Processes.process_name  | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`|
  `security_content_ctime(lastTime)`| `process_execution_via_wmi_filter` '
known_false_positives: Although unlikely, administrators may use wmi to execute commands
  for legitimate purposes.
tags:
  analytics_story:
  - Suspicious WMI Use
  mitre_attack_id:
  - T1047
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 3
  - CIS 5
  nist:
  - PR.PT
  - PR.AT
  - PR.AC
  - PR.IP
  security_domain: endpoint
  asset_type: Endpoint
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1047/atomic_red_team/windows-sysmon.log
