name: Process Creating LNK file in Suspicious Location
id: 5d814af1-1041-47b5-a9ac-d754e82e9a26
version: 5
date: '2021-08-26'
author: Jose Hernandez, Splunk
type: TTP
datamodel:
- Endpoint
description: This search looks for a process launching an `*.lnk` file under `C:\User*`
  or `*\Local\Temp\*`. This is common behavior used by various spear phishing tools.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_name="*.lnk"
  AND (Filesystem.file_path="C:\\User\\*" OR Filesystem.file_path="*\\Temp\\*") by
  _time span=1h Filesystem.process_guid Filesystem.file_name Filesystem.file_path
  Filesystem.file_hash Filesystem.user | `drop_dm_object_name(Filesystem)` | rename
  process_guid as lnk_guid | join lnk_guid, _time [| tstats `security_content_summariesonly`
  count FROM datamodel=Endpoint.Processes where Processes.process_name=* by _time
  span=1h Processes.parent_process_guid Processes.process_id Processes.process_name
  Processes.dest Processes.process_path Processes.process | `drop_dm_object_name(Processes)`
  | rename parent_process_guid as lnk_guid | fields _time lnk_guid process_id dest
  process_name process_path process] | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | table firstTime, lastTime, lnk_guid, process_id, user, dest, file_name, file_path,
  process_name, process, process_path, file_hash | `process_creating_lnk_file_in_suspicious_location_filter`'
how_to_implement: You must be ingesting data that records filesystem and process activity
  from your hosts to populate the Endpoint data model. This is typically populated
  via endpoint detection-and-response product, such as Carbon Black, or endpoint data
  sources, such as Sysmon.
known_false_positives: This detection should yield little or no false positive results.
  It is uncommon for LNK files to be executed from temporary or user directories.
references:
- https://attack.mitre.org/techniques/T1566/001/
- https://www.trendmicro.com/en_us/research/17/e/rising-trend-attackers-using-lnk-files-download-malware.html
tags:
  analytic_story:
  - Spearphishing Attachments
  asset_type: Endpoint
  cis20:
  - CIS 7
  - CIS 8
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Initial Access
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1566.002/lnk_file_temp_folder/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Installation
  - Actions on Objectives
  message: A process $process_name$ that launching .lnk file in $file_path$ in host
    $dest$
  mitre_attack_id:
  - T1566
  - T1566.002
  nist:
  - ID.AM
  - PR.DS
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Filesystem.file_name
  - Filesystem.file_path
  - Filesystem.process_id
  - Filesystem.file_name
  - Filesystem.file_path
  - Filesystem.file_hash
  - Filesystem.user
  risk_score: 63
  security_domain: network
  supported_tas:
  - Splunk_TA_microsoft_sysmon
