name: Processes launching netsh
id: b89919ed-fe5f-492c-b139-95dbb162040e
version: 4
date: '2021-09-16'
author: Michael Haag, Josef Kuepker, Splunk
type: TTP
datamodel:
- Endpoint
description: This search looks for processes launching netsh.exe. Netsh is a command-line
  scripting utility that allows you to, either locally or remotely, display or modify
  the network configuration of a computer that is currently running. Netsh can be
  used as a persistence proxy technique to execute a helper DLL when netsh.exe is
  executed. In this search, we are looking for processes spawned by netsh.exe and
  executing commands via the command line.
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  AS Processes.process min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where `process_netsh` by Processes.parent_process_name Processes.parent_process
  Processes.original_file_name Processes.process_name Processes.user Processes.dest
  |`drop_dm_object_name("Processes")` |`security_content_ctime(firstTime)` |`security_content_ctime(lastTime)`
  |`processes_launching_netsh_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: Some VPN applications are known to launch netsh.exe. Outside
  of these instances, it is unusual for an executable to launch netsh.exe and run
  commands.
references: []
tags:
  analytic_story:
  - Netsh Abuse
  - Disabling Security Tools
  - DHS Report TA18-074A
  asset_type: Endpoint
  cis20:
  - CIS 8
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.004/atomic_red_team/windows-sysmon.log
  impact: 60
  kill_chain_phases:
  - Actions on Objectives
  message: A process $process_name$ that tries to execute netsh commandline $process$
    in host $dest$
  mitre_attack_id:
  - T1562.004
  - T1562
  nist:
  - PR.PT
  - DE.CM
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_name
  - Processes.user
  - Processes.dest
  risk_score: 42
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
