author: Teoderick Contreras, Splunk
datamodel:
- Endpoint
date: '2021-06-22'
description: This search is to detect a suspicious commandline designed to delete
  files or directory recursive using batch command. This technique was seen in ransomware
  (reddot) where it it tries to delete the files in recycle bin to impaire user from
  recovering deleted files.
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
id: ba570b3a-d356-11eb-8358-acde48001122
known_false_positives: network operator may use this batch command to delete recursively
  a directory or files within directory
name: Recursive Delete of Directory In Batch CMD
references:
- https://app.any.run/tasks/c0f98850-af65-4352-9746-fbebadee4f05/
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_cmd` Processes.process=*/c*  Processes.process=*
  rd * Processes.process="*/s*" Processes.process="*/q*" by Processes.user Processes.process_name
  Processes.parent_process_name Processes.parent_process Processes.process Processes.process_id
  Processes.dest |`drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `recursive_delete_of_directory_in_batch_cmd_filter`'
tags:
  analytic_story:
  - Ransomware
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/ransomware_ttp/data2/windows-sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1070.004
  - T1070
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  security_domain: endpoint
type: TTP
version: 2
