author: Rico Valdez, Splunk
datamodel:
- Endpoint
date: '2020-11-26'
description: The search looks for reg.exe modifying registry keys that define Windows
  services and their configurations.
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
id: 8470d755-0c13-45b3-bd63-387a373c10cf
known_false_positives: It is unusual for a service to be created or modified by directly
  manipulating the registry. However, there may be legitimate instances of this behavior.
  It is important to validate and investigate, as appropriate.
name: Reg exe Manipulating Windows Services Registry Keys
references: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime values(Processes.process_name) as process_name values(Processes.parent_process_name)
  as parent_process_name values(Processes.user) as user FROM datamodel=Endpoint.Processes
  where Processes.process_name="reg.exe" Processes.process="*reg*" Processes.process="*add*""
  Processes.process="*Services*" by Processes.process_id Processes.dest Processes.process
  | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `reg_exe_manipulating_windows_services_registry_keys_filter`'
tags:
  analytic_story:
  - Windows Service Abuse
  - Windows Persistence Techniques
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 3
  - CIS 5
  - CIS 8
  confidence: 60
  context:
  - source:endpoint
  - stage: Persistence
  - Privilege Escalation
  - Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1574.011/change_registry_path_service/windows-sysmon.log
  impact: 75
  kill_chain_phases:
  - Installation
  message: A reg.exe process $process_name$ with commandline $process$ in host $dest$
  mitre_attack_id:
  - T1574.011
  - T1574
  nist:
  - PR.IP
  - PR.PT
  - PR.AC
  - PR.AT
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: user
    role:
    - Victim
    type: user
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 45
  security_domain: endpoint
type: TTP
version: 5
