name: Registry Keys Used For Privilege Escalation
id: c9f4b923-f8af-4155-b697-1354f5bcbc5e
version: 5
date: '2022-01-26'
author: David Dorsey, Teoderick Contreras, Splunk
type: TTP
datamodel: []
description: This search looks for modifications to registry keys that can be used
  to elevate privileges. The registry keys under "Image File Execution Options" are
  used to intercept calls to an executable and can be used to attach malicious binaries
  to benign system binaries.
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  where (Registry.registry_path="*Microsoft\\Windows NT\\CurrentVersion\\Image File
  Execution Options*") AND (Registry.registry_value_name=GlobalFlag OR Registry.registry_value_name=Debugger)
  by _time span=1h Registry.dest Registry.user Registry.registry_path Registry.registry_value_name
  Registry.registry_value_data Registry.process_guid Registry.registry_key_name |
  `drop_dm_object_name(Registry)` |rename process_guid as proc_guid |join proc_guid,
  _time [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  by _time span=1h Processes.process_id Processes.process_name Processes.process Processes.dest
  Processes.parent_process_name Processes.parent_process Processes.process_guid |
  `drop_dm_object_name(Processes)` |rename process_guid as proc_guid | fields _time
  dest user parent_process_name parent_process process_name process_path process proc_guid
  registry_path registry_value_name registry_value_data registry_key_name] | table
  _time dest user parent_process_name parent_process process_name process_path process
  proc_guid registry_path registry_value_name registry_value_data registry_key_name
  | `registry_keys_used_for_privilege_escalation_filter`'
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black, or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
known_false_positives: There are many legitimate applications that must execute upon
  system startup and will use these registry keys to accomplish that task.
references:
- https://blog.malwarebytes.com/101/2015/12/an-introduction-to-image-file-execution-options/
tags:
  analytic_story:
  - Windows Privilege Escalation
  - Suspicious Windows Registry Activities
  - Cloud Federated Credential Abuse
  cis20:
  - CIS 8
  confidence: 95
  context:
  - Source:Endpoint
  - Stage:Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1546.012/atomic_red_team/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Actions on Objectives
  message: A registry activity in $registry_path$ related to privilege escalation
    in host $dest$
  mitre_attack_id:
  - T1546.012
  - T1546
  nist:
  - PR.PT
  - DE.CM
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.dest
  - Registry.user
  risk_score: 76
  security_domain: endpoint
  asset_type: Endpoint
