author: David Dorsey, Splunk
datamodel:
- Endpoint
date: '2020-11-27'
description: This search looks for modifications to registry keys that can be used
  to elevate privileges. The registry keys under "Image File Execution Options" are
  used to intercept calls to an executable and can be used to attach malicious binaries
  to benign system binaries.
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black, or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
id: c9f4b923-f8af-4155-b697-1354f5bcbc5e
known_false_positives: There are many legitimate applications that must execute upon
  system startup and will use these registry keys to accomplish that task.
name: Registry Keys Used For Privilege Escalation
references:
- https://blog.malwarebytes.com/101/2015/12/an-introduction-to-image-file-execution-options/
search: '| tstats `security_content_summariesonly` count  min(_time) as firstTime
  max(_time) as lastTime FROM datamodel=Endpoint.Registry where (Registry.registry_path="*Microsoft\\Windows
  NT\\CurrentVersion\\Image File Execution Options*") AND (Registry.registry_value_name=GlobalFlag
  OR Registry.registry_value_name=Debugger) by Registry.dest  Registry.user Registry.registry_path
  Registry.registry_value_name | `security_content_ctime(lastTime)`  | `security_content_ctime(firstTime)`
  | `drop_dm_object_name(Registry)` | `registry_keys_used_for_privilege_escalation_filter`'
tags:
  analytic_story:
  - Windows Privilege Escalation
  - Suspicious Windows Registry Activities
  - Cloud Federated Credential Abuse
  automated_detection_testing: passed
  cis20:
  - CIS 8
  confidence: 95
  context:
  - source:endpoint
  - stage: Persistence
  - Privilege Escalation
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1546.012/atomic_red_team/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Actions on Objectives
  message: A registry activity in $registry_path$ related to privilege escalation
    in host $dest$
  mitre_attack_id:
  - T1546.012
  - T1546
  nist:
  - PR.PT
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: user
    role:
    - Victim
    type: user
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Registry.dest
  - Endpoint.Registry.registry_path
  - Endpoint.Registry.registry_value_name
  - Endpoint.Registry.user
  - _time
  risk_score: 76
  security_domain: endpoint
type: TTP
version: 4
