name: Registry Keys Used For Privilege Escalation
id: c9f4b923-f8af-4155-b697-1354f5bcbc5e
version: 7
date: '2023-04-27'
author: Steven Dick, David Dorsey, Teoderick Contreras, Splunk
status: production
type: TTP
description: This search looks for modifications to registry keys that can be used
  to elevate privileges. The registry keys under "Image File Execution Options" are
  used to intercept calls to an executable and can be used to attach malicious binaries
  to benign system binaries.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  WHERE ((Registry.registry_path="*Microsoft\\Windows NT\\CurrentVersion\\Image File
  Execution Options*") AND (Registry.registry_value_name=GlobalFlag OR Registry.registry_value_name=Debugger))
  BY _time span=1h Registry.registry_path Registry.registry_key_name Registry.registry_value_name
  Registry.registry_value_data Registry.process_guid | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data) | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `registry_keys_used_for_privilege_escalation_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the registry value name, registry path, and registry value data from your
  endpoints. If you are using Sysmon, you must have at least version 2.0 of the offical
  Sysmon TA. https://splunkbase.splunk.com/app/5709
known_false_positives: There are many legitimate applications that must execute upon
  system startup and will use these registry keys to accomplish that task.
references:
- https://blog.malwarebytes.com/101/2015/12/an-introduction-to-image-file-execution-options/
tags:
  analytic_story:
  - Cloud Federated Credential Abuse
  - Hermetic Wiper
  - Windows Privilege Escalation
  - Windows Registry Abuse
  - Data Destruction
  - Suspicious Windows Registry Activities
  asset_type: Endpoint
  confidence: 95
  impact: 80
  message: A registry activity in $registry_path$ related to privilege escalation
    in host $dest$
  mitre_attack_id:
  - T1546.012
  - T1546
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.dest
  - Registry.registry_value_name
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.registry_value_data
  - Registry.process_guid
  risk_score: 76
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1546.012/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
