author: Teoderick Contreras, Splunk
datamodel:
- Endpoint
date: '2021-07-27'
description: The following analytic identifies Regsvr32.exe utilizing the silent switch
  to load DLLs. This technique has most recently been seen in IcedID campaigns to
  load its initial dll that will download the 2nd stage loader that will download
  and decrypt the config payload. The switch type may be either a hyphen `-` or forward
  slash `/`. This behavior is typically found with `-s`, and it is possible there
  are more switch types that may be used. \ During triage, review parallel processes
  and capture any artifacts that may have landed on disk. Isolate and contain the
  endpoint as necessary.
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
id: c9ef7dc4-eeaf-11eb-b2b6-acde48001122
known_false_positives: minimal. but network operator can use this application to load
  dll.
name: Regsvr32 with Known Silent Switch Cmdline
references:
- https://app.any.run/tasks/56680cba-2bbc-4b34-8633-5f7878ddf858/
- https://regexr.com/699e2
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_regsvr32` by Processes.user
  Processes.process_name Processes.process Processes.parent_process_name Processes.original_file_name
  Processes.dest Processes.process_id | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | where match(process,"(?i)[\-|\/][Ss]{1}")
  | `regsvr32_with_known_silent_switch_cmdline_filter`'
tags:
  analytic_story:
  - IcedID
  - Suspicious Regsvr32 Activity
  - Remcos
  automated_detection_testing: passed
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/inf_icedid/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ attempting to load a DLL using the silent parameter.
  mitre_attack_id:
  - T1218
  - T1218.010
  observable:
  - name: user
    role:
    - Victim
    type: User
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: parent_process_name
    role:
    - Parent Process
    type: Parent Process
  - name: process_name
    role:
    - Child Process
    type: Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Processes.dest
  - Processes.original_file_name
  - Processes.parent_process_name
  - Processes.process
  - Processes.process_id
  - Processes.process_name
  - Processes.user
  - _time
  risk_score: 56
  security_domain: endpoint
type: Anomaly
version: 2
