name: Regsvr32 Silent Param Dll Loading
id: f421c250-24e7-11ec-bc43-acde48001122
version: 1
date: '2021-10-04'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This analytic is to detect a loading of dll using regsvr32 application
  with silent parameter and dllinstall execution. This technique was seen in several
  RAT malware like remcos, njrat and APT's to load their malicious dll in the compromised
  machine. This TTP may executed by normal 3rd party application so it is better to
  pivot the parent process, parent commandline and commandline of the file that execute
  this regsvr32.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name = regsvr32.exe
  Processes.process="*/i*" Processes.process="*/s*" by Processes.dest Processes.parent_process
  Processes.process Processes.parent_process_name Processes.process_name Processes.original_file_name
  Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `regsvr32_silent_param_dll_loading_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: Other third part application may used this parameter but not
  so common in base windows environment.
references:
- https://app.any.run/tasks/dc93ee63-050c-4ff8-b07e-8277af9ab939/#
- https://attack.mitre.org/techniques/T1218/010/
tags:
  analytic_story:
  - Suspicious Regsvr32 Activity
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.005/vbs_wscript/sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1218
  - T1218.010
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  security_domain: endpoint
  impact: 60
  confidence: 60
  risk_score: 36
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  message: regsvr32 process with $process$ commandline in $dest$
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  automated_detection_testing: passed
