name: Remcos client registry install entry
id: f2a1615a-1d63-11ec-97d2-acde48001122
version: 2
date: '2022-01-26'
author: Bhavin Patel, Rod Soto, Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This search detects registry key license at host where Remcos RAT agent
  is installed.
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  where (Registry.registry_key_name=*\\Software\\Remcos*) by _time span=1h Registry.dest
  Registry.user Registry.registry_path Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid | `drop_dm_object_name(Registry)` |rename process_guid as
  proc_guid |join proc_guid, _time [| tstats `security_content_summariesonly` count
  FROM datamodel=Endpoint.Processes by _time span=1h Processes.process_id Processes.process_name
  Processes.process Processes.dest Processes.parent_process_name Processes.parent_process
  Processes.process_guid | `drop_dm_object_name(Processes)` |rename process_guid as
  proc_guid | fields _time dest user parent_process_name parent_process process_name
  process_path process proc_guid registry_path registry_value_name registry_value_data]
  | table _time dest user parent_process_name parent_process process_name process_path
  process proc_guid registry_path registry_value_name registry_value_data |`remcos_client_registry_install_entry_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node. Also make sure
  that this registry was included in your config files ex. sysmon config to be monitored.
known_false_positives: unknown
references:
- https://attack.mitre.org/software/S0332/
tags:
  analytic_story:
  - Remcos
  confidence: 100
  context:
  - Source:Endpoint
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/remcos/remcos_panel_client/remcos_registry_entry.log
  impact: 90
  kill_chain_phases:
  - Exploitation
  message: A registry entry $registry_path$ with registry keyname $registry_key_name$
    related to Remcos RAT in host $dest$
  mitre_attack_id:
  - T1112
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.process_id
  - Registry.dest
  - Registry.user
  risk_score: 90
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
