name: Remcos RAT File Creation in Remcos Folder
id: 25ae862a-1ac3-11ec-94a1-acde48001122
version: 1
date: '2021-09-21'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This search is to detect file creation in remcos folder in appdata which
  is the keylog and clipboard logs that will be send to its c2 server. This is really
  a good TTP indicator that there is a remcos rat in the system that do keylogging,
  clipboard grabbing and audio recording.
search: '|tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_name IN ("*.dat")
  Filesystem.file_path = "*\\remcos\\*" by _time Filesystem.file_name Filesystem.file_path
  Filesystem.dest Filesystem.file_create_time | `drop_dm_object_name(Processes)` |
  `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `remcos_rat_file_creation_in_remcos_folder_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: unknown
references:
- https://success.trendmicro.com/solution/1123281-remcos-malware-information
- https://blog.malwarebytes.com/threat-intelligence/2021/07/remcos-rat-delivered-via-visual-basic/
tags:
  analytic_story:
  - Remcos
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Collection
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/remcos/remcos_agent/sysmon.log
  impact: 100
  kill_chain_phases:
  - Exploitation
  message: file $file_name$ created in $file_path$ of $dest$
  mitre_attack_id:
  - T1113
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - dest
  - file_create_time
  - file_name
  - file_path
  risk_score: 100
  security_domain: endpoint
  asset_type: Endpoint
