name: Remcos client registry install entry
id: f2a1615a-1d63-11ec-97d2-acde48001122
version: 1
date: '2021-09-24'
author: Bhavin Patel, Rod Soto, Splunk
type: TTP
datamodel:
- Endpoint
description: This search detects registry key license at host where Remcos RAT agent
  is installed.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime values(Registry.registry_path) as  registry_path FROM datamodel=Endpoint.Registry
  where (Registry.registry_key_name=*\\Software\\Remcos*) by Registry.dest  Registry.user
  Registry.registry_key_name Registry.process_id| `drop_dm_object_name(Registry)`
  | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)`|`remcos_client_registry_install_entry_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node. Also make sure
  that this registry was included in your config files ex. sysmon config to be monitored.
known_false_positives: unknown
references:
- https://attack.mitre.org/software/S0332/
tags:
  analytic_story:
  - Remcos
  automated_detection_testing: passed
  confidence: 100
  context:
  - Source:Endpoint
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/remcos/remcos_panel_client/remcos_registry_entry.log
  impact: 90
  kill_chain_phases:
  - Exploitation
  message: A registry entry $registry_path$ with registry keyname $registry_key_name$
    related to Remcos RAT in host $dest$
  mitre_attack_id:
  - T1112
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.process_id
  - Registry.dest
  - Registry.user
  risk_score: 90
  security_domain: endpoint
  cim_version: 5.0.0
  supported_tas:
  - Splunk_TA_microsoft_sysmon
