name: Recoms client registry install entry
id: a2f711f6-1cb2-11ec-9621-0242ac130002
version: 1
date: '2023-09-23'
author: Rod Soto, Splunk
type: TTP
datamodel:
- Endpoint
description: This search detects registry key license at host where Remcos RAT agent is installed.
search: '| tstats `security_content_summariesonly` count values(Registry.registry_key_name)
  as registry_key_name values(Registry.registry_path) as registry_path min(_time)
  as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Registry where (Registry.registry_path=*\\Software\\Remcos*)|
  `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` | `drop_dm_object_name(Registry)` | `remcos_registry_install_entry_filter`'
how_to_implement: to successfully implement this search, you need to be ingesting
  logs with the Image, TargetObject registry key, registry Details from your endpoints.
  If you are using Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
known_false_positives: unknown
references:
- https://krebsonsecurity.com/2021/05/a-closer-look-at-the-darkside-ransomware-gang/
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-service-what-the-code-tells-us/
tags:
  analytic_story:
  - Remcos 
  automated_detection_testing: passed
  confidence: 100
  context:
  - source:endpoint
  - stage: Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/revil/inf1/windows-sysmon.log
  impact: 60
  kill_chain_phases:
  - Exploitation
  message: A registry entry $registry_path$ with registry value $registry_value_name$
    and $registry_value_name$ related to revil ransomware in host $dest$
  mitre_attack_id:
  - T1112
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: user
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.dest
  - Registry.user
  - Registry.registry_value_name
  - Registry.registry_path
  - Registry.registry_key_name
  risk_score: 60
  security_domain: endpoint
