name: Remcos RAT File Creation in Remcos Folder
id: 25ae862a-1ac3-11ec-94a1-acde48001122
version: 3
date: '2024-05-24'
author: Teoderick Contreras, Splunk, Sanjay Govind
status: production
type: TTP
description: The following analytic detects the creation of files in the Remcos folder
  within the AppData directory, specifically targeting keylog and clipboard log files.
  It leverages the Endpoint.Filesystem data model to identify .dat files created in
  paths containing "remcos." This activity is significant as it indicates the presence
  of the Remcos RAT, which performs keylogging, clipboard capturing, and audio recording.
  If confirmed malicious, this could lead to unauthorized data exfiltration and extensive
  surveillance capabilities for the attacker.
data_source:
- Sysmon EventID 11
search: '|tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_name IN ("*.dat")
  Filesystem.file_path = "*\\remcos\\*" by _time Filesystem.file_name Filesystem.file_path
  Filesystem.dest Filesystem.file_create_time | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `remcos_rat_file_creation_in_remcos_folder_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: unknown
references:
- https://success.trendmicro.com/dcx/s/solution/1123281-remcos-malware-information?language=en_US
- https://blog.malwarebytes.com/threat-intelligence/2021/07/remcos-rat-delivered-via-visual-basic/
tags:
  analytic_story:
  - Remcos
  asset_type: Endpoint
  confidence: 100
  impact: 100
  message: file $file_name$ created in $file_path$ of $dest$
  mitre_attack_id:
  - T1113
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - dest
  - file_create_time
  - file_name
  - file_path
  risk_score: 100
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/remcos/remcos_agent/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
