name: Remote Process Instantiation via WinRM and PowerShell Script Block
id: 7d4c618e-4716-11ec-951c-3e22fbd008af
version: 2
date: '2022-03-22'
author: Mauricio Velazco, Splunk
status: production
type: TTP
description: The following analytic utilizes PowerShell Script Block Logging (EventCode=4104)
  to identify the execution of PowerShell with arguments utilized to start a process
  on a remote endpoint by abusing the WinRM protocol. Specifically, this search looks
  for the abuse of the `Invoke-Command` commandlet. Red Teams and adversaries alike
  may abuse WinRM for lateral movement and remote code execution.
data_source:
- Powershell 4104
search: '`powershell` EventCode=4104 (ScriptBlockText="*Invoke-Command*" AND ScriptBlockText="*-ComputerName*")
  | stats count min(_time) as firstTime max(_time) as lastTime by EventCode ScriptBlockText
  Computer user_id | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `remote_process_instantiation_via_winrm_and_powershell_script_block_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup instructions
  can be found https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: Administrators may leverage WinRM and `Invoke-Command` to start
  a process on remote systems for system administration or automation use cases. This
  activity is usually limited to a small set of hosts or users. In certain environments,
  tuning may not be possible.
references:
- https://attack.mitre.org/techniques/T1021/006/
- https://pentestlab.blog/2018/05/15/lateral-movement-winrm/
tags:
  analytic_story:
  - Active Directory Lateral Movement
  asset_type: Endpoint
  confidence: 50
  impact: 90
  message: A process was started on a remote endpoint from $Computer$ by abusing WinRM
    using PowerShell.exe
  mitre_attack_id:
  - T1021
  - T1021.006
  observable:
  - name: Computer
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - ScriptBlockText
  - Opcode
  - Computer
  - UserID
  - EventCode
  risk_score: 45
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1021.006/lateral_movement_psh/windows-powershell-xml.log
    source: XmlWinEventLog:Microsoft-Windows-PowerShell/Operational
    sourcetype: xmlwineventlog
