name: Remote Process Instantiation via WMI and PowerShell Script Block
id: 2a048c14-4634-11ec-a618-3e22fbd008af
version: 1
date: '2021-11-15'
author: Mauricio Velazco, Splunk
type: TTP
datamodel: []
description: The following analytic utilizes PowerShell Script Block Logging (EventCode=4104)
  to identify the execution of the `Invoke-WmiMethod` commandlet with arguments utilized
  to start a process on a remote endpoint by abusing WMI. Red Teams and adversaries
  alike may abuse WMI and this commandlet for lateral movement and remote code execution.
search: '`powershell` EventCode=4104 (Message="*Invoke-WmiMethod*" AND Message="*-CN*"
  AND Message="*-Class Win32_Process*" AND Message="*-Name create*") | stats count
  min(_time) as firstTime max(_time) as lastTime by EventCode Message ComputerName
  User | `security_content_ctime(firstTime)` | `remote_process_instantiation_via_wmi_and_powershell_script_block_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup instructions
  can be found https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: Administrators may leverage WWMI and powershell.exe to start
  a process on remote systems, but this activity is usually limited to a small set
  of hosts or users.
references:
- https://attack.mitre.org/techniques/T1047/
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/invoke-wmimethod?view=powershell-5.1
tags:
  analytic_story:
  - Active Directory Lateral Movement
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Lateral Movement
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1047/lateral_movement/windows-powershell.log
  impact: 90
  kill_chain_phases:
  - Exploitation
  message: A process was started on a remote endpoint from $ComputerName by abusing
    WMI using PowerShell.exe
  mitre_attack_id:
  - T1047
  observable:
  - name: ComputerName
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - Message
  - ComputerName
  - User
  risk_score: 63
  security_domain: endpoint
  asset_type: Endpoint
