name: Remote Process Instantiation via WMI
id: d25d2c3d-d9d8-40ec-8fdf-e86fe155a3da
version: 5
date: '2020-11-30'
description: This search looks for wmic.exe being launched with parameters to spawn
  a process on a remote system.
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
type: ESCU
references: []
author: Rico Valdez, Splunk
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process_name = wmic.exe Processes.process="*/node*" Processes.process="*process*"
  Processes.process="*call*" Processes.process="*create*"   by Processes.process_name
  Processes.parent_process_name Processes.dest Processes.user | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` |`security_content_ctime(lastTime)` | `remote_process_instantiation_via_wmi_filter`'
known_false_positives: The wmic.exe utility is a benign Windows application. It may
  be used legitimately by Administrators with these parameters for remote system administration,
  but it's relatively uncommon.
tags:
  analytics_story:
  - Ransomware
  - Suspicious WMI Use
  mitre_attack_id:
  - T1047
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 3
  - CIS 5
  nist:
  - PR.PT
  - PR.AT
  - PR.AC
  - PR.IP
  security_domain: endpoint
  asset_type: Endpoint
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1047/atomic_red_team/windows-sysmon.log
