name: Remote Desktop Process Running On System
id: f5939373-8054-40ad-8c64-cec478a22a4a
version: 6
date: '2024-05-24'
author: David Dorsey, Splunk
status: experimental
type: Hunting
description: The following analytic detects the execution of the remote desktop process
  (mstsc.exe) on systems where it is not typically run. This detection leverages data
  from Endpoint Detection and Response (EDR) agents, filtering out systems categorized
  as common RDP sources. This activity is significant because unauthorized use of
  mstsc.exe can indicate lateral movement or unauthorized remote access attempts.
  If confirmed malicious, this could allow an attacker to gain remote control of a
  system, potentially leading to data exfiltration, privilege escalation, or further
  network compromise.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process=*mstsc.exe
  AND Processes.dest_category!=common_rdp_source by Processes.dest Processes.user
  Processes.process | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `drop_dm_object_name(Processes)` | `remote_desktop_process_running_on_system_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Remote Desktop may be used legitimately by users on the network.
references: []
tags:
  analytic_story:
  - Hidden Cobra Malware
  - Active Directory Lateral Movement
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1021.001
  - T1021
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.dest_category
  - Processes.dest
  - Processes.user
  risk_score: 25
  security_domain: endpoint
