name: Remote System Discovery with Net
id: 9df16706-04a2-41e2-bbfe-9b38b34409d3
version: 1
date: '2021-08-30'
author: Mauricio Velazco, Splunk
type: Hunting
datamodel:
- Endpoint
description: This analytic looks for the execution of `net.exe` or `net1.exe` with
  command-line arguments utilized to discover remote systems. The argument `domain
  computers /domain` returns a list of all domain computers. Red Teams and adversaries
  alike use net.exe to identify remote systems for situational awareness and Active
  Directory Discovery.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name="net.exe"
  OR Processes.process_name="net1.exe") (Processes.process="*domain computers*" AND
  Processes.process=*/do*) OR (Processes.process="*view*" AND Processes.process=*/do*)
  by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `remote_system_discovery_with_net_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Administrators or power users may use this command for troubleshooting.
references:
- https://attack.mitre.org/techniques/T1018/
tags:
  analytic_story:
  - Active Directory Discovery
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Discovery
  - Stage:Recon
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1018/AD_discovery/windows-sysmon.log
  impact: 30
  kill_chain_phases:
  - Reconnaissance
  message: Remote system discovery enumeration on $dest$ by $user$
  mitre_attack_id:
  - T1018
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 15
  security_domain: endpoint
  asset_type: Endpoint
