name: Remote System Discovery with Adsisearcher
id: 70803451-0047-4e12-9d63-77fa7eb8649c
version: 1
date: '2021-09-01'
author: Mauricio Velazco, Splunk
type: TTP
datamodel: []
description: The following analytic utilizes PowerShell Script Block Logging (EventCode=4104)
  to identify the `[Adsisearcher]` type accelerator being used to query Active Directory
  for domain computers. Red Teams and adversaries may leverage `[Adsisearcher]` to
  enumerate domain computers for situational awareness and Active Directory Discovery.
search: '`powershell` EventCode=4104 (Message = "*[adsisearcher]*" AND Message = "*objectclass=computer*"
  AND Message = "*findAll()*") | stats count min(_time) as firstTime max(_time) as
  lastTime by EventCode Message ComputerName User | `security_content_ctime(firstTime)`
  | `remote_system_discovery_with_adsisearcher_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: Administrators or power users may use Adsisearcher for troubleshooting.
references:
- https://attack.mitre.org/techniques/T1018/
- https://devblogs.microsoft.com/scripting/use-the-powershell-adsisearcher-type-accelerator-to-search-active-directory/
tags:
  analytic_story:
  - Active Directory Discovery
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Discovery
  - Stage:Recon
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1018/AD_discovery/windows-powershell.log
  impact: 30
  kill_chain_phases:
  - Reconnaissance
  message: Remote system discovery enumeration on $dest$ by $user$
  mitre_attack_id:
  - T1018
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - Message
  - ComputerName
  - User
  risk_score: 15
  security_domain: endpoint
  asset_type: Endpoint
