name: Resize ShadowStorage volume
id: bc760ca6-8336-11eb-bcbb-acde48001122
version: 1
date: '2021-03-12'
author: Teoderick Contreras
status: production
type: TTP
description: The following analytics identifies the resizing of shadowstorage by ransomware
  malware to avoid the shadow volumes being made again. this technique is an alternative
  by ransomware attacker than deleting the shadowstorage which is known alert in defensive
  team. one example of ransomware that use this technique is CLOP ransomware where
  it drops a .bat file that will resize the shadowstorage to minimum size as much
  as possible
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` values(Processes.process) as cmdline
  values(Processes.parent_process_name) as parent_process values(Processes.process_name)
  as process_name min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.parent_process_name = "cmd.exe" OR Processes.parent_process_name
  = "powershell.exe" OR Processes.parent_process_name = "powershell_ise.exe" OR Processes.parent_process_name
  =  "wmic.exe" Processes.process_name = "vssadmin.exe" Processes.process="*resize*"
  Processes.process="*shadowstorage*" Processes.process="*/maxsize*" by Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.process Processes.dest
  Processes.user Processes.process_id Processes.process_guid | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` |`security_content_ctime(lastTime)` | `resize_shadowstorage_volume_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: network admin can resize the shadowstorage for valid purposes.
references:
- https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md
- https://redcanary.com/blog/blackbyte-ransomware/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/vssadmin-resize-shadowstorage
tags:
  analytic_story:
  - Clop Ransomware
  - BlackByte Ransomware
  asset_type: Endpoint
  confidence: 90
  impact: 80
  message: A process $parent_process_name$ attempt to resize shadow copy with commandline
    $process$ in host $dest$
  mitre_attack_id:
  - T1490
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Processes.process
  - Processes.parent_process_name
  - _time
  - Processes.process_name
  - Processes.parent_process
  - Processes.dest
  - Processes.user
  risk_score: 72
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/clop/clop_a/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
