author: Teoderick Contreras
datamodel:
- Endpoint
date: '2021-03-12'
description: The following analytics identifies the resizing of shadowstorage by ransomware
  malware to avoid the shadow volumes being made again. this technique is an alternative
  by ransomware attacker than deleting the shadowstorage which is known alert in defensive
  team. one example of ransomware that use this technique is CLOP ransomware where
  it drops a .bat file that will resize the shadowstorage to minimum size as much
  as possible
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
id: bc760ca6-8336-11eb-bcbb-acde48001122
known_false_positives: network admin can resize the shadowstorage for valid purposes.
name: Resize ShadowStorage volume
references:
- https://www.fireeye.com/blog/threat-research/2020/10/fin11-email-campaigns-precursor-for-ransomware-data-theft.html
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
search: '| tstats `security_content_summariesonly` values(Processes.process) as cmdline
  values(Processes.parent_process_name) as parent_process values(Processes.process_name)
  as process_name min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.parent_process_name = "cmd.exe" OR Processes.parent_process_name
  = "powershell.exe" OR Processes.parent_process_name = "powershell_ise.exe" OR Processes.parent_process_name
  =  "wmic.exe" Processes.process_name = "vssadmin.exe" Processes.process="*resize*"
  Processes.process="*shadowstorage*" Processes.process="*/maxsize*" by Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.process Processes.dest
  Processes.user Processes.process_id Processes.process_guid | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` |`security_content_ctime(lastTime)` | `resize_shadowstorage_volume_filter`'
tags:
  analytic_story:
  - Clop Ransomware
  automated_detection_testing: passed
  confidence: 90
  context:
  - source:endpoint
  - stage: Impact
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/clop/clop_a/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: A process $parent_process_name$ attempt to resize shadow copy with commandline
    $process$ in host $dest$
  mitre_attack_id:
  - T1490
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: user
    role:
    - Victim
    type: user
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Processes.dest
  - Processes.parent_process
  - Processes.parent_process_name
  - Processes.process
  - Processes.process_guid
  - Processes.process_id
  - Processes.process_name
  - Processes.user
  - _time
  risk_score: 72
  security_domain: endpoint
type: TTP
version: 1
