name: Resize ShadowStorage volume
id: bc760ca6-8336-11eb-bcbb-acde48001122
version: 1
date: '2021-03-12'
author: Teoderick Contreras
type: batch
datamodel:
- Endpoint
description: The following analytics identifies the resizing of shadowstorage by ransomware
  malware to avoid the shadow volumes being made again. this technique is an alternative
  by ransomware attacker than deleting the shadowstorage which is known alert in defensive
  team. one example of ransomware that use this technique is CLOP ransomware where
  it drops a .bat file that will resize the shadowstorage to minimum size as much
  as possible
search: '| tstats `security_content_summariesonly` values(Processes.process) as cmdline
  values(Processes.parent_process_name) as parent_process values(Processes.process_name)
  as process_name min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.parent_process_name = "cmd.exe" OR Processes.parent_process_name
  = "powershell.exe" OR Processes.parent_process_name = "powershell_ise.exe" OR Processes.parent_process_name
  =  "wmic.exe" Processes.process_name = "vssadmin.exe" Processes.process="*resize*"
  Processes.process="*shadowstorage*" Processes.process="*/maxsize*" by Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.process Processes.dest
  Processes.user Processes.process_id Processes.process_guid | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` |`security_content_ctime(lastTime)` | `resize_shadowstorage_volume_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: network admin can resize the shadowstorage for valid purposes.
references:
- https://www.fireeye.com/blog/threat-research/2020/10/fin11-email-campaigns-precursor-for-ransomware-data-theft.html
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
tags:
  analytic_story:
  - Clop Ransomware
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/clop/clop_a/windows-sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1490
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Processes.process
  - Process.parent_process_name
  - _time
  - Processes.process_name
  - Processes.parent_process
  - Processes.dest
  - Processes.user
  security_domain: endpoint
  impact: 80 
  confidence: 90  
  # (impact * confidence)/100
  risk_score: 72 
  context:
  - source:endpoint
  - stage: Impact
  message: A process $parent_process_name$ attempt to resize shadow copy with commandline $process$ in host $dest$ 
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: user
    role:
    - Victim
