name: Revil Common Exec Parameter
id: 85facebe-c382-11eb-9c3e-acde48001122
version: 1
date: '2021-06-02'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: This analytic identifies suspicious commandline parameter that are commonly
  used by REVIL ransomware to encrypts the compromise machine.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process = "*-nolan*"
  OR Processes.process = "*-nolocal*" OR Processes.process = "*-fast*" OR Processes.process
  = "*-full*" by Processes.process_name Processes.process Processes.parent_process_name
  Processes.parent_process Processes.dest Processes.user Processes.process_id Processes.process_guid
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `revil_common_exec_parameter_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: third party tool may have same command line parameters as revil
  ransomware.
references:
- https://krebsonsecurity.com/2021/05/a-closer-look-at-the-darkside-ransomware-gang/
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-service-what-the-code-tells-us/
tags:
  analytic_story:
  - Ransomware
  - Revil Ransomware
  automated_detection_testing: passed
  confidence: 90
  context:
  - source:endpoint
  - stage: Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/revil/inf1/windows-sysmon.log
  impact: 60
  kill_chain_phases:
  - Exploitation
  message: A process $process_name$ with commandline $process$ related to revil ransomware
    in host $dest$
  mitre_attack_id:
  - T1204
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: user
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_name
  - Processes.process
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.dest
  - Processes.user
  - Processes.process_id
  - Processes.process_guid
  risk_score: 54
  security_domain: endpoint
