name: Rundll32 with no Command Line Arguments with Network
id: 35307032-a12d-11eb-835f-acde48001122
version: 3
date: '2021-10-13'
author: Michael Haag, Splunk
type: TTP
datamodel:
- Endpoint
description: The following analytic identifies rundll32.exe with no command line arguments
  and performing a network connection. It is unusual for rundll32.exe to execute with
  no command line arguments present. This particular behavior is common with malicious
  software, including Cobalt Strike. During investigation, triage any network connections
  and parallel processes. Identify any suspicious module loads related to credential
  dumping or file writes. Rundll32.exe is natively found in C:\Windows\system32 and
  C:\Windows\syswow64.
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where `process_rundll32` by _time span=1h  Processes.process_guid Processes.process_name
  Processes.dest Processes.process_path Processes.process Processes.parent_process_name
  Processes.original_file_name | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | regex process="(rundll32\.exe.{0,4}$)" |
  join  process_guid [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Ports
  where Ports.dest_port !="0" by Ports.process_guid Ports.dest Ports.dest_port| `drop_dm_object_name(Ports)`
  | rename  dest as connection_to_CNC] | table _time dest parent_process_name process_name
  process_path process process_guid connection_to_CNC dest_port | `rundll32_with_no_command_line_arguments_with_network_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` and `port` node.
  To successfully implement this search you need to be ingesting information on process
  that include the name of the process responsible for the changes from your endpoints
  into the `Endpoint` datamodel in the `Processes` node. In addition, confirm the
  latest CIM App 4.20 or higher is installed and the latest TA for the endpoint product.
known_false_positives: Although unlikely, some legitimate applications may use a moved
  copy of rundll32, triggering a false positive.
references:
- https://attack.mitre.org/techniques/T1218/011/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.011/T1218.011.md
- https://lolbas-project.github.io/lolbas/Binaries/Rundll32
- https://bohops.com/2018/02/26/leveraging-inf-sct-fetch-execute-techniques-for-bypass-evasion-persistence/
tags:
  analytic_story:
  - Suspicious Rundll32 Activity
  - Cobalt Strike
  - PrintNightmare CVE-2021-34527
  automated_detection_testing: passed
  confidence: 100
  context:
  - source:endpoint
  - stage: Defense Evasion
  cve:
  - CVE-2021-34527
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1055/cobalt_strike/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: A rundll32 process $process_name$ with no commandline argument like this
    process commandline $process$ in host $dest$
  mitre_attack_id:
  - T1218
  - T1218.011
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: processname
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 70
  security_domain: endpoint
  cim_version: 5.0.0
  tas_with_cim_mapping:
  - Splunk_TA_microsoft_sysmon
  supported_tas:
  - Splunk_TA_microsoft_sysmon
