name: Rundll32 Process Creating Exe Dll Files
id: 6338266a-ee2a-11eb-bf68-acde48001122
version: 2
date: '2023-11-07'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: This search is to detect a suspicious rundll32 process that drops executable
  (.exe or .dll) files. This behavior seen in rundll32 process of IcedID that tries
  to drop copy of itself in temp folder or download executable drop it either appdata
  or programdata as part of its execution.
data_source:
- Sysmon Event ID 1
search: '`sysmon` EventCode=11 Image="*rundll32.exe" TargetFilename IN ("*.exe", "*.dll") 
| stats count min(_time) as firstTime max(_time) as lastTime by Image TargetFilename Computer 
| rename Computer as dest | rename TargetFilename as file_name
| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)` 
| `rundll32_process_creating_exe_dll_files_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, TargetFilename, and eventcode 11 executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. Tune and filter known instances where renamed rundll32.exe may be used.
known_false_positives: unknown
references:
- https://any.run/malware-trends/icedid
tags:
  analytic_story:
  - IcedID
  - Living Off The Land
  asset_type: Endpoint
  confidence: 100
  impact: 80
  message: rundll32 process drops a file $file_name$ on host $dest$
  mitre_attack_id:
  - T1218
  - T1218.011
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: file_name
    type: File Name
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - process_name
  - file_name
  - process_guid
  - dest
  - user_id
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/inf_icedid/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
