name: Rundll32 with no Command Line Arguments with Network
id: 35307032-a12d-11eb-835f-acde48001122
version: 5
date: '2024-05-21'
author: Steven Dick,  Michael Haag, Splunk
status: production
type: TTP
description: The following analytic detects the execution of rundll32.exe without
  command line arguments, followed by a network connection. This behavior is identified
  using Endpoint Detection and Response (EDR) telemetry and network traffic data.
  It is significant because rundll32.exe typically requires arguments to function,
  and its absence is often associated with malicious activity, such as Cobalt Strike.
  If confirmed malicious, this activity could indicate an attempt to establish unauthorized
  network connections, potentially leading to data exfiltration or further compromise
  of the system.
data_source:
- Sysmon EventID 1 AND Sysmon EventID 3
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Processes where `process_rundll32` AND Processes.action!="blocked"
  by host _time span=1h Processes.process_id Processes.process_name Processes.dest
  Processes.process_path Processes.process Processes.parent_process_name Processes.parent_process
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | regex process="(?i)(rundll32\.exe.{0,4}$)" | rename dest as src | join host process_id
  [| tstats `security_content_summariesonly` count latest(All_Traffic.dest) as dest
  latest(All_Traffic.dest_ip) as dest_ip latest(All_Traffic.dest_port) as dest_port
  FROM datamodel=Network_Traffic.All_Traffic where All_Traffic.dest_port != 0 by host
  All_Traffic.process_id | `drop_dm_object_name(All_Traffic)`] | `rundll32_with_no_command_line_arguments_with_network_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Although unlikely, some legitimate applications may use a moved
  copy of rundll32, triggering a false positive.
references:
- https://attack.mitre.org/techniques/T1218/011/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.011/T1218.011.md
- https://lolbas-project.github.io/lolbas/Binaries/Rundll32/
- https://bohops.com/2018/02/26/leveraging-inf-sct-fetch-execute-techniques-for-bypass-evasion-persistence/
tags:
  analytic_story:
  - Suspicious Rundll32 Activity
  - Cobalt Strike
  - BlackByte Ransomware
  - PrintNightmare CVE-2021-34527
  - Graceful Wipe Out Attack
  asset_type: Endpoint
  confidence: 100
  cve:
  - CVE-2021-34527
  impact: 70
  message: A rundll32 process $process_name$ with no commandline argument like this
    process commandline $process$ in host $src$
  mitre_attack_id:
  - T1218
  - T1218.011
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: Process Name
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 70
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1055/cobalt_strike/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
