name: Rundll32 CreateRemoteThread In Browser
id: f8a22586-ee2d-11eb-a193-acde48001122
version: 1
date: '2021-07-26'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: This analytic identifies the suspicious Remote Thread execution of rundll32.exe
  process to "firefox.exe" and "chrome.exe" browser. This technique was seen in IcedID
  malware where it hooks the browser to parse banking information as user used the
  targetted browser process.
data_source:
- Sysmon EventID 8
search: '`sysmon` EventCode=8 SourceImage = "*\\rundll32.exe" TargetImage IN ("*\\firefox.exe",
  "*\\chrome.exe", "*\\iexplore.exe","*\\microsoftedgecp.exe") | stats count min(_time)
  as firstTime max(_time) as lastTime by SourceImage TargetImage TargetProcessId SourceProcessId
  StartAddress EventCode dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `rundll32_createremotethread_in_browser_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the SourceImage, TargetImage, and EventCode executions from your endpoints
  related to create remote thread or injecting codes. If you are using Sysmon, you
  must have at least version 6.0.4 of the Sysmon TA.
known_false_positives: unknown
references:
- https://www.joesandbox.com/analysis/380662/0/html
tags:
  analytic_story:
  - IcedID
  - Living Off The Land
  asset_type: Endpoint
  confidence: 100
  impact: 70
  message: rundl32 process $SourceImage$ create a remote thread to browser process
    $TargetImage$ in host $dest$
  mitre_attack_id:
  - T1055
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: SourceImage
    type: Process
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - SourceImage
  - TargetImage
  - TargetProcessId
  - SourceProcessId
  - StartAddress
  - EventCode
  - dest
  risk_score: 70
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/inf_icedid/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
