name: Scheduled Task Deleted Or Created via CMD
id: d5af132c-7c17-439c-9d31-13d55340f36c
version: 6
date: '2022-02-22'
author: Bhavin Patel, Splunk
type: TTP
datamodel:
- Endpoint
description: The following analytic identifies the creation or deletion of a scheduled
  task using schtasks.exe with flags - create or delete being passed on the command-line.
  This has been associated with the Dragonfly threat actor, and the SUNBURST attack
  against Solarwinds. This analytic replaces "Scheduled Task used in BadRabbit Ransomware".
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  as process values(Processes.parent_process) as parent_process min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=schtasks.exe
  (Processes.process=*delete* OR Processes.process=*create*) by Processes.user Processes.process_name
  Processes.parent_process_name Processes.dest | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `scheduled_task_deleted_or_created_via_cmd_filter` '
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: It is possible scripts or administrators may trigger this analytic.
  Filter as needed based on parent process, application.
references:
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
tags:
  analytic_story:
  - DHS Report TA18-074A
  - NOBELIUM Group
  - Windows Persistence Techniques
  - Living Off The Land
  asset_type: Endpoint
  cis20:
  - CIS 3
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1053.005/atomic_red_team/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Actions on Objectives
  message: A schedule task process $process_name$ with create or delete commandline
    $process$ in host $dest$
  mitre_attack_id:
  - T1053.005
  - T1053
  nist:
  - PR.IP
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.parent_process
  - Processes.process_name
  - Processes.user
  - Processes.parent_process_name
  - Processes.dest
  risk_score: 56
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
