author: Bhavin Patel, Splunk
datamodel:
- Endpoint
date: '2020-12-07'
description: This search looks for flags passed to schtasks.exe on the command-line
  that indicate that a forced reboot of system is scheduled.
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
id: 1297fb80-f42a-4b4a-9c8a-88c066437cf6
known_false_positives: Administrators may create jobs on systems forcing reboots to
  perform updates, maintenance, etc.
name: Schtasks used for forcing a reboot
references: []
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process_name=schtasks.exe Processes.process="*shutdown*" Processes.process="*/create
  *" by Processes.process_name Processes.parent_process_name Processes.dest Processes.user
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `schtasks_used_for_forcing_a_reboot_filter`'
tags:
  analytic_story:
  - Windows Persistence Techniques
  - Ransomware
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 3
  confidence: 80
  context:
  - source:endpoint
  - stage: Execution
  - Persistence
  - Privilege Escalation
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1053.005/schtask_shutdown/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Actions on Objectives
  message: A schedule task process $process_name$ with force reboot commandline $process$
    in host $dest$
  mitre_attack_id:
  - T1053.005
  - T1053
  nist:
  - PR.IP
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: user
    role:
    - Victim
    type: user
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 56
  security_domain: endpoint
type: TTP
version: 4
