name: Schtasks scheduling job on remote system
id: 1297fb80-f42a-4b4a-9c8a-88c066237cf6
version: 7
date: '2024-05-14'
author: David Dorsey, Mauricio Velazco, Splunk
status: production
type: TTP
description: The following analytic detects the use of 'schtasks.exe' to create a
  scheduled task on a remote system, indicating potential lateral movement or remote
  code execution. It leverages process data from Endpoint Detection and Response (EDR)
  agents, focusing on specific command-line arguments and flags. This activity is
  significant as it may signify an adversary's attempt to persist or execute code
  remotely. If confirmed malicious, this could allow attackers to maintain access,
  execute arbitrary commands, or further infiltrate the network, posing a severe security
  risk.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name = schtasks.exe
  OR Processes.original_file_name=schtasks.exe) (Processes.process="*/create*" AND
  Processes.process="*/s*") by Processes.process_name Processes.process Processes.parent_process_name
  Processes.dest Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `schtasks_scheduling_job_on_remote_system_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: While it is possible to have false positives, due to legitimate
  administrative tasks, these are usually limited and should still be validated and
  investigated as appropriate.
references: []
tags:
  analytic_story:
  - Active Directory Lateral Movement
  - NOBELIUM Group
  - Living Off The Land
  - Prestige Ransomware
  - Scheduled Tasks
  - RedLine Stealer
  - Phemedrone Stealer
  asset_type: Endpoint
  confidence: 90
  impact: 70
  message: A schedule task process $process_name$ with remote job command-line $process$
    in host $dest$ by $user$.
  mitre_attack_id:
  - T1053.005
  - T1053
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_name
  - Processes.process
  - Processes.parent_process_name
  - Processes.dest
  - Processes.user
  risk_score: 63
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1053.005/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
