name: Schtasks Run Task On Demand
id: bb37061e-af1f-11eb-a159-acde48001122
version: 1
date: '2021-05-07'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: This analytic identifies an on demand run of a Windows Schedule Task
  through shell or command-line. This technique has been used by adversaries that
  force to run their created Schedule Task as their persistence mechanism or for lateral
  movement as part of their malicious attack to the compromised machine.
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  values(Processes.process_id) as process_id count min(_time) as firstTime max(_time)
  as lastTime  from datamodel=Endpoint.Processes where Processes.process_name = "schtasks.exe"
  Processes.process = "*/run*" by Processes.process_name Processes.parent_process_name
  Processes.dest Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `schtasks_run_task_on_demand_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. Tune and filter known instances where renamed schtasks.exe may be used.
known_false_positives: Administrators may use to debug Schedule Task entries. Filter
  as needed.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
tags:
  analytic_story:
  - XMRig
  automated_detection_testing: passed
  confidence: 80
  context:
  - source:endpoint
  - stage: Execution
  - Persistence
  - Privilege Escalation
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/xmrig_miner/windows-sysmon.log
  impact: 60
  kill_chain_phases:
  - Exploitation
  message: A "on demand" execution of schedule task process $process_name$  using
    commandline $process$ in host $dest$
  mitre_attack_id:
  - T1053
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: user
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.process_id
  - Processes.process_name
  - Processes.parent_process_name
  - Processes.dest
  - Processes.user
  risk_score: 48
  security_domain: endpoint
