name: Schtasks scheduling job on remote system
id: 1297fb80-f42a-4b4a-9c8a-88c066237cf6
version: 4
date: '2020-07-21'
description: This search looks for flags passed to schtasks.exe on the command-line
  that indicate a job is being scheduled on a remote system.
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
type: batch
references: []
author: David Dorsey, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name = schtasks.exe
  Processes.process="*/create*" (Processes.process="* /s *" OR Processes.process="*
  /S *") by Processes.process_name Processes.process Processes.parent_process_name
  Processes.dest Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `schtasks_scheduling_job_on_remote_system_filter`'
known_false_positives: Administrators may create jobs on remote systems, but this
  activity is usually limited to a small set of hosts or users. It is important to
  validate and investigate as appropriate.
tags:
  analytics_story:
  - Lateral Movement
  - Sunburst Malware
  mitre_attack_id:
  - T1053.005
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 3
  nist:
  - PR.IP
  security_domain: endpoint
  asset_type: Endpoint
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1053.005/atomic_red_team/windows-sysmon.log
