name: Schtasks scheduling job on remote system
id: 1297fb80-f42a-4b4a-9c8a-88c066237cf6
version: 5
date: '2021-11-11'
author: David Dorsey, Mauricio Velazco, Splunk
type: TTP
datamodel:
- Endpoint
description: This analytic looks for the execution of `schtasks.exe` with command-line
  arguments utilized to create a Scheduled Task on a remote endpoint. Red Teams and
  adversaries alike may abuse the Task Scheduler for lateral movement and remote code
  execution.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process_name = schtasks.exe
  OR Processes.original_file_name=schtasks.exe) (Processes.process="*/create*" AND
  Processes.process="*/s*") by Processes.process_name Processes.process Processes.parent_process_name
  Processes.dest Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `schtasks_scheduling_job_on_remote_system_filter`'
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
known_false_positives: Administrators may create scheduled tasks on remote systems,
  but this activity is usually limited to a small set of hosts or users. It is important
  to validate and investigate as appropriate.
references: []
tags:
  analytic_story:
  - Active Directory Lateral Movement
  - NOBELIUM Group
  - Living Off The Land
  asset_type: Endpoint
  cis20:
  - CIS 3
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1053.005/atomic_red_team/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Actions on Objectives
  message: A schedule task process $process_name$ with remote job commandline $process$
    in host $dest$
  mitre_attack_id:
  - T1053.005
  - T1053
  nist:
  - PR.IP
  observable:
  - name: Processes.dest
    type: Hostname
    role:
    - Victim
  - name: Processes.user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_name
  - Processes.process
  - Processes.parent_process_name
  - Processes.dest
  - Processes.user
  risk_score: 63
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
