author: Teoderick Contreras, Splunk
datamodel:
- Endpoint
date: '2021-09-27'
description: This analytic is developed to detect possible event trigger execution
  through screensaver registry entry modification for persistence or privilege escalation.
  This technique was seen in several APT and malware where they put the malicious
  payload path to the SCRNSAVE.EXE registry key to redirect the execution to their
  malicious payload path. This TTP is a good indicator that some attacker may modify
  this entry for their persistence and privilege escalation.
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
id: 58cea3ec-1f6d-11ec-8560-acde48001122
known_false_positives: unknown
name: Screensaver Event Trigger Execution
references:
- https://attack.mitre.org/techniques/T1546/002/
- https://dmcxblue.gitbook.io/red-team-notes-2-0/red-team-techniques/privilege-escalation/untitled-3/screensaver
search: '| tstats `security_content_summariesonly` count  min(_time) as firstTime
  max(_time) as lastTime FROM datamodel=Endpoint.Registry where (Registry.registry_path="*\\Control
  Panel\\Desktop\\SCRNSAVE.EXE*") by Registry.dest Registry.user Registry.registry_path
  Registry.registry_key_name Registry.registry_value_name | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)` | `drop_dm_object_name(Registry)` | `screensaver_event_trigger_execution_filter`'
tags:
  analytic_story:
  - Windows Persistence Techniques
  - Windows Privilege Escalation
  automated_detection_testing: passed
  confidence: 90
  context:
  - source:endpoint
  - stage:Privilege Escalation Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1546.002/scrnsave_reg/sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: modified/added/deleted registry entry $Registry.registry_path$ in $dest$
  mitre_attack_id:
  - T1546
  - T1546.002
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: user
    role:
    - Victim
    type: user
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Registry.dest
  - Endpoint.Registry.registry_key_name
  - Endpoint.Registry.registry_path
  - Endpoint.Registry.registry_value_name
  - Endpoint.Registry.user
  - _time
  risk_score: 72
  security_domain: endpoint
type: TTP
version: 1
