name: Script Execution via WMI
id: aa73f80d-d728-4077-b226-81ea0c8be589
version: 3
date: '2020-03-16'
description: This search looks for scripts launched via WMI.
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model.
type: ESCU
references: []
author: Rico Valdez, Splunk
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  as process min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
  where Processes.process_name = "scrcons.exe" by Processes.user Processes.dest Processes.process_name  |
  `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`|
  `script_execution_via_wmi_filter` '
known_false_positives: Although unlikely, administrators may use wmi to launch scripts
  for legitimate purposes.
tags:
  analytics_story:
  - Suspicious WMI Use
  mitre_attack_id:
  - T1047
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 3
  - CIS 5
  nist:
  - PR.PT
  - PR.AT
  - PR.AC
  - PR.IP
  security_domain: endpoint
  asset_type: Endpoint
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1047/execution_scrcons/windows-sysmon.log
