name: Sdclt UAC Bypass
id: d71efbf6-da63-11eb-8c6e-acde48001122
version: 2
date: '2020-01-28'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This search is to detect a suspicious sdclt.exe registry modification.
  This technique is commonly seen when attacker try to bypassed UAC by using sdclt.exe
  application by modifying some registry that sdclt.exe tries to open or query with
  payload file path on it to be executed.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Registry where (Registry.registry_path= "*\\Windows\\CurrentVersion\\App
  Paths\\control.exe*" OR Registry.registry_path= "*\\exefile\\shell\\runas\\command\\*")
  (Registry.registry_value_name = "(Default)" OR Registry.registry_value_name = "IsolatedCommand")
  by _time span=1h Registry.dest Registry.user Registry.registry_path Registry.registry_value_name
  Registry.process_guid Registry.registry_key_name Registry.registry_value_data |
  `drop_dm_object_name(Registry)` |rename process_guid as proc_guid |join proc_guid,
  _time [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  by _time span=1h Processes.process_id Processes.process_name Processes.process Processes.dest
  Processes.parent_process_name Processes.parent_process Processes.process_guid |
  `drop_dm_object_name(Processes)` |rename process_guid as proc_guid | fields _time
  dest user parent_process_name parent_process process_name process_path process proc_guid
  registry_path registry_value_name registry_value_data registry_key_name] | table
  _time dest user parent_process_name parent_process process_name process_path process
  proc_guid registry_path registry_value_name registry_value_data registry_key_name
  | `sdclt_uac_bypass_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Limited to no false positives are expected.
references:
- https://enigma0x3.net/2017/03/17/fileless-uac-bypass-using-sdclt-exe/
- https://github.com/hfiref0x/UACME
- https://www.cyborgsecurity.com/cyborg_labs/threat-hunt-deep-dives-user-account-control-bypass-via-registry-modification/
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Windows Registry Abuse
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Persistence
  - Stage:Privilege Escalation
  - Stage:Defense Evasion
  - Scope:Inbound
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548/uac_bypass/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: Suspicious modification of registry $registry_path$ with possible payload
    path $registry_value_name$ in $dest$
  mitre_attack_id:
  - T1548.002
  - T1548
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.registry_value_name
  - Registry.dest
  risk_score: 63
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
