name: SearchProtocolHost with no Command Line with Network
id: b690df8c-a145-11eb-a38b-acde48001122
version: 1
date: '2021-04-19'
author: Michael Haag, Splunk
type: batch
datamodel:
- Endpoint
description: The following analytic identifies searchprotocolhost.exe with no command
  line arguments and with a network connection. It is unusual for searchprotocolhost.exe
  to execute with no command line arguments present. This particular behavior is common
  with malicious software, including Cobalt Strike. During investigation, identify
  any network connections and parallel processes. Identify any suspicious module loads
  related to credential dumping or file writes. searchprotocolhost.exe is natively
  found in C:\Windows\system32 and C:\Windows\syswow64.
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where Processes.process_name=searchprotocolhost.exe by _time span=1h  Processes.process_id
  Processes.process_name Processes.dest Processes.process_path Processes.process Processes.parent_process_name
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | regex process="(searchprotocolhost\.exe.{0,4}$)" | join  process_id [| tstats
  `security_content_summariesonly` count FROM datamodel=Endpoint.Ports where Ports.dest_port
  !="0" by Ports.process_id Ports.dest Ports.dest_port | `drop_dm_object_name(Ports)`
  | rename  dest as connection_to_CNC] | table _time dest parent_process_name process_name
  process_path process process_id connection_to_CNC dest_port | `searchprotocolhost_with_no_command_line_with_network_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` and `ports` node.
known_false_positives: Limited false positives may be present in small environments.
  Tuning may be required based on parent process.
references:
- https://github.com/fireeye/red_team_tool_countermeasures/blob/master/rules/PGF/supplemental/hxioc/SUSPICIOUS%20EXECUTION%20OF%20SEARCHPROTOCOLHOST%20(METHODOLOGY).ioc
tags:
  analytic_story:
  - Cobalt Strike
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1055/cobalt_strike/windows-sysmon_searchprotocolhost.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1055
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - process_name
  - process_id
  - parent_process_name
  - dest_port
  - process_path
  security_domain: endpoint
  impact: 70 
  confidence: 100  
  # (impact * confidence)/100
  risk_score: 70 
  context:
  - source:endpoint
  - stage: Defense Evasion
  - Privilege Escalation
  message: A searchprotocolhost.exe process $process_name$ with no commandline in host $dest$ 
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: processname
    role:
    - Attacker
