name: SearchProtocolHost with no Command Line with Network
id: b690df8c-a145-11eb-a38b-acde48001122
version: 3
date: '2022-03-15'
author: Michael Haag, Splunk
type: TTP
datamodel:
- Endpoint
description: The following analytic identifies searchprotocolhost.exe with no command
  line arguments and with a network connection. It is unusual for searchprotocolhost.exe
  to execute with no command line arguments present. This particular behavior is common
  with malicious software, including Cobalt Strike. During investigation, identify
  any network connections and parallel processes. Identify any suspicious module loads
  related to credential dumping or file writes. searchprotocolhost.exe is natively
  found in C:\Windows\system32 and C:\Windows\syswow64.
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where Processes.process_name=searchprotocolhost.exe by _time span=1h  Processes.process_id
  Processes.process_name Processes.dest Processes.process_path Processes.process Processes.parent_process_name
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | regex process="(?i)(searchprotocolhost\.exe.{0,4}$)" | join  process_id [| tstats `security_content_summariesonly`
  count FROM datamodel=Network_Traffic.All_Traffic where All_Traffic.dest_port != 0 by All_Traffic.process_id
  All_Traffic.dest All_Traffic.dest_port | `drop_dm_object_name(All_Traffic)` | rename dest as C2 ]
  | table _time dest parent_process_name process_name process_path process process_id dest_port C2 
  | `searchprotocolhost_with_no_command_line_with_network_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` and `ports` node.
known_false_positives: Limited false positives may be present in small environments.
  Tuning may be required based on parent process.
references:
- https://github.com/fireeye/red_team_tool_countermeasures/blob/master/rules/PGF/supplemental/hxioc/SUSPICIOUS%20EXECUTION%20OF%20SEARCHPROTOCOLHOST%20(METHODOLOGY).ioc
tags:
  analytic_story:
  - Cobalt Strike
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1055/cobalt_strike/windows-sysmon_searchprotocolhost.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: A searchprotocolhost.exe process $process_name$ with no commandline in
    host $dest$
  mitre_attack_id:
  - T1055
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: Process Name
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - process_name
  - process_id
  - parent_process_name
  - dest_port
  - process_path
  risk_score: 70
  security_domain: endpoint
  asset_type: Endpoint
