name: SecretDumps Offline NTDS Dumping Tool
id: 5672819c-be09-11eb-bbfb-acde48001122
version: 1
date: '2021-05-26'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: This analytic detects a potential usage of secretsdump.py tool for dumping
  credentials (ntlm hash) from a copy of ntds.dit and SAM.Security,SYSTEM registrry
  hive. This technique was seen in some attacker that dump ntlm hashes offline after
  having a copy of ntds.dit and SAM/SYSTEM/SECURITY registry hive.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name = "python*.exe"
  Processes.process = "*.py*" Processes.process = "*-ntds*" (Processes.process = "*-system*"
  OR Processes.process = "*-sam*" OR Processes.process = "*-security*" OR Processes.process
  = "*-bootkey*") by Processes.process_name Processes.process Processes.parent_process_name
  Processes.parent_process Processes.dest Processes.user Processes.process_id Processes.process_guid
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `secretdumps_offline_ntds_dumping_tool_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: unknown
references:
- https://github.com/SecureAuthCorp/impacket/blob/master/examples/secretsdump.py
tags:
  analytic_story:
  - Credential Dumping
  automated_detection_testing: passed
  confidence: 100
  context:
  - source:endpoint
  - stage: Credential Access
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/honeypots/casper/datasets1/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: A secretdump process $process_name$ with secretdump commandline $process$
    to dump credentials in host $dest$
  mitre_attack_id:
  - T1003.003
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: user
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_name
  - Processes.process
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.dest
  - Processes.user
  - Processes.process_id
  - Processes.process_guid
  risk_score: 80
  security_domain: endpoint
