name: Services Escalate Exe
id: c448488c-b7ec-11eb-8253-acde48001122
version: 2
date: '2023-11-07'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic identifies the use of `svc-exe` with Cobalt Strike.
  The behavior typically follows after an adversary has already gained initial access
  and is escalating privileges. Using `svc-exe`, a randomly named binary will be downloaded
  from the remote Teamserver and placed on disk within `C:\Windows\400619a.exe`. Following,
  the binary will be added to the registry under key `HKLM\System\CurrentControlSet\Services\400619a\`
  with multiple keys and values added to look like a legitimate service. Upon loading,
  `services.exe` will spawn the randomly named binary from `\\127.0.0.1\ADMIN$\400619a.exe`.
  The process lineage is completed with `400619a.exe` spawning rundll32.exe, which
  is the default `spawnto_` value for Cobalt Strike. The `spawnto_` value is arbitrary
  and may be any process on disk (typically system32/syswow64 binary). The `spawnto_`
  process will also contain a network connection. During triage, review parallel procesess
  and identify any additional file modifications.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=services.exe
  Processes.process_path=*admin$* by Processes.process_path Processes.dest Processes.user Processes.parent_process_name Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `services_escalate_exe_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: False positives should be limited as `services.exe` should
  never spawn a process from `ADMIN$`. Filter as needed.
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://attack.mitre.org/techniques/T1548/
- https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/index.htm#cshid=1085
tags:
  analytic_story:
  - BlackByte Ransomware
  - Cobalt Strike
  - Graceful Wipe Out Attack
  asset_type: Endpoint
  confidence: 95
  impact: 80
  message: A service process $parent_process_name$ with process path $process_path$
    in host $dest$
  mitre_attack_id:
  - T1548
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 76
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1055/cobalt_strike/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
