name: Set Default PowerShell Execution Policy To Unrestricted or Bypass
id: c2590137-0b08-4985-9ec5-6ae23d92f63d
version: 7
date: '2022-02-18'
author: Patrick Bareiss, Splunk
type: TTP
datamodel:
- Endpoint
description: Monitor for changes of the ExecutionPolicy in the registry to the values
  "unrestricted" or "bypass," which allows the execution of malicious scripts.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Registry where Registry.registry_path=*Software\\Microsoft\\Powershell\\1\\ShellIds\\Microsoft.PowerShell*
  Registry.registry_value_name=ExecutionPolicy (Registry.registry_value_data=Unrestricted
  OR Registry.registry_value_data=Bypass) by Registry.registry_path Registry.registry_value_name
  Registry.registry_value_data Registry.dest | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `set_default_powershell_execution_policy_to_unrestricted_or_bypass_filter`'
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Registry node. You must also be
  ingesting logs with the fields registry_path, registry_key_name, and registry_value_name
  from your endpoints.
known_false_positives: Administrators may attempt to change the default execution
  policy on a system for a variety of reasons. However, setting the policy to "unrestricted"
  or "bypass" as this search is designed to identify, would be unusual. Hits should
  be reviewed and investigated as appropriate.
references: []
tags:
  analytic_story:
  - Hermetic Wiper 
  - Malicious PowerShell
  - Credential Dumping
  - HAFNIUM Group
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 8
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.001/powershell_execution_policy/windows-sysmon.log
  impact: 60
  kill_chain_phases:
  - Installation
  - Actions on Objectives
  message: A registry modification in $registry_path$ with reg key $registry_key_name$
    and reg value $registry_value_name$ in host $dest$
  mitre_attack_id:
  - T1059
  - T1059.001
  nist:
  - DE.CM
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: registry_path
    type: Unknown
    role:
    - Other
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.registry_value_name
  - Registry.dest
  risk_score: 48
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
