name: Single Letter Process On Endpoint
id: a4214f0b-e01c-41bc-8cc4-d2b71e3056b4
version: 3
date: '2020-12-08'
author: David Dorsey, Splunk
type: batch
datamodel:
- Endpoint
description: This search looks for process names that consist only of a single letter.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes by Processes.dest, Processes.user,
  Processes.process, Processes.process_name | `drop_dm_object_name(Processes)` | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)` | eval process_name_length = len(process_name),
  endExe = if(substr(process_name, -4) == ".exe", 1, 0) | search process_name_length=5
  AND endExe=1 | table count, firstTime, lastTime, dest, user, process, process_name
  | `single_letter_process_on_endpoint_filter`'
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
known_false_positives: Single-letter executables are not always malicious. Investigate
  this activity with your normal incident-response process.
references: []
tags:
  analytic_story:
  - DHS Report TA18-074A
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 2
  confidence: 90
  context:
  - source:endpoint
  - stage: Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1204.002/single_letter_exe/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Actions on Objectives
  message: A suspicious process $process_name$ with single letter in host $dest$
  mitre_attack_id:
  - T1204.002
  nist:
  - ID.AM
  - PR.DS
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: user
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.process
  - Processes.process_name
  risk_score: 63
  security_domain: endpoint
