name: SLUI RunAs Elevated
id: 8d124810-b3e4-11eb-96c7-acde48001122
version: 1
date: '2021-05-13'
author: Michael Haag, Splunk
type: batch
datamodel:
- Endpoint
description: The following analytic identifies the Microsoft Software Licensing User
  Interface Tool, `slui.exe`, elevating access using the `-verb runas` function. This
  particular bypass utilizes a registry key/value. Identified by two sources, the
  registry keys are `HKCU\Software\Classes\exefile\shell` and `HKCU\Software\Classes\launcher.Systemsettings\Shell\open\command`.
  To simulate this behavior, multiple POC are available. The analytic identifies the
  use of `runas` by `slui.exe`.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=slui.exe
  (Processes.process=*-verb* Processes.process=*runas*) by Processes.dest Processes.user
  Processes.parent_process Processes.process_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `slui_runas_elevated_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Limited false positives should be present as this is not commonly
  used by legitimate applications.
references:
- https://www.exploit-db.com/exploits/46998
- https://medium.com/@mattharr0ey/privilege-escalation-uac-bypass-in-changepk-c40b92818d1b
- https://gist.github.com/r00t-3xp10it/0c92cd554d3156fd74f6c25660ccc466
- https://www.rapid7.com/db/modules/exploit/windows/local/bypassuac_sluihijack/
- https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html
tags:
  analytic_story:
  - DarkSide Ransomware
  - Windows Defense Evasion Tactics
  automated_detection_testing: passed
  confidence: 90
  context:
  - source:endpoint
  - stage: Privilege Escalation
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548.002/slui/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: A slui process $process_name$ with elevated commandline $process$ in host
    $dest$
  mitre_attack_id:
  - T1548.002
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 63
  security_domain: endpoint
