name: Spoolsv Spawning Rundll32
id: 15d905f6-da6b-11eb-ab82-acde48001122
version: 2
date: '2021-07-01'
author: Mauricio Velazco, Michael Haag, Splunk
status: production
type: TTP
description: The following analytic identifies a suspicious child process, `rundll32.exe`,
  with no command-line arguments being spawned from `spoolsv.exe`. This was identified
  during our testing of CVE-2021-34527 previously (CVE-2021-1675) or PrintNightmare.
  Typically, this is not normal behavior for `spoolsv.exe` to spawn a process. During
  triage, isolate the endpoint and review for source of exploitation. Capture any
  additional file modification events.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=spoolsv.exe
  `process_rundll32` by Processes.dest Processes.user Processes.parent_process Processes.original_file_name
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `spoolsv_spawning_rundll32_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: Limited false positives have been identified. There are limited
  instances where `rundll32.exe` may be spawned by a legitimate print driver.
references:
- https://www.truesec.com/hub/blog/fix-for-printnightmare-cve-2021-1675-exploit-to-keep-your-print-servers-running-while-a-patch-is-not-available
- https://www.truesec.com/hub/blog/exploitable-critical-rce-vulnerability-allows-regular-users-to-fully-compromise-active-directory-printnightmare-cve-2021-1675
- https://www.reddit.com/r/msp/comments/ob6y02/critical_vulnerability_printnightmare_exposes
tags:
  analytic_story:
  - PrintNightmare CVE-2021-34527
  asset_type: Endpoint
  confidence: 90
  cve:
  - CVE-2021-34527
  impact: 80
  message: $parent_process$ has spawned $process_name$ on endpoint $ComputerName$.
    This behavior is suspicious and related to PrintNightmare.
  mitre_attack_id:
  - T1547.012
  - T1547
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: parent_process_id
    type: Process
    role:
    - Parent Process
    - Attacker
  - name: process_id
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 72
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1547.012/printnightmare/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
