name: Spoolsv Spawning Rundll32
id: 15d905f6-da6b-11eb-ab82-acde48001122
version: 1
date: '2021-07-01'
author: Mauricio Velazco, Michael Haag, Splunk
type: batch
datamodel:
- Endpoint
description: The following analytic identifies a suspicious child process, `rundll32.exe`,
  with no command-line arguments being spawned from `spoolsv.exe`. This was identified
  during our testing of CVE-2021-1675 or PrintNightmare. Typically, this is not normal
  behavior for `spoolsv.exe` to spawn a process. During triage, isolate the endpoint
  and review for source of exploitation. Capture any additional file modification
  events.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=spoolsv.exe
  Processes.process_name=rundll32.exe by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `spoolsv_spawning_rundll32_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Limited false positives have been identified. There are limited
  instances where `rundll32.exe` may be spawned by a legitimate print driver.
references:
- https://blog.truesec.com/2021/06/30/fix-for-printnightmare-cve-2021-1675-exploit-to-keep-your-print-servers-running-while-a-patch-is-not-available/
- https://blog.truesec.com/2021/06/30/exploitable-critical-rce-vulnerability-allows-regular-users-to-fully-compromise-active-directory-printnightmare-cve-2021-1675/
- https://www.reddit.com/r/msp/comments/ob6y02/critical_vulnerability_printnightmare_exposes
tags:
  analytic_story:
  - PrintNightmare CVE-2021-1675
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1547.012/printnightmare/windows-sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1547.012
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  security_domain: endpoint
  impact: 80
  confidence: 90
  risk_score: 72
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  - Stage:Defense Evasion
  - Scope:Local
  message: $parent_process$ has spawned $process_name$ on endpoint $ComputerName$.
    This behavior is suspicious and related to PrintNightmare.
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: parent_process_id
    type: Process
    role:
    - Parent Process
    - Attacker
  - name: process_id
    type: Process
    role:
    - Child Process
  automated_detection_testing: passed