name: Start Up During Safe Mode Boot
id: c6149154-c9d8-11eb-9da7-acde48001122
version: 2
date: '2022-01-26'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This search is to detect a modification or registry add to the safeboot
  registry as an autostart mechanism. This technique was seen in some ransomware to
  automatically execute its code upon a safe mode boot.
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  where Registry.registry_path="*\\System\\CurrentControlSet\\Control\\SafeBoot\\Minimal\*"
  by _time span=1h Registry.dest Registry.user Registry.registry_path Registry.registry_value_name
  Registry.registry_value_data Registry.process_guid | `drop_dm_object_name(Registry)`
  |rename process_guid as proc_guid |join proc_guid, _time [| tstats `security_content_summariesonly`
  count FROM datamodel=Endpoint.Processes by _time span=1h Processes.process_id Processes.process_name
  Processes.process Processes.dest Processes.parent_process_name Processes.parent_process
  Processes.process_guid | `drop_dm_object_name(Processes)` |rename process_guid as
  proc_guid | fields _time dest user parent_process_name parent_process process_name
  process_path process proc_guid registry_path registry_value_name registry_value_data]
  | table _time dest user parent_process_name parent_process process_name process_path
  process proc_guid registry_path registry_value_name registry_value_data | `start_up_during_safe_mode_boot_filter`'
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
known_false_positives: updated windows application needed in safe boot may used this
  registry
references:
- https://malware.news/t/threat-analysis-unit-tau-threat-intelligence-notification-snatch-ransomware/36365
tags:
  analytic_story:
  - Ransomware
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/ransomware_ttp/data1/windows-sysmon.log
  impact: 60
  kill_chain_phases:
  - Exploitation
  message: Safeboot registry $registry_path$ was added or modified with a new value
    $registry_value_name$ on $dest$
  mitre_attack_id:
  - T1547.001
  - T1547
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.registry_value_name
  - Registry.dest
  risk_score: 42
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
