name: Suspicious Reg exe Process
id: a6b3ab4e-dd77-4213-95fa-fc94701995e0
version: 5
date: '2024-05-19'
author: David Dorsey, Splunk
status: production
type: Anomaly
description: The following analytic identifies instances of reg.exe being launched
  from a command prompt (cmd.exe) that was not initiated by the user, as indicated
  by a parent process other than explorer.exe. This detection leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process and parent process
  names. This activity is significant because reg.exe is often used in registry manipulation,
  which can be indicative of malicious behavior such as persistence mechanisms or
  system configuration changes. If confirmed malicious, this could allow an attacker
  to modify critical system settings, potentially leading to privilege escalation
  or persistent access.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Processes where Processes.parent_process_name
  != explorer.exe Processes.process_name =cmd.exe by Processes.user Processes.process_name
  Processes.parent_process_name Processes.dest Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | search [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where Processes.parent_process_name=cmd.exe Processes.process_name= reg.exe by Processes.parent_process_id
  Processes.dest Processes.process_name | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | rename parent_process_id as process_id |dedup
  process_id| table process_id dest] | `suspicious_reg_exe_process_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: It's possible for system administrators to write scripts that
  exhibit this behavior. If this is the case, the search will need to be modified
  to filter them out.
references:
- https://car.mitre.org/wiki/CAR-2013-03-001/
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Disabling Security Tools
  - DHS Report TA18-074A
  asset_type: Endpoint
  confidence: 50
  impact: 70
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ attempting to add a registry entry.
  mitre_attack_id:
  - T1112
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.parent_process_name
  - Processes.process_name
  - Processes.user
  - Processes.parent_process_name
  - Processes.dest
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 35
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1112/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
