name: Suspicious Event Log Service Behavior
id: 2b85aa3d-f5f6-4c2e-a081-a09f6e1c2e40
version: 1
date: '2021-06-17'
author: Mauricio Velazco, Splunk
type: batch
datamodel: []
description: This search looks for Windows events that indicate the event logging service has been shut down.
search: '(`wineventlog_security` EventCode=1100) | stats count min(_time) as firstTime max(_time) as lastTime by EventCode, dest 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)`
  | `suspicious_event_log_service_behavior_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  Windows event logs from your hosts.
known_false_positives: It is possible the Event Logging service gets shut down due to system errors or legitimately administration tasks.
references: []
tags:
  analytic_story:
  - Windows Log Manipulation
  - Ransomware
  - Clop Ransomware
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 6
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1070.001/atomic_red_team/windows-security.log
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1070.001/atomic_red_team/windows-system.log
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1070.001
  nist:
  - DE.DP
  - PR.IP
  - PR.AC
  - PR.AT
  - DE.AE
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - dest
  security_domain: endpoint
