name: Suspiciously named executable
id: 02127a66-8ed9-11ec-9511-acde48001122
version: 1
date: '2022-02-15'
author: Kumar Sharad, Splunk and Michael Hart, Splunk
type: Anomaly
datamodel:
- Endpoint
description: A compelling description
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from
  datamodel=Endpoint.Processes where Processes.process_path = "*\\Windows\\*" by Processes.parent_process_name
  Processes.process_name Processes.process Processes.user  Processes.dest | `drop_dm_object_name(Processes)` |
  where match(process_name, "\w+.exe") and len(process_name) >= 12 | eval lm_input=lower(replace(process_name, ".exe$", ""))
  | apply tfidf_lm_vectorizer | apply lm_lr | eval score=''predicted(avg_char_prob)'' | where score > -0.15 | fields - lm_input_tfidf*
  lm_input avg_char_prob predicted* | `suspiciously_named_executable_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.  You will also need to install the Machine Learning Toolkit version 5.3
  or above to apply the pretrained models.
known_false_positives: This model is an anomaly detector that identifies usage of
  randomization in the creation of an executable in an unusual place.  It is possible that
  a legitimate process will create an executable with a randomized name for some temporary
  execution.
references:
- https://www.cisa.gov/uscert/ncas/alerts/aa20-302a
- https://www.splunk.com/en_us/blog/security/random-words-on-entropy-and-dns.html
tags:
  analytic_story:
  - Suspicious Command-Line Executions
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059/suspiciously_named_executables/windows-sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1059
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  security_domain: endpoint
  impact: 60
  confidence: 20
  risk_score: 12
  context:
  - source:endpoint
  - stage:Execution
  message: A sensible message
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
