name: Suspicious microsoft workflow compiler usage
id: 9bbc62e8-55d8-11eb-ae93-0242ac130002
version: 2
date: '2021-01-12'
author: Michael Haag, Splunk
type: TTP
datamodel:
- Endpoint
description: The following analytic identifies microsoft.workflow.compiler.exe usage.
  microsoft.workflow.compiler.exe is natively found in C:\Windows\Microsoft.NET\Framework64\v4.0.30319
  and is rarely utilized. When investigating, identify the executed code on disk and
  review. It is not a commonly used process by many applications.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_microsoftworkflowcompiler`
  by Processes.dest Processes.parent_process Processes.process_name Processes.original_file_name
  Processes.process Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `suspicious_microsoft_workflow_compiler_usage_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: Although unlikely, limited instances have been identified coming
  from native Microsoft utilities similar to SCCM.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Msbuild/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md#atomic-test-6---microsoftworkflowcompilerexe-payload-execution
tags:
  analytic_story:
  - Trusted Developer Utilities Proxy Execution
  - Living Off The Land
  asset_type: Endpoint
  cis20:
  - CIS 8
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1127/atomic_red_team/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: Suspicious microsoft.workflow.compiler.exe process ran on $dest$ by $user$
  mitre_attack_id:
  - T1127
  nist:
  - PR.PT
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Endpoint
  - name: User
    role:
    - Victim
    type: User
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.original_file_name
  - Endpoint.Processes.parent_process
  - Endpoint.Processes.process
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 35
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
