name: Suspicious wevtutil Usage
id: 2827c0fd-e1be-4868-ae25-59d28e0f9d4f
version: 3
date: '2020-07-22'
description: The wevtutil.exe application is the windows event log utility. This searches
  for wevtutil.exe with parameters for clearing the application, security, setup,
  or system event logs.
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model.
type: ESCU
references: []
author: David Dorsey, Splunk
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where Processes.process_name = wevtutil.exe Processes.process="*cl*" (Processes.process="*System*"
  OR Processes.process="*Security*" OR Processes.process="*Setup*" OR Processes.process="*Application*")
  by Processes.process_name Processes.parent_process_name Processes.dest Processes.user|
  `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` |`security_content_ctime(lastTime)`
  | `suspicious_wevtutil_usage_filter`'
known_false_positives: The wevtutil.exe application is a legitimate Windows event
  log utility. Administrators may use it to manage Windows event logs.
tags:
  analytics_story:
  - Windows Log Manipulation
  - Ransomware
  mitre_attack_id:
  - T1070.001
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 3
  - CIS 5
  - CIS 6
  nist:
  - DE.DP
  - PR.IP
  - PR.PT
  - PR.AC
  - PR.AT
  - DE.AE
  security_domain: endpoint
  asset_type: ''
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1070.001/atomic_red_team/windows-sysmon.log
