name: Suspicious Regsvr32 Register Suspicious Path
id: 62732736-6250-11eb-ae93-0242ac130002
version: 1
date: '2021-01-28'
description: Adversaries may abuse Regsvr32.exe to proxy execution of malicious code
  by using non-standard file extensions to load malciious DLLs. Upon investigating,
  look for network connections to remote destinations (internal or external). Review
  additional parrallel processes and child processes for additional activity.
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints, to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model. Tune the query by filtering additional extensions
  found to be used by  legitimate processes.
type: ESCU
references:
- https://attack.mitre.org/techniques/T1218/010/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.010/T1218.010.md
- https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/
- https://support.microsoft.com/en-us/topic/how-to-use-the-regsvr32-tool-and-troubleshoot-regsvr32-error-messages-a98d960a-7392-e6fe-d90a-3f4e0cb543e5
- https://any.run/report/f29a7d2ecd3585e1e4208e44bcc7156ab5388725f1d29d03e7699da0d4598e7c/0826458b-5367-45cf-b841-c95a33a01718
author: Michael Haag, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=regsvr32.exe
  (Processes.process=*appdata* OR Processes.process=*programdata* OR Processes.process=*windows\temp*)
  (Processes.process!=*.dll Processes.process!=*.ax Processes.process!=*.ocx) by Processes.dest
  Processes.user Processes.parent_process Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` | `suspicious_regsvr32_register_suspicious_path_filter`'
known_false_positives: Limited false positives with the query restricted to specified
  paths. Add more world writeable paths as tuning continues.
tags:
  analytics_story:
  - Suspicious Regsvr32 Activity
  mitre_attack_id:
  - T1218.010
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 8
  - CIS 16
  nist:
  - DE.CM
  security_domain: endpoint
  asset_type: Endpoint
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.010/atomic_red_team/windows-sysmon.log
  automated_detection_testing: passed
