name: Suspicious MSBuild Rename
id: 4006adac-5937-11eb-ae93-0242ac130002
version: 4
date: '2023-11-07'
author: Michael Haag, Splunk
status: production
type: Hunting
description: The following analytic identifies renamed instances of msbuild.exe executing.
  Msbuild.exe is natively found in C:\Windows\Microsoft.NET\Framework\v4.0.30319 and
  C:\Windows\Microsoft.NET\Framework64\v4.0.30319. During investigation, identify
  the code executed and what is executing a renamed instance of MSBuild.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name!=msbuild.exe
  AND Processes.original_file_name=MSBuild.exe by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  Processes.original_file_name | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `suspicious_msbuild_rename_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Although unlikely, some legitimate applications may use a moved
  copy of msbuild, triggering a false positive.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Msbuild/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1127.001/T1127.001.md
- https://github.com/infosecn1nja/MaliciousMacroMSBuild/
tags:
  analytic_story:
  - Trusted Developer Utilities Proxy Execution MSBuild
  - Masquerading - Rename System Utilities
  - Living Off The Land
  - Cobalt Strike
  - BlackByte Ransomware
  - Graceful Wipe Out Attack
  asset_type: Endpoint
  confidence: 90
  impact: 70
  message: Suspicious renamed msbuild.exe binary ran on $dest$ by $user$
  mitre_attack_id:
  - T1036
  - T1127
  - T1036.003
  - T1127.001
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 63
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1127.001/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
