name: Suspicious WAV file in Appdata Folder
id: 5be109e6-1ac5-11ec-b421-acde48001122
version: 1
date: '2021-09-21'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This analytic is to detect a suspicious creation of .wav file in appdata
  folder. This behavior was seen in Remcos RAT malware where it put the audio recording
  in the appdata\audio folde as part of data collection. this recording can be send
  to its C2 server as part of its exfiltration to the compromised machine. creation
  of wav files in this folder path is not a ussual disk place used by user to save
  audio format file.
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where Processes.process_name=*.exe Processes.process_path="*\\appdata\\Roaming\\*"
  by _time span=1h Processes.process_id Processes.process_name Processes.process Processes.dest
  | `drop_dm_object_name(Processes)` | join process_guid, _time [| tstats `security_content_summariesonly`
  count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem
  where Filesystem.file_name IN ("*.wav") Filesystem.file_path = "*\\appdata\\Roaming\\*"
  by _time span=1h Filesystem.dest Filesystem.file_create_time Filesystem.file_name
  Filesystem.file_path | `drop_dm_object_name(Filesystem)` | fields file_name file_path
  process_name process_path process dest file_create_time _time ] | `suspicious_wav_file_in_appdata_folder_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, file_name, file_path and command-line
  executions from your endpoints. If you are using Sysmon, you must have at least
  version 6.0.4 of the Sysmon TA.
known_false_positives: unknown
references:
- https://success.trendmicro.com/solution/1123281-remcos-malware-information
- https://blog.malwarebytes.com/threat-intelligence/2021/07/remcos-rat-delivered-via-visual-basic/
tags:
  analytic_story:
  - Remcos
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Collection
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/remcos/remcos_agent/sysmon_wav.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: process $process_name$ creating image file $file_path$ in $dest$
  mitre_attack_id:
  - T1113
  observable:
  - name: Computer
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - dest
  - file_create_time
  - file_name
  - file_path
  - process_name
  - process_path
  - process
  risk_score: 49
  security_domain: endpoint
  asset_type: Endpoint
