name: Suspicious Rundll32 no Command Line Arguments
id: e451bd16-e4c5-4109-8eb1-c4c6ecf048b4
version: 3
date: '2023-07-10'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic identifies rundll32.exe with no command line arguments.
  It is unusual for rundll32.exe to execute with no command line arguments present.
  This particular behavior is common with malicious software, including Cobalt Strike.
  During investigation, identify any network connections and parallel processes. Identify
  any suspicious module loads related to credential dumping or file writes. Rundll32.exe
  is natively found in C:\Windows\system32 and C:\Windows\syswow64.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where `process_rundll32` by _time span=1h  Processes.process_id Processes.process_name
  Processes.dest Processes.user Processes.process_path Processes.process Processes.parent_process_name
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | regex process="(?i)(rundll32\.exe.{0,4}$)" | `suspicious_rundll32_no_command_line_arguments_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Although unlikely, some legitimate applications may use a moved
  copy of rundll32, triggering a false positive.
references:
- https://attack.mitre.org/techniques/T1218/011/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.011/T1218.011.md
- https://lolbas-project.github.io/lolbas/Binaries/Rundll32/
- https://bohops.com/2018/02/26/leveraging-inf-sct-fetch-execute-techniques-for-bypass-evasion-persistence/
tags:
  analytic_story:
  - Suspicious Rundll32 Activity
  - Cobalt Strike
  - BlackByte Ransomware
  - PrintNightmare CVE-2021-34527
  - Graceful Wipe Out Attack
  asset_type: Endpoint
  confidence: 70
  cve:
  - CVE-2021-34527
  impact: 70
  message: Suspicious rundll32.exe process with no command line arguments executed
    on $dest$ by $user$
  mitre_attack_id:
  - T1218
  - T1218.011
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.011/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
