name: Suspicious Regsvr32 Rename
id: 0b8e6e18-6259-11eb-ae93-0242ac130002
version: 1
date: '2021-01-29'
description: The following analytic identifies renamed instances of regsvr32.exe executing.
  regsvr32.exe is natively found in C:\Windows\system32 and
  C:\Windows\syswow64. During investigation, validate it is the legitimate regsvr32.exe
  executing and what content it is loading. 
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. Tune and filter known instances where renamed regsvr32.exe may be used. Review
  paths of the renamed instance.
type: ESCU
references:
- https://attack.mitre.org/techniques/T1218/010/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.010/T1218.010.md
- https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/
author: Michael Haag, Splunk
search: '`sysmon` EventID=1 OriginalFileName=REGSVR32.EXE NOT process_name=regsvr32.exe
  | stats count min(_time) as firstTime max(_time) as lastTime by Computer, User,
  parent_process_name, process_name, OriginalFileName, process_path, CommandLine |
  rename Computer as dest | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`|
  `suspicious_regsvr32_rename_filter`'
known_false_positives: Although unlikely, some legitimate applications may use a moved
  copy of regsvr32, triggering a false positive.
tags:
  analytics_story:
  - Suspicious Regsvr32 Activity
  mitre_attack_id:
  - T1218.010
  - T1036.003
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 8
  nist:
  - PR.PT
  - DE.CM
  security_domain: endpoint
  asset_type: Endpoint
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.010/windows-sysmon.log
