name: Suspicious PlistBuddy Usage
id: c3194009-e0eb-4f84-87a9-4070f8688f00
version: 1
date: '2021-02-22'
author: Michael Haag, Splunk
status: experimental
type: TTP
description: 'The following analytic identifies the use of a native MacOS utility,
  PlistBuddy, creating or modifying a properly list (.plist) file. In the instance
  of Silver Sparrow, the following commands were executed:

  * PlistBuddy -c "Add :Label string init_verx" ~/Library/Launchagents/init_verx.plist

  * PlistBuddy -c "Add :RunAtLoad bool true" ~/Library/Launchagents/init_verx.plist

  * PlistBuddy -c "Add :StartInterval integer 3600" ~/Library/Launchagents/init_verx.plist

  * PlistBuddy -c "Add :ProgramArguments array" ~/Library/Launchagents/init_verx.plist

  * PlistBuddy -c "Add :ProgramArguments:0 string /bin/sh" ~/Library/Launchagents/init_verx.plist

  * PlistBuddy -c "Add :ProgramArguments:1 string -c" ~/Library/Launchagents/init_verx.plist

  Upon triage, capture the property list file being written to disk and review for
  further indicators. Contain the endpoint and triage further.'
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=PlistBuddy
  (Processes.process=*LaunchAgents* OR Processes.process=*RunAtLoad* OR Processes.process=*true*)
  by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)` |  `suspicious_plistbuddy_usage_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Some legitimate applications may use PlistBuddy to create or
  modify property lists and possibly generate false positives. Review the property
  list being modified or created to confirm.
references:
- https://www.marcosantadev.com/manage-plist-files-plistbuddy/
tags:
  analytic_story:
  - Silver Sparrow
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1543.001
  - T1543
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_name
  - Processes.process
  - Processes.dest
  - Processes.user
  - Processes.parent_process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 25
  security_domain: endpoint
