author: Teoderick Contreras, Splunk
datamodel: []
date: '2022-01-19'
description: This analytic identifies a process making a DNS query to Discord, a well
  known instant messaging and digital distribution platform. Discord can be abused
  by adversaries, as seen in the WhisperGate campaign, to host and download malicious.
  external files. A process resolving a Discord DNS name could be an indicator of
  malware trying to download files from Discord for further execution.
how_to_implement: his detection relies on sysmon logs with the Event ID 22, DNS Query.
id: 4d4332ae-792c-11ec-89c1-acde48001122
known_false_positives: Noise and false positive can be seen if the following instant
  messaging is allowed to use within corporate network. In this case, a filter is
  needed.
name: Suspicious Process With Discord DNS Query
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
search: '`sysmon` EventCode=22 QueryName IN ("*discord*") process_path != "*\\AppData\\Local\\Discord\\*"
  AND process_path != "*\\Program Files*" AND process_name != "discord.exe" | stats
  count min(_time) as firstTime max(_time) as lastTime by Image QueryName QueryStatus
  process_name QueryResults Computer process_path | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `suspicious_process_with_discord_dns_query_filter`'
tags:
  analytic_story:
  - WhisperGate
  automated_detection_testing: passed
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.005/discord_dnsquery/sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: suspicious process $process_name$ has a dns query in $QueryName$ on $Computer$
  mitre_attack_id:
  - T1059.005
  - T1059
  nist:
  - DE.CM
  observable:
  - name: Computer
    role:
    - Victim
    type: Hostname
  - name: process_name
    role:
    - Attacker
    type: process name
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Image
  - QueryName
  - QueryStatus
  - process_name
  - QueryResults
  - Computer
  - process_path
  risk_score: 64
  security_domain: endpoint
type: Anomaly
version: 1
