name: Suspicious Reg exe Process
id: a6b3ab4e-dd77-4213-95fa-fc94701995e0
version: 5
date: '2020-07-22'
author: David Dorsey, Splunk
type: TTP
datamodel:
  - Endpoint
description: This search looks for reg.exe being launched from a command prompt not
  started by the user. When a user launches cmd.exe, the parent process is usually
  explorer.exe. This search filters out those instances.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Processes where Processes.parent_process_name
  != explorer.exe `process_cmd` by Processes.user Processes.process_name
  Processes.parent_process_name Processes.original_file_name Processes.dest Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | search [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where Processes.parent_process_name=cmd.exe `process_reg` by Processes.parent_process_id
  Processes.dest Processes.process_name Processes.original_file_name | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | rename parent_process_id as process_id |dedup
  process_id| table process_id dest] | `suspicious_reg_exe_process_filter` '
how_to_implement: To successfully implement this search you need to be ingesting information on process that include the name of the process responsible for the changes from your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition, confirm the latest CIM App 4.20 or higher is installed and the latest TA for the endpoint product.
known_false_positives: It's possible for system administrators to write scripts that
  exhibit this behavior. If this is the case, the search will need to be modified
  to filter them out.
references:
- https://car.mitre.org/wiki/CAR-2013-03-001
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Disabling Security Tools
  - DHS Report TA18-074A
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 8
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Execution
  - Stage:Initial Access
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1112/atomic_red_team/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Actions on Objectives
  message: Suspicious $Processes.process_path.file_path$ process running with an uncommon
    parent process $Processes.parent_process_name$
  mitre_attack_id:
  - T1112
  nist:
  - DE.CM
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: Processes.process_path.file_path
    type: File Name
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name #parent process name
  - Processes.parent_process #parent cmdline
  - Processes.original_file_name
  - Processes.process_name #process name
  - Processes.process #process cmdline
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 35
  security_domain: endpoint
