name: Suspicious Linux Discovery Commands
id: 0edd5112-56c9-11ec-b990-acde48001122
version: 1
date: '2021-12-06'
author: Bhavin Patel, Splunk
status: production
type: TTP
description: 'This search, detects execution of suspicious bash commands from various
  commonly leveraged bash scripts like (AutoSUID, LinEnum, LinPeas) to perform discovery
  of possible paths of privilege execution, password files, vulnerable directories,
  executables and file permissions on a Linux host.

  The search logic specifically looks for high number of distinct commands run in
  a short period of time.'
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count values(Processes.process)
  values(Processes.process_name) values(Processes.parent_process_name) dc(Processes.process)
  as distinct_commands dc(Processes.process_name) as distinct_process_names min(_time)
  as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where [|inputlookup
  linux_tool_discovery_process.csv | rename process as Processes.process |table Processes.process]
  by _time span=5m Processes.user Processes.dest | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| where
  distinct_commands > 40 AND distinct_process_names > 3| `suspicious_linux_discovery_commands_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Unless an administrator is using these commands to troubleshoot
  or audit a system, the execution of these commands should be monitored.
references:
- https://attack.mitre.org/matrices/enterprise/linux/
- https://attack.mitre.org/techniques/T1059/004/
- https://github.com/IvanGlinkin/AutoSUID
- https://github.com/carlospolop/PEASS-ng/tree/master/linPEAS
- https://github.com/rebootuser/LinEnum
tags:
  analytic_story:
  - Linux Post-Exploitation
  asset_type: Endpoint
  confidence: 90
  impact: 90
  message: Suspicious Linux Discovery Commands detected on $dest$
  mitre_attack_id:
  - T1059.004
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.parent_process_name
  - Processes.user
  - Processes.process_name
  risk_score: 81
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.004/linux_discovery_tools/sysmon_linux.log
    source: Syslog:Linux-Sysmon/Operational
    sourcetype: sysmon_linux
