name: Suspicious MSBuild Rename
id: 4006adac-5937-11eb-ae93-0242ac130002
version: 3
date: '2022-04-07'
author: Michael Haag, Splunk
type: Hunting
datamodel:
- Endpoint
description: The following analytic identifies renamed instances of msbuild.exe executing.
  Msbuild.exe is natively found in C:\Windows\Microsoft.NET\Framework\v4.0.30319 and
  C:\Windows\Microsoft.NET\Framework64\v4.0.30319. During investigation, identify
  the code executed and what is executing a renamed instance of MSBuild.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name!=msbuild.exe AND Processes.original_file_name=MSBuild.exe by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id Processes.original_file_name |
  `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `suspicious_msbuild_rename_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: Although unlikely, some legitimate applications may use a moved
  copy of msbuild, triggering a false positive.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Msbuild/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1127.001/T1127.001.md
- https://github.com/infosecn1nja/MaliciousMacroMSBuild/
tags:
  analytic_story:
  - Trusted Developer Utilities Proxy Execution MSBuild
  - Cobalt Strike
  - Masquerading - Rename System Utilities
  - Living Off The Land
  asset_type: Endpoint
  cis20:
  - CIS 8
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1127.001/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: Suspicious renamed msbuild.exe binary ran on $dest$ by $user$
  mitre_attack_id:
  - T1036
  - T1127
  - T1036.003
  - T1127.001
  nist:
  - PR.PT
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Endpoint
  - name: User
    role:
    - Victim
    type: User
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.original_file_name
  - Endpoint.Processes.parent_process_id
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 63
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
