name: Suspicious Process With Discord DNS Query
id: 4d4332ae-792c-11ec-89c1-acde48001122
version: 1
date: '2022-01-19'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: This analytic detects a suspicious process making a DNS query via known,
  abused  VoIP, instant messaging, and digital distribution platforms used to download external files. 
  This technique is abused by adversaries, malware actors, and red teams to download a malicious file on the target host. 
  This is a good TTP indicator for possible initial access techniques for possible suspicious process aside from discord applications and application
  like browser accessing discord link or create dns query. 
search: '`sysmon` EventCode=22 QueryName IN ("*discord*") process_path != "*\\AppData\\Local\\Discord\\*" AND process_path != "*\\Program Files*" AND process_name != "discord.exe" 
  | stats count min(_time) as firstTime max(_time) as lastTime by Image QueryName QueryStatus process_name QueryResults Computer process_path
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` 
  | `suspicious_process_with_discord_dns_query_filter`'
how_to_implement: his detection relies on sysmon logs with the Event ID 22, DNS Query.
known_false_positives: Noise and false positive can be seen if the following instant
  messaging is allowed to use within corporate network. In this case, a filter is
  needed.
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
tags:
  analytic_story:
  - WhisperGate
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.005/discord_dnsquery/sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1059.005
  - T1059
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Image
  - QueryName
  - QueryStatus
  - process_name
  - QueryResults
  - Computer
  - process_path
  security_domain: endpoint
  impact: 80
  confidence: 80  
  # (impact * confidence)/100
  risk_score: 64
  context:
  - Source:Endpoint
  - Stage:Execution
  message: suspicious process $process_name$ has a dns query in $QueryName$ on $Computer$
  observable:
  - name: Computer
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: process name
    role:
    - Attacker
  nist:
  - DE.CM
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16