name: Suspicious IcedID Rundll32 Cmdline
id: bed761f8-ee29-11eb-8bf3-acde48001122
version: 1
date: '2021-07-26'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This search is to detect a suspicious rundll32.exe commandline to execute
  dll file. This technique was seen in IcedID malware to load its payload dll with
  the following parameter to load encrypted dll payload which is the license.dat.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=rundll32.exe
  Processes.process=*/i:* by  Processes.process_name Processes.process Processes.parent_process_name
  Processes.parent_process Processes.process_id Processes.parent_process_id Processes.dest
  Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `suspicious_icedid_rundll32_cmdline_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. Tune and filter known instances where renamed rundll32.exe may be used.
known_false_positives: limitted. this parameter is not commonly used by windows application
  but can be used by the network operator.
references:
- https://threatpost.com/icedid-banking-trojan-surges-emotet/165314/
tags:
  analytic_story:
  - Icedid
  automated_detection_testing: passed
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/inf_icedid/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: rundll32 process $process_name$ with commandline $process$ in host $dest$
  mitre_attack_id:
  - T1218.011
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: process name
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - process_name
  - process
  - parent_process_name
  - parent_process
  - process_id
  - parent_process_id
  - dest
  - user
  risk_score: 56
  security_domain: endpoint
