name: System Information Discovery Detection
id: 8e99f89e-ae58-4ebc-bf52-ae0b1a277e72
version: 3
date: '2024-03-14'
author: Patrick Bareiss, Splunk
status: production
type: TTP
description: Detect system information discovery techniques used by attackers to understand
  configurations of the system to further exploit it.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process="*wmic* qfe*"
  OR Processes.process=*systeminfo* OR Processes.process=*hostname*) by Processes.user
  Processes.process_name Processes.process Processes.dest Processes.parent_process_name
  | `drop_dm_object_name(Processes)` | eventstats dc(process) as dc_processes_by_dest
  by dest | where dc_processes_by_dest > 2 | stats values(process) as process min(firstTime)
  as firstTime max(lastTime) as lastTime by user, dest parent_process_name | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `system_information_discovery_detection_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Administrators debugging servers
references:
- https://web.archive.org/web/20210119205146/https://oscp.infosecsanyam.in/priv-escalation/windows-priv-escalation
tags:
  analytic_story:
  - Windows Discovery Techniques
  asset_type: Windows
  confidence: 50
  impact: 30
  message: Potential system information discovery behavior on $dest$ by $user$
  mitre_attack_id:
  - T1082
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.user
  - Processes.process_name
  - Processes.dest
  risk_score: 15
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1082/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
