author: Patrick Bareiss, Splunk
datamodel:
- Endpoint
date: '2021-09-07'
description: Detect system information discovery techniques used by attackers to understand
  configurations of the system to further exploit it.
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
id: 8e99f89e-ae58-4ebc-bf52-ae0b1a277e72
known_false_positives: Administrators debugging servers
name: System Information Discovery Detection
references:
- https://oscp.infosecsanyam.in/priv-escalation/windows-priv-escalation
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process="*wmic* qfe*"
  OR Processes.process=*systeminfo* OR Processes.process=*hostname*) by Processes.user
  Processes.process_name Processes.process Processes.dest Processes.parent_process_name
  | `drop_dm_object_name(Processes)` | eventstats dc(process) as dc_processes_by_dest
  by dest | where dc_processes_by_dest > 2 | stats values(process) as processes min(firstTime)
  as firstTime max(lastTime) as lastTime by user, dest parent_process_name | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `system_information_discovery_detection_filter`'
tags:
  analytic_story:
  - Discovery Techniques
  asset_type: Windows
  automated_detection_testing: passed
  cis20:
  - CIS 6
  - CIS 8
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Recon
  - Stage:Discovery
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1082/atomic_red_team/windows-sysmon.log
  impact: 30
  kill_chain_phases:
  - Actions on Objectives
  message: Potential system information discovery behavior on $dest$ by $User$
  mitre_attack_id:
  - T1082
  nist:
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Endpoint
  - name: User
    role:
    - Attacker
    type: User
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Processes.dest
  - Processes.parent_process_name
  - Processes.process
  - Processes.process_name
  - Processes.user
  - _time
  risk_score: 15
  security_domain: endpoint
type: TTP
version: 2
