author: Teoderick Contreras, Splunk
datamodel:
- Endpoint
date: '2021-09-29'
description: This analytic is to detect a suspiciouos modification of time provider
  registry for persistence and autostart. This technique can allow the attacker to
  persist on the compromised host and autostart as soon as the machine boot up. This
  TTP can be a good indicator of suspicious behavior since this registry is not commonly
  modified by normal user or even an admin.
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
id: 5ba382c4-2105-11ec-8d8f-acde48001122
known_false_positives: unknown
name: Time Provider Persistence Registry
references:
- https://pentestlab.blog/2019/10/22/persistence-time-providers/
- https://attack.mitre.org/techniques/T1547/003/
search: '| tstats `security_content_summariesonly` count  min(_time) as firstTime
  max(_time) as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path
  ="*\\CurrentControlSet\\Services\\W32Time\\TimeProviders*" by Registry.dest  Registry.user
  Registry.registry_path Registry.registry_key_name Registry.registry_value_name |
  `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` | `drop_dm_object_name(Registry)`
  | `time_provider_persistence_registry_filter`'
tags:
  analytic_story:
  - Windows Persistence Techniques
  - Windows Privilege Escalation
  automated_detection_testing: passed
  confidence: 100
  context:
  - source:endpoint
  - stage:Privilege Escalation Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1547.003/timeprovider_reg/sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: modified/added/deleted registry entry $Registry.registry_path$ in $dest$
  mitre_attack_id:
  - T1547.003
  - T1547
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: user
    role:
    - Victim
    type: user
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Registry.dest
  - Endpoint.Registry.registry_key_name
  - Endpoint.Registry.registry_path
  - Endpoint.Registry.registry_value_name
  - Endpoint.Registry.user
  - _time
  risk_score: 80
  security_domain: endpoint
type: TTP
version: 1
