name: Trickbot Named Pipe
id: 1804b0a4-a682-11eb-8f68-acde48001122
version: 1
date: '2021-04-26'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: this search is to detect potential trickbot infection through the create/connected
  named pipe to the system. This technique is used by trickbot to communicate to its
  c2 to post or get command during infection.
search: '`sysmon` EventCode IN (17,18) PipeName="\\pipe\\*lacesomepipe" | stats  min(_time)
  as firstTime max(_time) as lastTime count by Computer user_id EventCode PipeName
  signature Image process_id | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `trickbot_named_pipe_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name and pipename from your endpoints. If you are using Sysmon,
  you must have at least version 6.0.4 of the Sysmon TA. .
known_false_positives: unknown
references:
- https://labs.vipre.com/trickbot-and-its-modules/
- https://blog.whitehat.eu/2019/05/incident-trickbot-ryuk-2.html
tags:
  analytic_story:
  - Trickbot
  automated_detection_testing: passed
  confidence: 60
  context:
  - Source:Endpoint
  - Stage:Initial Access
  - Stage:Execution
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/trickbot/namedpipe/windows-sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: Possible Trickbot namedpipe created on $Computer$ by $Image$
  mitre_attack_id:
  - T1055
  observable:
  - name: Computer
    type: Endpoint
    role:
    - Victim
  - name: Image
    type: Process
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Computer
  - user_id
  - EventCode
  - PipeName
  - signature
  - Image
  - process_id
  risk_score: 42
  security_domain: endpoint
