name: UAC Bypass MMC Load Unsigned Dll
id: 7f04349c-e30d-11eb-bc7f-acde48001122
version: 1
date: '2021-07-12'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: This search is to detect a suspicious loaded unsigned dll by MMC.exe
  application. This technique is commonly seen in attacker that tries to bypassed
  UAC feature or gain privilege escalation. This is done by modifying some CLSID registry
  that will trigger the mmc.exe to load the dll path
search: '`sysmon` EventCode=7  ImageLoaded = "*.dll" Image = "*\\mmc.exe" Signed=false
  Company != "Microsoft Corporation" | stats count min(_time) as firstTime max(_time)
  as lastTime by Image ImageLoaded Signed ProcessId OriginalFileName Computer EventCode
  Company | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `uac_bypass_mmc_load_unsigned_dll_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name and imageloaded executions from your endpoints. If you
  are using Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
known_false_positives: unknown. all of the dll loaded by mmc.exe is microsoft signed
  dll.
references:
- https://offsec.almond.consulting/UAC-bypass-dotnet.html
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1548.002
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Image
  - ImageLoaded
  - Signed
  - ProcessId
  - OriginalFileName
  - Computer
  - EventCode
  - Company
  security_domain: endpoint
  impact: 70
  confidence: 90
  risk_score: 63
  context:
  - Source:Endpoint
  - Stage:Persistence,
  - Stage:Privilege Escalation
  - Stage:Defense Evasion
  - Scope:Incoming
  message: Suspicious unsigned $ImageLoaded$ loaded by $Image$ on endpoint $Computer$
    with EventCode $EventCode$
  observable:
  - name: Computer
    type: Hostname
    role:
    - Victim
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548/uac_bypass/windows-sysmon2.log
