name: Unknown Process Using The Kerberos Protocol
id: c91a0852-9fbb-11ec-af44-acde48001122
version: 2
date: '2024-01-23'
author: Mauricio Velazco, Splunk
status: production
type: TTP
description: The following analytic identifies a process performing an outbound connection
  on port 88 used by default by the network authentication protocol Kerberos. Typically,
  on a regular Windows endpoint, only the lsass.exe process is the one tasked with
  connecting to the Kerberos Distribution Center to obtain Kerberos tickets. Identifying
  an unknown process using this protocol may be evidence of an adversary abusing the
  Kerberos protocol.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes where Processes.process_name!=lsass.exe by _time Processes.process_id Processes.process_name Processes.dest Processes.process_path Processes.process Processes.parent_process_name | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | join  process_id dest [| tstats `security_content_summariesonly` count FROM datamodel=Network_Traffic.All_Traffic where All_Traffic.dest_port = 88 by All_Traffic.src All_Traffic.process_id  All_Traffic.dest_port | `drop_dm_object_name(All_Traffic)` | rename src as dest ] |  table _time dest parent_process_name process_name process_path process process_id dest_port | `unknown_process_using_the_kerberos_protocol_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Custom applications may leverage the Kerberos protocol. Filter
  as needed.
references:
- https://stealthbits.com/blog/how-to-detect-overpass-the-hash-attacks/
- https://www.thehacker.recipes/ad/movement/kerberos/ptk
tags:
  analytic_story:
  - Active Directory Kerberos Attacks
  asset_type: Endpoint
  confidence: 60
  impact: 60
  message: Unknown process $process_name$ using the kerberos protocol detected on host $dest$
  mitre_attack_id:
  - T1550
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - All_Traffic.dest_ip
  - All_Traffic.dest_port
  - All_Traffic.src_ip
  - Processes.process_id
  - Processes.process_name
  - Processes.dest
  - Processes.process_path
  - Processes.process
  - Processes.parent_process_name
  risk_score: 36
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1550/rubeus/windows-security.log
    source: WinEventLog:Security
    sourcetype: WinEventLog
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1550/rubeus/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
