name: Unload Sysmon Filter Driver
id: c77162d3-f93c-45cc-80c8-22f665664g9f
version: 3
date: '2020-07-22'
author: Bhavin Patel, Splunk
type: batch
datamodel:
- Endpoint
description: Attackers often disable security tools to avoid detection. This search
  looks for the usage of process `fltMC.exe` to unload a Sysmon Driver that will stop
  sysmon from collecting the data.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime values(Processes.process)
  as process max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=fltMC.exe
  AND Processes.process=*unload* AND Processes.process=*SysmonDrv*  by Processes.process_name
  Processes.process_id Processes.parent_process_name Processes.process Processes.dest
  Processes.user | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`|`security_content_ctime(lastTime)`
  |`unload_sysmon_filter_driver_filter`| table firstTime lastTime dest user count
  process_name process_id parent_process_name process'
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model. This search is also shipped with `unload_sysmon_filter_driver_filter` macro,
  update this macro to filter out false positives.
known_false_positives: ''
references: []
tags:
  analytic_story:
  - Disabling Security Tools
  asset_type: ''
  automated_detection_testing: passed
  cis20:
  - CIS 8
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.001/atomic_red_team/windows-sysmon.log
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1562.001
  nist:
  - DE.CM
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_name
  - Processes.dest
  - Processes.user
  security_domain: endpoint
  impact: 50
  confidence: 90
  risk_score: 45
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  message: Possible Sysmon filter driver unloading on $dest$
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim