author: Bhavin Patel, Splunk
datamodel:
- Endpoint
date: '2020-07-22'
description: Attackers often disable security tools to avoid detection. This search
  looks for the usage of process `fltMC.exe` to unload a Sysmon Driver that will stop
  sysmon from collecting the data.
how_to_implement: You must be ingesting data that records process activity from your
  hosts to populate the Endpoint data model in the Processes node. You must also be
  ingesting logs with both the process name and command line from your endpoints.
  The command-line arguments are mapped to the "process" field in the Endpoint data
  model. This search is also shipped with `unload_sysmon_filter_driver_filter` macro,
  update this macro to filter out false positives.
id: c77162d3-f93c-45cc-80c8-22f665664g9f
known_false_positives: ''
name: Unload Sysmon Filter Driver
references: []
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime values(Processes.process)
  as process max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=fltMC.exe
  AND Processes.process=*unload* AND Processes.process=*SysmonDrv*  by Processes.process_name
  Processes.process_id Processes.parent_process_name Processes.process Processes.dest
  Processes.user | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`|`security_content_ctime(lastTime)`
  |`unload_sysmon_filter_driver_filter`| table firstTime lastTime dest user count
  process_name process_id parent_process_name process'
tags:
  analytic_story:
  - Disabling Security Tools
  asset_type: ''
  automated_detection_testing: passed
  cis20:
  - CIS 8
  confidence: 90
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.001/atomic_red_team/windows-sysmon.log
  impact: 50
  kill_chain_phases:
  - Actions on Objectives
  message: Possible Sysmon filter driver unloading on $dest$
  mitre_attack_id:
  - T1562.001
  - T1562
  nist:
  - DE.CM
  observable:
  - name: dest
    role:
    - Victim
    type: Endpoint
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 45
  security_domain: endpoint
type: TTP
version: 3
