name: Unload Sysmon Filter Driver
id: e5928ff3-23eb-4d8b-b8a4-dcbc844fdfbe
version: 5
date: '2024-05-15'
author: Bhavin Patel, Splunk
status: production
type: TTP
description: The following analytic detects the use of `fltMC.exe` to unload the Sysmon
  driver, which stops Sysmon from collecting data. It leverages Endpoint Detection
  and Response (EDR) logs, focusing on process names and command-line executions.
  This activity is significant because disabling Sysmon can blind security monitoring,
  allowing malicious actions to go undetected. If confirmed malicious, this could
  enable attackers to execute further attacks without being logged, leading to potential
  data breaches, privilege escalation, or persistent access within the environment.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime values(Processes.process)
  as process max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name=fltMC.exe
  AND Processes.process=*unload* AND Processes.process=*SysmonDrv*  by Processes.process_name
  Processes.process_id Processes.parent_process_name Processes.process Processes.dest
  Processes.user | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)`|`security_content_ctime(lastTime)`
  |`unload_sysmon_filter_driver_filter`| table firstTime lastTime dest user count
  process_name process_id parent_process_name process'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Unknown at the moment
references:
- https://www.ired.team/offensive-security/defense-evasion/unloading-sysmon-driver
tags:
  analytic_story:
  - CISA AA23-347A
  - Disabling Security Tools
  asset_type: Endpoint
  confidence: 90
  impact: 50
  message: Possible Sysmon filter driver unloading on $dest$
  mitre_attack_id:
  - T1562.001
  - T1562
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_name
  - Processes.dest
  - Processes.user
  risk_score: 45
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.001/unload_sysmon/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
