name: User Discovery With Env Vars PowerShell Script Block
id: 77f41d9e-b8be-47e3-ab35-5776f5ec1d20
version: 1
date: '2021-09-13'
author: Mauricio Velazco, Splunk
type: Hunting
datamodel: []
description: The following analytic utilizes PowerShell Script Block Logging (EventCode=4104)
  to identify the use of PowerShell environment variables to identify the current
  logged user. Red Teams and adversaries may leverage this method to identify the
  logged user on a compromised endpoint for situational awareness and Active Directory
  Discovery.
search: '`powershell` EventCode=4104 (Message = "*$env:UserName*" OR Message = "*[System.Environment]::UserName*")
  | stats count min(_time) as firstTime max(_time) as lastTime by EventCode Message
  ComputerName User | `security_content_ctime(firstTime)` | `user_discovery_with_env_vars_powershell_script_block_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: Administrators or power users may use this PowerShell commandlet
  for troubleshooting.
references:
- https://attack.mitre.org/techniques/T1033/
tags:
  analytic_story:
  - Active Directory Discovery
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Discovery
  - Stage:Recon
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1033/AD_discovery/windows-powershell.log
  impact: 30
  kill_chain_phases:
  - Reconnaissance
  message: System user discovery on $dest$
  mitre_attack_id:
  - T1033
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Path
  - Message
  - OpCode
  - ComputerName
  - User
  - EventCode
  risk_score: 15
  security_domain: endpoint
  asset_type: Endpoint
