name: User Discovery With Env Vars PowerShell Script Block
id: 77f41d9e-b8be-47e3-ab35-5776f5ec1d20
version: 2
date: '2022-03-22'
author: Mauricio Velazco, Splunk
status: production
type: Hunting
description: The following analytic utilizes PowerShell Script Block Logging (EventCode=4104)
  to identify the use of PowerShell environment variables to identify the current
  logged user. Red Teams and adversaries may leverage this method to identify the
  logged user on a compromised endpoint for situational awareness and Active Directory
  Discovery.
data_source:
- Powershell Script Block Logging 4104
search: '`powershell` EventCode=4104 (ScriptBlockText = "*$env:UserName*" OR ScriptBlockText
  = "*[System.Environment]::UserName*") | stats count min(_time) as firstTime max(_time)
  as lastTime by EventCode ScriptBlockText Computer user_id 
  | rename Computer as dest, user_id as user
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` 
  | `user_discovery_with_env_vars_powershell_script_block_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: Administrators or power users may use this PowerShell commandlet
  for troubleshooting.
references:
- https://attack.mitre.org/techniques/T1033/
tags:
  analytic_story:
  - Active Directory Discovery
  asset_type: Endpoint
  confidence: 50
  impact: 30
  message: System user discovery on endpoint $dest$ by user $user$
  mitre_attack_id:
  - T1033
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Path
  - Message
  - OpCode
  - ComputerName
  - User
  - EventCode
  risk_score: 15
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1033/AD_discovery/windows-powershell-xml.log
    source: XmlWinEventLog:Microsoft-Windows-PowerShell/Operational
    sourcetype: xmlwineventlog
