name: Wget Download and Bash Execution
id: 35682718-5a85-11ec-b8f7-acde48001122
version: 1
date: '2021-12-11'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic identifies the use of wget on Linux or MacOS attempting
  to download a file from a remote source and pipe it to bash. This is typically found
  with coinminers and most recently with CVE-2021-44228, a vulnerability in Log4j.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=wget
  (Processes.process="*-q *" OR Processes.process="*--quiet*"  AND Processes.process="*-O-
  *") OR (Processes.process="*|*" AND Processes.process="*bash*") by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.process
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `wget_download_and_bash_execution_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: False positives should be limited, however filtering may be
  required.
references:
- https://www.huntress.com/blog/rapid-response-critical-rce-vulnerability-is-affecting-java
- https://www.lunasec.io/docs/blog/log4j-zero-day/
- https://gist.github.com/nathanqthai/01808c569903f41a52e7e7b575caa890
tags:
  analytic_story:
  - Ingress Tool Transfer
  - Log4Shell CVE-2021-44228
  asset_type: Endpoint
  confidence: 100
  cve:
  - CVE-2021-44228
  impact: 80
  message: An instance of $process_name$ was identified on endpoint $dest$ attempting
    to download a remote file and run it with bash.
  mitre_attack_id:
  - T1105
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1105/atomic_red_team/linux-sysmon_curlwget.log
    source: Syslog:Linux-Sysmon/Operational
    sourcetype: sysmon_linux
