name: Windows Service Deletion In Registry
id: daed6823-b51c-4843-a6ad-169708f1323e
version: 1
date: '2022-08-24'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: The following analytic identifies a service being deleted from the Windows
  Registry under CurrentControlSet\Services. Adversaries may delete a service as part
  of defense evasion.
data_source:
- Sysmon Event ID 13
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\SYSTEM\\CurrentControlSet\\Services*"
  AND (Registry.action = deleted OR (Registry.registry_value_name = DeleteFlag AND
  Registry.registry_value_data = 0x00000001 AND Registry.action=modified)) by Registry.registry_key_name
  Registry.user Registry.registry_path Registry.registry_value_data Registry.registry_value_name
  Registry.action Registry.dest | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_service_deletion_in_registry_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node. Also make sure
  that this registry was included in your config files ex. sysmon config to be monitored.
known_false_positives: This event can be seen when administrator delete a service
  or uninstall/reinstall a software that creates service entry, but it is still recommended
  to check this alert with high priority.
references:
- https://unit42.paloaltonetworks.com/brute-ratel-c4-tool/
tags:
  analytic_story:
  - Brute Ratel C4
  - PlugX
  asset_type: Endpoint
  confidence: 30
  impact: 60
  message: A service was deleted on $dest$ within the Windows registry.
  mitre_attack_id:
  - T1489
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.user
  - Registry.dest
  - Registry.registry_value_name
  - Processes.process_id
  - Processes.process_name
  - Processes.process
  - Processes.dest
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_guid
  risk_score: 18
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/brute_ratel/service_deletion/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
