name: Windows Kerberos Local Successful Logon
id: 8309c3a8-4d34-48ae-ad66-631658214653
version: 2
date: '2024-04-26'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic identifies a local successful authentication event
  on a Windows endpoint using the Kerberos package. The target user security identified
  will be set to the built-in local Administrator account, along with the remote address
  as localhost - 127.0.0.1. This may be indicative of a kerberos relay attack. Upon
  triage, review for recently ran binaries on disk. In addition, look for new computer
  accounts added to Active Directory and other anomolous AD events.
data_source:
- Windows Event Log Security 4624
search: '`wineventlog_security`  EventCode=4624 LogonType=3 AuthenticationPackageName=Kerberos
  action=success src=127.0.0.1 | stats count min(_time) as firstTime max(_time)
  as lastTime by dest, subject, action, SubjectLogonId, user, TargetUserName, src |
  `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_kerberos_local_successful_logon_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  Windows Security Event Logs with 4624 EventCode enabled. The Windows TA is also
  required.
known_false_positives: False positives are possible, filtering may be required to
  restrict to workstations vs domain controllers. Filter as needed.
references:
- https://github.com/Dec0ne/KrbRelayUp
tags:
  analytic_story:
  - Active Directory Kerberos Attacks
  - Local Privilege Escalation With KrbRelayUp
  asset_type: Endpoint
  confidence: 80
  impact: 80
  message: A successful localhost Kerberos authentication event occurred on $dest$,
    possibly indicative of Kerberos relay attack.
  mitre_attack_id:
  - T1558
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - dest
  - subject
  - action
  - Security_ID
  - user
  - TargetUserName
  - src_ip
  risk_score: 64
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1558/windows_kerberos_local_successful_logon/windows-xml.log
    source: XmlWinEventLog:Security
    sourcetype: XmlWinEventLog
