name: Windows Disable or Modify Tools Via Taskkill
id: a43ae66f-c410-4b3d-8741-9ce1ad17ddb0
version: 1
date: '2023-09-13'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
data_source:
- Sysmon EventID 1
description: This analytic is designed to identify potentially malicious processes that terminate other processes using taskkill.exe.
  This technique has been observed in various malware instances, employed by adversaries and red teamers alike, to forcibly terminate
  other processes whether they be security products or other legitimate applications as part of their malicious activities. 
  Detecting this anomaly serves as a valuable alert mechanism to identify suspicious processes or malware attempting to evade detection and disrupt system stability.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes 
  where Processes.process_name = "taskkill.exe" Processes.process IN ("* /f*", "* /t*") Processes.process IN ("* /im*", "* /pid*")
  by Processes.parent_process_name Processes.parent_process Processes.process_name Processes.process Processes.process_id Processes.process_guid  Processes.user Processes.dest
  | `drop_dm_object_name("Processes")` 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | `windows_disable_or_modify_tools_via_taskkill_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Network administrator can use this application to kill process during audit or investigation.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.njrat
tags:
  analytic_story:
  - NjRAT
  asset_type: Endpoint
  confidence: 60
  impact: 60
  message: A taskkill process to terminate process is executed on host- $dest$
  mitre_attack_id:
  - T1562
  - T1562.001
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: parent_process_name
    type: Process Name
    role:
    - Parent Process
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 36
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.001/taskkill/taskkill_im.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
