name: Windows MSIExec With Network Connections
id: 827409a1-5393-4d8d-8da4-bbb297c262a7
version: 1
date: '2022-06-16'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic identifies MSIExec with any network connection
  over port 443 or 80. Typically, MSIExec does not perform network communication to
  the internet.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where `process_msiexec` by _time Processes.process_id Processes.process_name Processes.dest
  Processes.process_path Processes.process Processes.parent_process_name | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | join  process_id
  [| tstats `security_content_summariesonly` count FROM datamodel=Network_Traffic.All_Traffic
  where All_Traffic.dest_port IN ("80","443") by All_Traffic.process_id All_Traffic.dest
  All_Traffic.dest_port All_Traffic.dest_ip | `drop_dm_object_name(All_Traffic)` ]
  | table _time dest parent_process_name process_name process_path process process_id
  dest_port dest_ip | `windows_msiexec_with_network_connections_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product. Add parent process as a filter, filter known good processes. This
  may be voluminous due to the join on process_id. All_Traffic does not have process_guid,
  yet.
known_false_positives: False positives will be present and filtering is required.
references:
- https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.007/T1218.007.md
tags:
  analytic_story:
  - Windows System Binary Proxy Execution MSIExec
  asset_type: Endpoint
  confidence: 50
  impact: 70
  message: An instance of $process_name$ was identified on endpoint $dest$ contacting
    a remote destination.
  mitre_attack_id:
  - T1218.007
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process Name
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_id
  - Processes.process_name
  - Processes.dest
  - Processes.process_path
  - Processes.process
  - Processes.parent_process_name
  - All_Traffic.process_id
  - All_Traffic.dest
  - All_Traffic.dest_port
  - All_Traffic.dest_ip
  risk_score: 35
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.007/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
