name: Windows Defender ASR Block Events
id: 026f5f4e-e99f-4155-9e63-911ba587300b
version: 2
date: '2024-05-13'
author: Michael Haag, Splunk
status: production
type: Anomaly
data_source:
- Windows Event Log Defender 1121
- Windows Event Log Defender 1126
- Windows Event Log Defender 1129
- Windows Event Log Defender 1131
- Windows Event Log Defender 1133
description: 'This detection searches for Windows Defender ASR block events. ASR is a feature of Windows Defender Exploit Guard that prevents actions and apps that are typically used by exploit-seeking malware to infect machines. ASR rules are applied to processes and applications. When a process or application attempts to perform an action that is blocked by an ASR rule, an event is generated. This detection searches for ASR block events that are generated when a process or application attempts to perform an action that is blocked by an ASR rule. Typically, these will be enabled in block most after auditing and tuning the ASR rules themselves. Set to TTP once tuned.'
search: '`ms_defender` EventCode IN (1121, 1126, 1129, 1131, 1133)
  | stats count min(_time) as firstTime max(_time) as lastTime by host, Path, Parent_Commandline, Process_Name, ID, EventCode
  | lookup asr_rules ID OUTPUT ASR_Rule
  | fillnull value=NULL
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| rename host as dest | `windows_defender_asr_block_events_filter`'
how_to_implement: The following analytic requires collection of Windows Defender Operational logs in either XML or multi-line. To collect, setup a new input for the Windows Defender Operational logs. In addition, it does require a lookup that maps the ID to ASR Rule name. Note that Audit and block Event IDs have different fields, therefore the analytic will need to be modified for each type of event. 
known_false_positives: False positives are expected from legitimate applications generating events that are similar to those generated by malicious activity. For example, Event ID 1122 is generated when a process attempts to load a DLL that is blocked by an ASR rule. This can be triggered by legitimate applications that attempt to load DLLs that are not blocked by ASR rules. This is block only.
references:
- https://asrgen.streamlit.app/
tags:
  analytic_story:
  - Windows Attack Surface Reduction
  asset_type: Endpoint
  atomic_guid: []
  confidence: 90
  impact: 50
  message: ASR block event, $ASR_Rule$, was triggered on $dest$.
  mitre_attack_id:
  - T1059
  - T1566.001
  - T1566.002
  observable:
  - name: ASR_Rule
    type: Unknown
    role:
    - Other
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 45
  required_fields:
  - host
  - Process_Name
  - Path
  - ID
  - EventCode
  - ASR_Rule
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059/defender/asr_block.log
    source: WinEventLog:Microsoft-Windows-Windows Defender/Operational
    sourcetype: xmlwineventlog
