name: Windows Query Registry Reg Save
id: cbee60c1-b776-456f-83c2-faa56bdbe6c6
version: 1
date: '2023-12-27'
author: Teoderick Contreras, Splunk
status: production
type: Hunting
description: The following analytic identifies a process execution of reg.exe with
  "save" parameter. This reg.exe parameter is commonly being abused by threat actors,
  adversaries and red-teamers to dump credentials or to check the registry modification
  capabilities of certain users or administrators in targeted hosts. This approach
  was seen in post-exploitation tool like winpeas where it uses "reg save" and "reg
  restore" to check registry modification restriction in targeted host after gaining
  access to it.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where  `process_reg` AND Processes.process
  = "* save *" by Processes.process_name Processes.original_file_name Processes.process
  Processes.process_id Processes.process_guid Processes.parent_process_name Processes.parent_process
  Processes.parent_process_guid Processes.dest Processes.user | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_query_registry_reg_save_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: network administrator can use this command tool to backup registry
  before updates or modifying critical registries.
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/quser
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
  analytic_story:
  - Windows Post-Exploitation
  - CISA AA23-347A
  - Prestige Ransomware
  asset_type: Endpoint
  confidence: 30
  impact: 30
  message: execution of process $process_name$ in $dest$
  mitre_attack_id:
  - T1012
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  - Processes.parent_process_guid
  - Processes.process_guid
  risk_score: 9
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/winpeas/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
