name: Windows PowerView Unconstrained Delegation Discovery
id: fbf9e47f-e531-4fea-942d-5c95af7ed4d6
version: 3
date: '2024-05-10'
author: Mauricio Velazco, Splunk
status: production
type: TTP
description: The following analytic detects the use of PowerView commandlets to discover
  Windows endpoints with Kerberos Unconstrained Delegation. It leverages PowerShell
  Script Block Logging (EventCode=4104) to identify specific commands like `Get-DomainComputer`
  or `Get-NetComputer` with the `-Unconstrained` parameter. This activity is significant
  as it indicates potential reconnaissance efforts by adversaries or Red Teams to
  map out privileged delegation settings in Active Directory. If confirmed malicious,
  this could allow attackers to identify high-value targets for further exploitation,
  potentially leading to privilege escalation or lateral movement within the network.
data_source:
- Powershell Script Block Logging 4104
search: '`powershell` EventCode=4104 (ScriptBlockText = "*Get-DomainComputer*" OR
  ScriptBlockText = "*Get-NetComputer*") AND (ScriptBlockText = "*-Unconstrained*")
  | stats count min(_time) as firstTime max(_time) as lastTime by EventCode ScriptBlockText
  Computer UserID | rename Computer as dest | rename UserID as user | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_powerview_unconstrained_delegation_discovery_filter`'
how_to_implement: The following  analytic requires PowerShell operational logs to
  be imported. Modify the powershell macro as needed to match the sourcetype or add
  index. This analytic is specific to 4104, or PowerShell Script Block Logging.
known_false_positives: Administrators or power users may leverage PowerView for system
  management or troubleshooting.
references:
- https://attack.mitre.org/techniques/T1018/
- https://adsecurity.org/?p=1667
- https://docs.microsoft.com/en-us/defender-for-identity/cas-isp-unconstrained-kerberos
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/domain-compromise-via-unrestricted-kerberos-delegation
- https://www.cyberark.com/resources/threat-research-blog/weakness-within-kerberos-delegation
tags:
  analytic_story:
  - CISA AA23-347A
  - Rhysida Ransomware
  - Active Directory Kerberos Attacks
  asset_type: Endpoint
  confidence: 70
  impact: 50
  message: Suspicious PowerShell Get-DomainComputer was identified on endpoint $dest$
  mitre_attack_id:
  - T1018
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - ScriptBlockText
  - Computer
  - UserID
  risk_score: 35
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1018/windows_powerview_constrained_delegation_discovery/windows-xml.log
    source: XmlWinEventLog:Microsoft-Windows-PowerShell/Operational
    sourcetype: XmlWinEventLog
