name: Windows Event Log Cleared
id: ad517544-aff9-4c96-bd99-d6eb43bfbb6a
version: 4
date: '2020-07-06'
description: This search looks for Windows events that indicate one of the Windows
  event logs has been purged.
how_to_implement: To successfully implement this search, you need to be ingesting
  Windows event logs from your hosts.
type: batch
references: []
author: Rico Valdez, Splunk
search: (`wineventlog_security` (EventCode=1102 OR EventCode=1100)) OR (`wineventlog_system`
  EventCode=104) | stats count min(_time) as firstTime max(_time) as lastTime by EventCode
  dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_event_log_cleared_filter`
known_false_positives: It is possible that these logs may be legitimately cleared
  by Administrators.
tags:
  analytics_story:
  - Windows Log Manipulation
  - Ransomware
  mitre_attack_id:
  - T1070.001
  kill_chain_phases:
  - Actions on Objectives
  cis20:
  - CIS 3
  - CIS 5
  - CIS 6
  nist:
  - DE.DP
  - PR.IP
  - PR.AC
  - PR.AT
  - DE.AE
  security_domain: endpoint
  asset_type: Endpoint
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1070.001/atomic_red_team/windows-security.log
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1070.001/atomic_red_team/windows-system.log
