name: Windows Admon Default Group Policy Object Modified
id: 83458004-db60-4170-857d-8572f16f070b
version: 1
date: '2023-03-29'
author: Mauricio Velazco, Splunk
type: TTP
datamodel: []
description: UPDATE_DESCRIPTION
search: ' `admon` admonEventType=Update objectCategory="CN=Group-Policy-Container,CN=Schema,CN=Configuration,DC=*" (displayName="Default Domain Policy" OR displayName="Default Domain Controllers Policy")
  | stats min(_time) as firstTime max(_time) as lastTime values(gPCFileSysPath) by dcName, displayName
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)`
  | `windows_admon_default_group_policy_object_modified_filter`'
how_to_implement: UPDATE_HOW_TO_IMPLEMENT
known_false_positives: UPDATE_KNOWN_FALSE_POSITIVES
references:
- https://attack.mitre.org/techniques/T1484/
- https://attack.mitre.org/techniques/T1484/001
- https://www.trustedsec.com/blog/weaponizing-group-policy-objects-access/
- https://adsecurity.org/?p=2716
tags:
  analytic_story:
  - Active Directory Privilege Escalation
  - Sneaky Active Directory Persistence Tricks
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  - Stage:Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1484.001/default_domain_policy_modified/windows-security.log
  impact: 100
  kill_chain_phases:
  - Installation
  - Actions on Objectives
  message: UPDATE message
  mitre_attack_id:
  - T1484
  - T1484.001
  nist:
  - DE.CM
  observable:
  - name: dcName
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - admonEventType
  - objectCategory
  - displayName
  - gPCFileSysPath
  - dcName
  risk_score: 50
  security_domain: endpoint
