name: Windows Phishing Recent ISO Exec Registry
id: cb38ee66-8ae5-47de-bd66-231c7bbc0b2c
version: 2
date: '2022-09-19'
author: Teoderick Contreras, Splunk
type: Hunting
datamodel:
- Endpoint
description: The following hunting analytic identifies registry artifacts when an ISO container is opened, clicked or mounted on the Windows operating system.
  As Microsoft makes changes to macro based document execution, adversaries have begun to utilize container based initial access based phishing campaigns to evade preventative controls. 
  Once the ISO is clicked or mounted it will create a registry artifact related to this event as a recent application executed or opened.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Registry 
  where Registry.registry_key_name= "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\RecentDocs\\.iso" OR 
  Registry.registry_key_name= "*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\RecentDocs\\.img"
  by Registry.registry_key_name Registry.user Registry.registry_path Registry.registry_value_data Registry.action Registry.dest 
  | `drop_dm_object_name(Registry)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` 
  | `windows_phishing_recent_iso_exec_registry_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information on process 
  that include the name of the process responsible for the changes from your endpoints into the `Endpoint` 
  datamodel in the `Registry` node. In addition, confirm the latest CIM App 4.20 or higher is installed 
  and the latest TA for the endpoint product.
known_false_positives: False positives may be high depending on the environment and consistent use of ISOs. 
  Restrict to servers, or filter out based on commonly used ISO names. Filter as needed.
references:
- https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/
- https://unit42.paloaltonetworks.com/brute-ratel-c4-tool/
tags:
  analytic_story:
  - Brute Ratel C4
  - AgentTesla
  - Qakbot
  - IcedID
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 80
  context:
  - Source:Endpoint
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/brute_ratel/iso_version_dll_campaign/sysmon.log
  impact: 50
  kill_chain_phases:
  - Delivery
  message: An ISO file was mounted on $dest$ and should be reviewed and filtered as needed.
  mitre_attack_id:
  - T1566.001
  - T1566
  nist:
  - DE.CM
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_key_name 
  - Registry.user 
  - Registry.registry_path 
  - Registry.registry_value_data 
  - Registry.action 
  - Registry.dest 
  risk_score: 40
  security_domain: endpoint
