name: Windows Autostart Execution LSASS Driver Registry Modification
id: 57fb8656-141e-4d8a-9f51-62cff4ecb82a
version: 2
date: '2024-05-16'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic detects modifications to undocumented registry
  keys that allow a DLL to load into lsass.exe, potentially capturing credentials.
  It leverages the Endpoint.Registry data model to identify changes to \CurrentControlSet\Services\NTDS\DirectoryServiceExtPt
  or \CurrentControlSet\Services\NTDS\LsaDbExtPt. This activity is significant as
  it indicates a possible attempt to inject malicious code into the Local Security
  Authority Subsystem Service (LSASS), which can lead to credential theft. If confirmed
  malicious, this could allow attackers to gain unauthorized access to sensitive information
  and escalate privileges within the environment.
data_source:
- Sysmon EventID 12 
- Sysmon EventID 13
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path IN ("*\\CurrentControlSet\\Services\\NTDS\\DirectoryServiceExtPt","*\\CurrentControlSet\\Services\\NTDS\\LsaDbExtPt")
  by Registry.registry_key_name Registry.user Registry.registry_path Registry.registry_value_data
  Registry.action Registry.dest Registry.process_guid | `drop_dm_object_name(Registry)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_autostart_execution_lsass_driver_registry_modification_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: False positives may be present on recent Windows Operating
  Systems. Filtering may be required based on process_name. In addition, look for
  non-standard, unsigned, module loads into LSASS. If query is too noisy, modify by
  adding Endpoint.processes process_name to query to identify the process making the
  modification.
references:
- https://blog.xpnsec.com/exploring-mimikatz-part-1/
- https://github.com/oxfemale/LogonCredentialsSteal/tree/master/lsass_lib
tags:
  analytic_story:
  - Windows Registry Abuse
  asset_type: Endpoint
  confidence: 70
  impact: 70
  message: The registry values for DirectoryServiceExtPt or LsaDbExtPt were modified
    on $dest$.
  mitre_attack_id:
  - T1547.008
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.user
  - Registry.dest
  - Registry.registry_value_name
  - Registry.action
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1547.008/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
