name: Windows Modify Registry Qakbot Binary Data Registry
id: 2e768497-04e0-4188-b800-70dd2be0e30d
version: 1
date: '2022-10-21'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: UPDATE_DESCRIPTION
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  where Registry.registry_path="*\\SOFTWARE\\Microsoft\\*" AND Registry.registry_value_data = "Binary Data"
  by _time span=1m Registry.dest Registry.user Registry.registry_path  Registry.registry_value_name Registry.registry_value_data Registry.process_guid Registry.process_id Registry.registry_key_name 
  | `drop_dm_object_name(Registry)`
  |rename process_guid as proc_guid |join proc_guid, _time 
  [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes 
  where Processes.process_name = "explorer.exe"
  by _time span=1m Processes.process_id Processes.process_name Processes.process Processes.dest Processes.parent_process_name Processes.parent_process Processes.process_guid 
  | `drop_dm_object_name(Processes)` 
  |rename process_guid as proc_guid 
  | fields _time dest user parent_process_name parent_process process_name process_path process proc_guid registry_path registry_value_name registry_value_data process_id registry_key_name]
  | eval registry_key_name_len = len(registry_key_name)
  | eval registry_value_name_len = len(registry_value_name)
  | regex  registry_value_name="^[0-9a-fA-F]{8}"
  | where registry_key_name_len <= 80 AND registry_value_name_len == 8
  | table _time dest user parent_process_name parent_process process_name process_path process proc_guid registry_path registry_value_name registry_value_data process_id registry_key_name registry_key_name_len registry_value_name_len 
  | `windows_modify_registry_qakbot_binary_data_registry_filter`'
how_to_implement: UPDATE_HOW_TO_IMPLEMENT
known_false_positives: UPDATE_KNOWN_FALSE_POSITIVES
references:
- REFERENCE
tags:
  analytic_story:
  - UPDATE_STORY_NAME
  asset_type: UPDATE asset_type
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: UPDATE value between 1-100
  context:
  - Update context
  dataset:
  - UPDATE_DATASET_URL
  impact: UPDATE value between 1-100
  kill_chain_phases:
  - Exploitation
  message: UPDATE message
  mitre_attack_id:
  - T1112
  nist:
  - DE.CM
  observable:
  - name: UPDATE
    type: UPDATE
    role:
    - UPDATE
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - UPDATE
  risk_score: UPDATE (impact * confidence)/100
  security_domain: endpoint
