name: Windows AdFind Exe
id: bd3b0187-189b-46c0-be45-f52da2bae67f
version: 3
date: '2023-06-13'
author: Jose Hernandez, Bhavin Patel, Splunk
status: production
type: TTP
description: 'This search looks for the execution of `adfind.exe` with command-line
  arguments that it uses by default specifically the filter or search functions. It
  also considers the arguments necessary like objectcategory, see readme for more
  details: https://www.joeware.net/freetools/tools/adfind/usage.htm. AdFind.exe is
  a powerful tool that is commonly used for querying and retrieving information from
  Active Directory (AD). While it is primarily designed for AD administration and
  management, it has been seen used before by Wizard Spider, FIN6 and actors whom
  also launched SUNBURST.'
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where (Processes.process="* -f *"
  OR Processes.process="* -b *") AND (Processes.process=*objectcategory* OR Processes.process="*
  -gcb *" OR Processes.process="* -sc *") by Processes.dest Processes.user Processes.process_name
  Processes.process Processes.parent_process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_adfind_exe_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: ADfind is a command-line tool for AD administration and management
  that is seen to be leveraged by various adversaries. Filter out legitimate administrator
  usage using the filter macro.
references:
- https://www.volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/
- https://www.mandiant.com/resources/a-nasty-trick-from-credential-theft-malware-to-business-disruption
- https://www.joeware.net/freetools/tools/adfind/index.htm
- https://thedfirreport.com/2023/05/22/icedid-macro-ends-in-nokoyawa-ransomware/
tags:
  analytic_story:
  - Domain Trust Discovery
  - IcedID
  - NOBELIUM Group
  - Graceful Wipe Out Attack
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: Windows AdFind Exe
  mitre_attack_id:
  - T1018
  observable:
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process
  - Processes.dest
  - Processes.user
  - Processes.process_name
  - Processes.parent_process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 25.0
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1018/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
