name: Windows PowerShell Disable HTTP Logging
id: 27958de0-2857-43ca-9d4c-b255cf59dcab
version: 2
date: '2024-05-05'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic detects the use of `get-WebConfigurationProperty`
  and `Set-ItemProperty` commands in PowerShell to disable HTTP logging on Windows
  systems. This detection leverages PowerShell Script Block Logging, specifically
  looking for script blocks that reference HTTP logging properties and attempt to
  set them to "false" or "dontLog". Disabling HTTP logging is significant as it can
  be used by adversaries to cover their tracks and delete logs, hindering forensic
  investigations. If confirmed malicious, this activity could allow attackers to evade
  detection and persist in the environment undetected.
data_source:
- Powershell Script Block Logging 4104
search: '`powershell` EventCode=4104 ScriptBlockText IN("*get-WebConfigurationProperty*","*Set-ItemProperty*")
  AND ScriptBlockText IN ("*httpLogging*","*Logfile.enabled*") AND ScriptBlockText
  IN ("*dontLog*", "*false*")   | stats count min(_time) as firstTime max(_time) as
  lastTime by EventCode ScriptBlockText Computer user_id | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_powershell_disable_http_logging_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: It is possible administrators or scripts may run these commands,
  filtering may be required.
references:
- https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
- https://www.crowdstrike.com/wp-content/uploads/2022/05/crowdstrike-iceapple-a-novel-internet-information-services-post-exploitation-framework-1.pdf
- https://unit42.paloaltonetworks.com/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
- https://www.secureworks.com/research/bronze-union
tags:
  analytic_story:
  - IIS Components
  - Windows Defense Evasion Tactics
  asset_type: Endpoint
  confidence: 80
  impact: 80
  message: A PowerShell Cmdlet related to disable or modifying a IIS HTTP logging
    has occurred on $Computer$.
  mitre_attack_id:
  - T1562
  - T1562.002
  - T1505
  - T1505.004
  observable:
  - name: Computer
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - ScriptBlockText
  - Computer
  - EventCode
  risk_score: 64
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1505.004/4104_disable_http_logging_windows-powershell.log
    source: XmlWinEventLog:Microsoft-Windows-PowerShell/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
