name: Windows Impair Defense Add Xml Applocker Rules
id: 467ed9d9-8035-470e-ad5e-ae5189283033
version: 1
date: '2022-06-24'
author: Teoderick Contreras, Splunk
type: Hunting
datamodel:
- Endpoint.Processes
description: The following analytic is to identify a process that imports applocker
  xml policy using PowerShell commandlet. This technique was seen in Azorult malware
  where it drop an xml Applocker policy that will deny several AV products and further
  executed the PowerShell Applocker commandlet.
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where `process_powershell` AND Processes.process="*Import-Module Applocker*" AND
  Processes.process="*Set-AppLockerPolicy *"  AND Processes.process="* -XMLPolicy
  *" by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.original_file_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_impair_defense_add_xml_applocker_rules_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: Administrators may execute this command that may cause some
  false positive.
references:
- https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
tags:
  analytic_story:
  - Azorult
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/azorult/sysmon.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: Applocker importing xml policy command was executed in $dest$
  mitre_attack_id:
  - T1562.001
  - T1562
  nist:
  - DE.CM
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.user
  - Registry.dest
  - Registry.registry_value_name
  - Registry.action
  risk_score: 25
  security_domain: endpoint
