name: Windows Service Create RemComSvc
id: 0be4b5d6-c449-4084-b945-2392b519c33b
version: 1
date: '2023-03-20'
author: Michael Haag, Splunk
type: Anomaly
status: production
data_source:
- Windows Event Log System 7045
description: The following analytic identifies RemComSvc installed on an endpoint. This typically occurs when someone is moving laterally with RemCom.exe.
search: '`wineventlog_system` EventCode=7045 ServiceName="RemCom Service" | stats count min(_time) as firstTime max(_time) as lastTime by
  dest ImagePath ServiceName ServiceType   | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_service_create_remcomsvc_filter`'
how_to_implement: To implement this analytic, the Windows EventCode 7045 will need to be logged. The Windows TA for Splunk is also recommended.
known_false_positives: False positives may be present, filter as needed based on administrative activity.
references:
  - https://www.crowdstrike.com/blog/bears-midst-intrusion-democratic-national-committee/
  - https://github.com/kavika13/RemCom
tags:
  analytic_story:
  - Active Directory Discovery
  asset_type: Endpoint
  confidence: 80
  impact: 40
  message:  A new service was created related to RemCom on $dest$.
  mitre_attack_id:
  - T1543.003
  - T1543
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - dest 
  - EventCode 
  - ImagePath 
  - ServiceName 
  - ServiceType 
  risk_score: 32
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1543.003/atomic_red_team/remcom_windows-system.log
    source: XmlWinEventLog:System
    sourcetype: XmlWinEventLog
    update_timestamp: true
