name: Windows Known Abused DLL Created
id: ea91651a-772a-4b02-ac3d-985b364a5f07
version: 2
date: '2024-05-17'
author: Steven Dick
status: production
type: Anomaly
description: The following analytic identifies the creation of Dynamic Link Libraries
  (DLLs) with a known history of exploitation in atypical locations. It leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process and
  filesystem events. This activity is significant as it may indicate DLL search order
  hijacking or sideloading, techniques used by attackers to execute arbitrary code,
  maintain persistence, or escalate privileges. If confirmed malicious, this activity
  could allow attackers to blend in with legitimate operations, posing a severe threat
  to system integrity and security.
data_source:
- Sysmon EventID 1 AND Sysmon EventID 11
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Processes where Processes.parent_process_name!="unknown"
  Processes.process_name=* Processes.process_guid!=null by _time span=1h Processes.dest
  Processes.user Processes.process_guid Processes.process_name Processes.process Processes.parent_process
  Processes.parent_process_name | `drop_dm_object_name(Processes)` | join max=0 process_guid
  dest [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Filesystem
  where Filesystem.file_path IN ("*\\users\\*","*\\Windows\Temp\\*","*\\programdata\\*")
  Filesystem.file_name="*.dll" by _time span=1h Filesystem.dest Filesystem.file_create_time
  Filesystem.file_name Filesystem.file_path Filesystem.process_guid | `drop_dm_object_name(Filesystem)`
  | lookup hijacklibs_loaded library AS file_name OUTPUT islibrary, ttp, comment as
  desc | lookup hijacklibs_loaded library AS file_name excludes as file_path OUTPUT
  islibrary as excluded | search islibrary = TRUE AND excluded != TRUE | stats latest(*)
  as * by dest process_guid ] | where isnotnull(file_name) | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` |  `windows_known_abused_dll_created_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` and `Filesystem`
  nodes of the `Endpoint` data model. Use the Splunk Common Information Model (CIM)
  to normalize the field names and speed up the data modeling process.
known_false_positives: This analytic may flag instances where DLLs are loaded by user
  mode programs for entirely legitimate and benign purposes. It is important for users
  to be aware that false positives are not only possible but likely, and that careful
  tuning of this analytic is necessary to distinguish between malicious activity and
  normal, everyday operations of applications. This may involve adjusting thresholds,
  whitelisting known good software, or incorporating additional context from other
  security tools and logs to reduce the rate of false positives.
references:
- https://attack.mitre.org/techniques/T1574/002/
- https://hijacklibs.net/api/
- https://wietze.github.io/blog/hijacking-dlls-in-windows
- https://github.com/olafhartong/sysmon-modular/pull/195/files
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Living Off The Land
  asset_type: Endpoint
  confidence: 25
  impact: 40
  message: The file [$file_name$] was written to an unusual location by [$process_name$]
    on [$dest$].
  mitre_attack_id:
  - T1574.001
  - T1574.002
  - T1574
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Attacker
  - name: file_name
    type: File
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.process_guid
  - Processes.process_name
  - Processes.process
  - Processes.parent_process
  - Processes.parent_process_name
  - Filesystem.dest
  - Filesystem.file_create_time
  - Filesystem.file_name
  - Filesystem.file_path
  - Filesystem.process_guid
  risk_score: 10
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1574.002/hijacklibs/hijacklibs_sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: XmlWinEventLog
