name: Windows AD Domain Replication ACL Addition
id: 8c372853-f459-4995-afdc-280c114d33ab
version: 1
date: "2022-11-18"
author: Dean Luxton
type: TTP
status: production
data_source:
- Windows Security 5136
description:
  The following analytic detects the addition of the permissions necessary to perform a DCSync attack.
  In order to replicate AD objects, the initiating user or computer must have the following permissions on the domain.
  - DS-Replication-Get-Changes
  - DS-Replication-Get-Changes-All
  Certain Sync operations may require the additional permission of DS-Replication-Get-Changes-In-Filtered-Set.
  By default, adding DCSync permissions via the Powerview Add-ObjectACL operation adds all 3. This alert identifies where this trifecta has been met, and also where just the base level requirements have been met.
search: '`wineventlog_security` EventCode=5136 OperationType="%%14674" ObjectClass=domainDNS 
  | rex field=AttributeValue max_match=10000 "OA(;|;CI);CR;1131f6aa-9c07-11d1-f79f-00c04fc2dcd2;;(?P<DSRGetChanges_user>(S-1-[ 0-59]-|\w+\\\).*?)\)"
  | rex field=AttributeValue max_match=10000 "OA(;|;CI);CR;1131f6ad-9c07-11d1-f79f-00c04fc2dcd2;;(?P<DSRGetChangesAll_user>(S-1-[ 0-59]-|\w+\\\).*?)\)"
  | rex field=AttributeValue max_match=10000 "OA(;|;CI);CR;89e95b76-444d-4c62-991a-0facbeda640c;;(?P<DSRGetChangesFiltered_user>(S-1-[ 0-59]-|\w+\\\).*?)\)"
  | mvexpand DSRGetChanges_user
  | eval minDCSyncPermissions=if(DSRGetChanges_user=DSRGetChangesAll_user,"true","false"), fullSet=if(DSRGetChanges_user=DSRGetChangesAll_user AND DSRGetChanges_user=DSRGetChangesFiltered_user,"true","false")
  | where minDCSyncPermissions="true" 
  | eval permissions_applied=mvappend(if(DSRGetChanges_user like "%","DS-Replication-Get-Changes",null),if(DSRGetChanges_user=DSRGetChangesAll_user,"DS-Replication-Get-Changes-All",null), if(DSRGetChanges_user=DSRGetChangesFiltered_user,"DS-Replication-Get-Changes-In-Filtered-Set",null))
  | stats min(_time) as _time by src_user DSRGetChanges_user permissions_applied, SubjectLogonId, DSName
  | rename SubjectLogonId as TargetLogonId, src_user as initiator, DSRGetChanges_user as target_user
  | appendpipe [| map search="search `wineventlog_security` EventCode=4624 TargetLogonId=$TargetLogonId$"]
  | stats min(_time) as _time values(initiator) as src_user, values(DSName) as targetDomain, values(target_user) as user, values(Computer) as dest, values(permissions_applied) as permissions_applied, values(src_category) as src_category, values(src_ip) as src_ip values(LogonType) as LogonType by TargetLogonId
  ``` uncomment to enable SID lookups as required
  | lookup identity_lookup_expanded objectSid as user OUTPUT downLevelDomainName as translated_user
  | lookup admon_groups_def objectSid as user OUTPUT cn as group_user
  | eval user=if(match(user, "S-1-[ 0-59]-\d{2}-\d{8,10}-\d{8,10}-\d{8,10}-[ 1-9]\d{3}") AND translated_user like "%" OR group_user like "%",coalesce(translated_user,group_user),user)
  | fields - translated_user group_user
  ```
  | eval comment=mvappend(if(isnull(src_ip),"Finding: Rerun search over longer time-range to locate src_ip from the captured TargetLogonId",null),if(match(user, "S-1-[ 0-59]-\d{2}-\d{8,10}-\d{8,10}-\d{8,10}-[ 1-9]\d{3}"),"Finding: Captured SID could not be found in A&I lookup, ensure A&I lookup is configured, also check potential group SIDs for a match",null))
  | `windows_ad_domain_replication_acl_addition_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting the eventcode 5136. The Advanced Security Audit policy setting
  `Audit Directory Services Changes` within `DS Access` needs to be enabled, alongside a SACL for `everybody` to  `Write All Properties`
  applied to the domain root and all descendant objects. Once the necessary logging has been enabled, enumerate the domain policy to verify if existing
  accounts with access need to be whitelisted, or revoked. Assets and Identities is also leveraged to automatically translate the objectSid into username.
  Ensure your identities lookup is configured with the sAMAccountName and objectSid of all AD user and computer objects.
known_false_positives:
  When there is a change to nTSecurityDescriptor, Windows logs the entire ACL with the newly added components.
  If existing accounts are present with this permission, they will raise an alert each time the nTSecurityDescriptor is updated unless whitelisted.
references:
  - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/1522b774-6464-41a3-87a5-1e5633c3fbbb
  - https://github.com/SigmaHQ/sigma/blob/29a5c62784faf986dc03952ae3e90e3df3294284/rules/windows/builtin/security/win_security_account_backdoor_dcsync_rights.yml
tags:
  analytic_story:
    - Sneaky Active Directory Persistence Tricks
  asset_type: Endpoint
  confidence: 80
  impact: 100
  message: $src_user$ has granted $user$ permission to replicate AD objects
  mitre_attack_id:
    - T1484
  observable:
    - name: user
      type: User
      role:
        - Victim
    - name: src_user
      type: User
      role:
        - Victim
  product:
    - Splunk Enterprise
    - Splunk Enterprise Security
    - Splunk Cloud
  required_fields:
    - _time
    - OperationType
    - src_user
    - AttributeLDAPDisplayName
    - AttributeValue
    - ObjectClass
    - SubjectLogonId
    - DSName
  risk_score: 80
  security_domain: endpoint
  manual_test: This search uses a lookup provided by Enterprise Security and needs to be manually tested.
tests:
  - name: True Positive Test
    attack_data:
      - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1484/aclmodification/windows-security-xml.log
        source: XmlWinEventLog:Security
        sourcetype: xmlwineventlog
