name: Windows Modify Show Compress Color And Info Tip Registry
id: b7548c2e-9a10-11ec-99e3-acde48001122
version: 2
date: '2022-11-14'
author: Steven Dick, Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This analytic is to look for suspicious registry modification related
  to file compression color and information tips. This IOC was seen in hermetic wiper
  where it has a thread that will create this registry entry to change the color of
  compressed or encrypted files in NTFS file system as well as the pop up information
  tips. This is a good indicator that a process tries to modified one of the registry
  GlobalFolderOptions related to file compression attribution in terms of color in
  NTFS file system.
search: '| tstats `security_content_summariesonly` count min(_time) AS firstTime max(_time) AS lastTime FROM datamodel=Endpoint.Processes BY _time span=1h Processes.user Processes.process_id Processes.process_name Processes.process Processes.process_path Processes.dest Processes.parent_process_name Processes.parent_process Processes.process_guid
  | `drop_dm_object_name(Processes)` 
  | join process_guid [
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path = "*\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced*" AND Registry.registry_value_name  IN("ShowCompColor", "ShowInfoTip")) BY _time span=1h Registry.registry_path Registry.registry_key_name Registry.registry_value_name Registry.registry_value_data Registry.process_guid 
  | `drop_dm_object_name(Registry)`] 
  | fields firstTime lastTime dest user parent_process_name parent_process process_name process_path process registry_key_name registry_path registry_value_name registry_value_data process_guid
  | where isnotnull(registry_value_data)
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)
  | `windows_modify_show_compress_color_and_info_tip_registry_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the registry value name, registry path, and registry value data from your
  endpoints. If you are using Sysmon, you must have at least version 2.0 of the offical
  Sysmon TA. https://splunkbase.splunk.com/app/5709
known_false_positives: unknown
references:
- https://blog.talosintelligence.com/2022/02/threat-advisory-hermeticwiper.html
tags:
  analytic_story:
  - Data Destruction
  - Windows Defense Evasion Tactics
  - Hermetic Wiper
  - Windows Registry Abuse
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/hermetic_wiper/globalfolderoptions_reg/sysmon.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: Registry modification in "ShowCompColor" and "ShowInfoTips" on $dest$
  mitre_attack_id:
  - T1112
  nist:
  - DE.CM
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.user
  - Processes.dest
  - Processes.process_id 
  - Processes.process_name 
  - Processes.process 
  - Processes.process_path  
  - Processes.parent_process_name 
  - Processes.parent_process 
  - Processes.process_guid
  - Registry.dest
  - Registry.registry_value_name
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.registry_value_data
  - Registry.process_guid
  risk_score: 25
  security_domain: endpoint
  asset_type: Endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon