name: Windows NirSoft Utilities
id: 5b2f4596-7d4c-11ec-88a7-acde48001122
version: 1
date: '2023-04-14'
author: Michael Haag, Splunk
status: production
type: Hunting
description: The following hunting analytic assists with identifying the proces execution
  of commonly used utilities from NirSoft. Potentially not adversary behavior, but
  worth identifying to know if the software is present and being used.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Processes by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.original_file_name Processes.process_path
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name("Processes")`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `is_nirsoft_software`
  | `windows_nirsoft_utilities_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: False positives may be present. Filtering may be required before
  setting to alert.
references:
- https://www.cisa.gov/uscert/ncas/alerts/TA18-201A
- http://www.nirsoft.net/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
  analytic_story:
  - Data Destruction
  - WhisperGate
  asset_type: Endpoint
  confidence: 100
  impact: 80
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ related to NiRSoft software usage.
  mitre_attack_id:
  - T1588.002
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1588.002/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
