name: Windows Event Log Cleared
id: ad517544-aff9-4c96-bd99-d6eb43bfbb6a
version: 6
date: '2020-07-06'
author: Rico Valdez, Michael Haag, Splunk
type: batch
datamodel: []
description: The following analytic utilizes Windows Security Event ID 1102 or System
  log event 104 to identify when a Windows event log is cleared. Note that this analytic
  will require tuning or restricted to specific endpoints based on criticality. During
  triage, based on time of day and user, determine if this was planned. If not planned,
  follow through with reviewing parallel alerts and other data sources to determine
  what else may have occurred.
search: (`wineventlog_security` EventCode=1102) OR (`wineventlog_system` EventCode=104)
  | stats count min(_time) as firstTime max(_time) as lastTime by dest Message EventCode
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_event_log_cleared_filter`
how_to_implement: To successfully implement this search, you need to be ingesting
  Windows event logs from your hosts. In addition, the Splunk Windows TA is needed.
known_false_positives: It is possible that these logs may be legitimately cleared
  by Administrators. Filter as needed.
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-1102
- https://www.ired.team/offensive-security/defense-evasion/disabling-windows-event-logs-by-suspending-eventlog-service-threads
- https://attack.mitre.org/techniques/T1070/001/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.001/T1070.001.md
tags:
  analytic_story:
  - Windows Log Manipulation
  - Ransomware
  - Clop Ransomware
  asset_type: Endpoint
  automated_detection_testing: passed
  cis20:
  - CIS 3
  - CIS 5
  - CIS 6
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1070.001/atomic_red_team/windows-security.log
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1070.001/atomic_red_team/windows-system.log
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1070.001
  nist:
  - DE.DP
  - PR.IP
  - PR.AC
  - PR.AT
  - DE.AE
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - dest
  security_domain: endpoint
  impact: 70
  confidence: 100
  # (impact * confidence)/100
  risk_score: 70
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  message: "Windows event logs cleared on $dest$ via EventCode $EventCode$"
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
