name: Windows Indirect Command Execution Via forfiles
id: 59e54602-9680-11ec-a8a6-aaaaaaaaaaaa
version: 1
date: '2022-03-09'
author: Eric McGinnis, Splunk
type: TTP
datamodel:
- Endpoint
description: The following analytic detection programs that have been started by pcalua.exe, forfiles, forfiles.exe, or conhost.exe.  
  While these tools can be used to start legitimate programs, they have been observed being evade protections on command line execution.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    as lastTime from datamodel=Endpoint.Processes where Processes.parent_process="*forfiles* /c *"  
    by Processes.dest Processes.user Processes.parent_process Processes.parent_process_name Processes.process_name Processes.process Processes.process_id Processes.parent_process_id Processes.process_path
  | `drop_dm_object_name(Processes)` 
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_indirect_command_execution_via_forfiles_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the full process path in the process field of CIM's Process data model.
  If you are using Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
  Tune and filter known instances where renamed forfiles.exe and pcalua.exe may be used.
known_false_positives: Some legacy applications may be run using pcalua.exe.  
  Similarly, forfiles.exe may be used in legitimate batch scripts.  Filter these results as needed.  
references:
  - https://twitter.com/KyleHanslovan/status/912659279806640128
  - REF2 - FIND ANOTHER REFERENCE
tags:
  analytic_story:
  - Living Off The Land
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/hermetic_wiper/sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1202
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Endpoint.Processes.dest
  - Endpoint.Processes.user
  - Endpoint.Processes.dest 
  - Endpoint.Processes.user 
  - Endpoint.Processes.parent_process 
  - Endpoint.Processes.parent_process_name 
  - Endpoint.Processes.process_name 
  - Endpoint.Processes.process 
  - Endpoint.Processes.process_id 
  - Endpoint.Processes.parent_process_id 
  - Endpoint.Processes.process_path
  security_domain: endpoint
  impact: 50
  confidence: 50 
  # (impact * confidence)/100
  risk_score: 50
  context: 
  - Source:Endpoint
  - Stage:Defense Evasion
  message: The Program Compatability Assistant (pcalua.exe) launched the process $process_name$
  observable:
  - name: process_name
    type: Process
    role:
    - Child Process
  nist:
  - DE.AE
  cis20:
  - CIS 8
  - CIS 10 