name: Windows Protocol Tunneling with Plink
id: 8aac5e1e-0fab-4437-af0b-c6e60af23eed
version: 2
date: '2024-05-24'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic detects the use of Plink for protocol tunneling,
  either for egress or lateral movement within an organization. It identifies specific
  Plink command-line options (-R, -L, -D, -l) by analyzing process execution logs
  from Endpoint Detection and Response (EDR) agents. This activity is significant
  as it may indicate an attempt to bypass network security controls or establish unauthorized
  connections. If confirmed malicious, this could allow an attacker to exfiltrate
  data, move laterally across the network, or maintain persistent access, posing a
  severe threat to the organization's security.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=plink.exe
  OR Processes.original_file_name=Plink Processes.process IN ("*-R *", "*-L *", "*-D
  *", "*-l *") by Processes.dest Processes.user Processes.parent_process_name Processes.process_name
  Processes.original_file_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`|
  `windows_protocol_tunneling_with_plink_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: False positives may be present if the organization allows for
  SSH tunneling outbound or internally. Filter as needed.
references:
- https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
- https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html
- https://attack.mitre.org/techniques/T1572/
- https://documentation.help/PuTTY/using-cmdline-portfwd.html#S3.8.3.5
tags:
  analytic_story:
  - CISA AA22-257A
  asset_type: Endpoint
  confidence: 80
  impact: 70
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ attempting to tunnel to a remote destination.
  mitre_attack_id:
  - T1572
  - T1021.004
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 56
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1572/plink/plink-windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
