name: Windows Service Stop Via Net  and SC Application
id: 827af04b-0d08-479b-9b84-b7d4644e4b80
version: 1
date: '2023-06-13'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: This analytic identifies suspicious attempts to stop services on a system
  using either `net.exe` or `sc.exe`. This technique is used by adversaries to terminate
  security services or other related services to continue their objective and evade
  detections. This technique is also commonly used by ransomware threat actors to
  successfully encrypt databases or files being processed or used by Windows OS Services.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime  from datamodel=Endpoint.Processes where `process_net` OR  Processes.process_name
  = "sc.exe" OR Processes.original_file_name= "sc.exe" AND Processes.process="*stop*"
  by  Processes.process_name Processes.original_file_name Processes.process Processes.process_id
  Processes.process_guid Processes.parent_process_name Processes.parent_process Processes.parent_process_guid
  Processes.dest Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_service_stop_via_net__and_sc_application_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Windows OS or software may stop and restart services due to
  some critical update.
references:
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
  analytic_story:
  - Prestige Ransomware
  - Graceful Wipe Out Attack
  asset_type: Endpoint
  confidence: 70
  impact: 70
  message: $process$ was executed on $dest$ attempting to stop service.
  mitre_attack_id:
  - T1489
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/prestige_ransomware/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
