name: Windows Enable DefaultAccount
id: 7fda89f6-4655-11ec-81ff-acde48001122
version: 1
date: '2021-11-15'
author: Michael Haag, Splunk
type: TTP
datamodel:
- Endpoint
description: 'The following analytic identifies the enabling of DefaultAccount by using `net.exe user`. It is a user-neutral account that can be used to run processes that are either multi-user aware or user-agnostic. The DSMA (Default System Managed Account) is disabled by default on the desktop SKUs (full windows SKUs) and WS 2016 with the Desktop.
  The DSMA has a well-known RID of 503. The security identifier (SID) of the DSMA will thus have a well-known SID in the following format S-1-5-21-<ComputerIdentifier>-503. Adversaries may enable, set a password, and add the account to groups to obtain remote/local access to the endpoint.'
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_net` Processes.process="*user*" Processes.process="*DefaultAccount*" by Processes.dest Processes.user Processes.parent_process_name Processes.process_name Processes.original_file_name
  Processes.process Processes.process_id Processes.parent_process_id
| `drop_dm_object_name(Processes)` 
| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)` | `windows_enable_defaultaccount_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information on process that include the name of the process responsible for the changes from your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition, confirm the latest CIM App 4.20 or higher is installed and the latest TA for the endpoint product.
known_false_positives: This account is typically not enabled manually by Administrators, however filter as needed.
references:
  - https://docs.microsoft.com/en-us/windows/security/identity-protection/access-control/local-accounts#defaultaccount
  - https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/  
tags:
  analytic_story:
  - Account Monitoring and Controls
  dataset: []
  kill_chain_phases:
  - Privilege Escalation
  mitre_attack_id:
  - T1078
  - T1078.003
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name #parent process name
  - Processes.parent_process #parent cmdline
  - Processes.original_file_name
  - Processes.process_name #process name
  - Processes.process #process cmdline
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  security_domain: endpoint
  impact: 80
  confidence: 100
  # (impact * confidence)/100
  risk_score: 80
  context:
  - Source:Endpoint
  - Stage:Persistence
  message: An instance of $parent_process_name$ spawning $process_name$ was identified on endpoint $dest$ by user $user$ enabling the DefaultAccount.
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Parent Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process