name: Windows Event For Service Disabled
id: 9c2620a8-94a1-11ec-b40c-acde48001122
version: 1
date: '2022-02-23'
author: Teoderick Contreras, Splunk
type: Hunting
datamodel:
- Endpoint
description: This analytic will identify suspicious system event of services that was modified from start to disabled. 
  This technique is seen where the adversary attempts to disable security app services, other malware services to evade the defense systems on the compromised host
search: '`wineventlog_system` EventCode=7040 Message = "*service was changed from demand start to disabled." 
  | stats count min(_time) as firstTime max(_time) as lastTime by ComputerName EventCode Message User Sid
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | `windows_event_for_service_disabled_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the Service name, Service File Name Service Start type, and Service Type
  from your endpoints.
known_false_positives: Windows service update may cause this event. In that scenario, filtering is needed.
references:
-  https://blog.talosintelligence.com/2018/02/olympic-destroyer.html
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/olympic_destroyer/system.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1562.001
  - T1562
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - ComputerName 
  - EventCode 
  - Message 
  - User 
  - Sid
  security_domain: endpoint
  impact: 60
  confidence: 60 
  # (impact * confidence)/100
  risk_score: 36
  context: 
  - Source:Endpoint
  - Stage:Defense Evasion
  message: Service was disabled on $Computer$
  observable:
  - name: ComputerName
    type: Endpoint
    role:
    - Victim
  nist:
  - DE.CM
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
