name: Windows Process Injection With Public Source Path
id: 492f09cf-5d60-4d87-99dd-0bc325532dda
version: 1
date: '2022-08-24'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: The following analytic identifies a process creating a remote thread in another process 
  with a public or uncommon installation process file path. This Windows API is commonly used by threat actors, red-teamers and adversaries 
  for process code injection to evade detections or gain privilege escalation.  
search: '`sysmon` EventCode=8 TargetImage = "*.exe" AND NOT(SourceImage IN("C:\\Windows\\*", "C:\\Program File*", "%systemroot%\\*"))
  | stats count min(_time) as firstTime max(_time) as lastTime by SourceImage TargetImage signature TargetProcessGuid SourceProcessGuid TargetProcessId SourceProcessId StartAddress EventCode Computer 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | `windows_process_injection_with_public_source_path_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: some security tool or 3rd party application may do this technique. Filter is needed.
references:
- https://unit42.paloaltonetworks.com/brute-ratel-c4-tool/
tags:
  analytic_story:
  - Brute Ratel C4
  asset_type: 80
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 80
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/brute_ratel/create_remote_thread/sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: process $SourceImage$ create a remote thread to process $TargetImage$ in host $Computer$
  mitre_attack_id:
  - T1055
  - T1055.002
  nist:
  - DE.CM
  observable:
  - name: Computer
    type: Hostname
    role:
    - Victim
  - name: SourceImage
    type: Process
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - SourceImage
  - TargetImage
  - TargetProcessId
  - SourceProcessId
  - StartAddress
  - EventCode
  - Computer
  - signature 
  - TargetProcessGuid 
  - SourceProcessGuid 
  - StartAddress
  risk_score: 64
  security_domain: endpoint
