name: Windows Excessive Disabled Services Event
id: c3f85976-94a5-11ec-9a58-acde48001122
version: 1
date: '2023-12-27'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: This analytic will identify suspicious excessive number of system events
  of services that was modified from start to disabled. This technique is seen where
  the adversary attempts to disable security app services, other malware services
  oer serve as an destructive impact to complete the objective on the compromised
  system. One good example for this scenario is Olympic destroyer where it disable
  all active services in the compromised host as part of its destructive impact and
  defense evasion.
data_source:
- Sysmon Event ID 7
search: '`wineventlog_system` EventCode=7040 Message = "*service was changed from
  demand start to disabled." | stats count values(Message) as MessageList dc(Message)
  as MessageCount min(_time) as firstTime max(_time) as lastTime by ComputerName EventCode  User
  Sid | where MessageCount >=10 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_excessive_disabled_services_event_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the Service name, Service File Name Service Start type, and Service Type
  from your endpoints.
known_false_positives: Unknown
references:
- https://blog.talosintelligence.com/2018/02/olympic-destroyer.html
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - CISA AA23-347A
  asset_type: Endpoint
  confidence: 90
  impact: 90
  message: Service was disabled in $Computer$
  mitre_attack_id:
  - T1562.001
  - T1562
  observable:
  - name: ComputerName
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - ComputerName
  - EventCode
  - Message
  - User
  - Sid
  risk_score: 81
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/olympic_destroyer/system.log
    source: WinEventLog:System
    sourcetype: WinEventLog
