name: Windows DisableAntiSpyware Registry
id: 23150a40-9301-4195-b802-5bb4f43067fb
version: 1
date: '2020-11-06'
description: The search looks for the Registry Key DisableAntiSpyware set to disable. 
  This is consistent with Ryuk infections across a fleet of endpoints. 
how_to_implement: You must be ingesting data that records the process-system activity
  from your hosts to populate the Endpoint Processes data-model object. If you are
  using Sysmon, you will need a Splunk Universal Forwarder on each endpoint from which
  you want to collect data.
type: ESCU
references: []
author: Rod Soto, Jose Hernandez, Splunk
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Registry where Registry.registry_key_name="DisableAntiSpyware" AND
  Registry.registry_value_name="DWORD (0x00000000)" by Registry.dest Registry.user Registry.registry_path Registry.registry_value_name
  | `drop_dm_object_name(Registry)` 
  | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)` 
  | `windows_disableantispyware_registry_filter`'
known_false_positives: It is unusual to turn this feature on a Windows system since it is a default security control, although it is not rare for some policies to disable it. 
  Although no false positives have been identified, use the provided filter macro to tune the search.
tags:
  mitre_attack_id:
    - T1562.001
  analytics_story:
  - Ryuk Ransomware
  kill_chain_phases:
  - Delivery
  cis20:
  - CIS 8
  nist:
  - PR.PT
  - DE.CM
  security_domain: endpoint
  asset_type: Endpoint
