name: Windows Access Token Winlogon Duplicate Handle In Uncommon Path
id: b8f7ed6b-0556-4c84-bffd-839c262b0278
version: 1
date: '2022-08-24'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: The following analytic identifies a process requesting access in winlogon.exe
  to duplicate its handle with a non-common or public process source path. This technique
  was seen where adversaries attempt to gain privileges to their process. This duplicate
  handle access technique, may refer to a malicious process duplicating the process
  token of winlogon.exe and using it to a new process instance. Winlogon.exe is the
  common targeted process of this technique because it contains high privileges and
  security tokens.
data_source:
- Sysmon Event ID 1
search: '`sysmon` EventCode=10  TargetImage IN("*\\system32\\winlogon.exe*", "*\\SysWOW64\\winlogon.exe*")
  AND GrantedAccess = 0x1040 AND NOT (SourceImage IN("C:\\Windows\\*", "C:\\Program
  File*", "%systemroot%\\*")) | stats count min(_time) as firstTime max(_time) as
  lastTime by Computer SourceImage TargetImage SourceProcessGUID TargetProcessGUID SourceProcessId
  TargetProcessId GrantedAccess CallTrace | rename Computer as dest| `security_content_ctime(firstTime)` |
  `security_content_ctime(lastTime)` | `windows_access_token_winlogon_duplicate_handle_in_uncommon_path_filter`'
how_to_implement: To successfully implement this search, you must be ingesting data
  that records process activity from your hosts to populate the endpoint data model
  in the processes node. If you are using Sysmon, you must have at least version 6.0.4
  of the Sysmon TA.
known_false_positives: It is possible legitimate applications will request access
  to winlogon, filter as needed.
references:
- https://docs.microsoft.com/en-us/windows/win32/api/handleapi/nf-handleapi-duplicatehandle
- https://attack.mitre.org/techniques/T1134/001/
tags:
  analytic_story:
  - Brute Ratel C4
  asset_type: Endpoint
  confidence: 70
  impact: 70
  message: A process $SourceImage$ is duplicating the handle token of winlogon.exe on $dest$
  mitre_attack_id:
  - T1134.001
  - T1134
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: SourceImage
    type: Process Name
    role:
    - Parent Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - SourceImage
  - TargetImage
  - SourceProcessGUID
  - TargetProcessGUID
  - SourceProcessId
  - TargetProcessId
  - GrantedAccess
  - CallTrace
  - Computer
  - user_id
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/brute_ratel/brute_duplicate_token/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
