author: Teoderick Contreras, Splunk
datamodel:
- Endpoint.Processes
date: '2022-02-22'
description: This analytic is to look for wmi commandlines to execute or create process.
  This technique was used by adversaries or threat actor to execute their malicious
  payload in local or remote host. This hunting query is a good pivot to start to
  look further which process trigger the wmi or what process it execute locally or
  remotely.
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
id: 0661c2de-93de-11ec-9833-acde48001122
known_false_positives: Administrators may execute this command for testing or auditing.
name: Windows WMI Process Call Create
references:
- https://github.com/NVISOsecurity/sigma-public/blob/master/rules/windows/process_creation/win_susp_wmi_execution.yml
- https://github.com/redcanaryco/atomic-red-team/blob/2b804d25418004a5f1ba50e9dc637946ab8733c7/atomics/T1047/T1047.md
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_wmic` Processes.process
  = "* process *" Processes.process = "* call *" Processes.process = "* create *"
  by Processes.parent_process_name Processes.parent_process Processes.process_name
  Processes.process Processes.original_file_name Processes.process_id Processes.parent_process_path
  Processes.process_guid Processes.parent_process_id Processes.dest Processes.user
  Processes.process_path | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_wmi_process_call_create_filter`'
tags:
  analytic_story:
  - Suspicious WMI Use
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1047/atomic_red_team/windows-sysmon.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: process with $process$ commandline executed in $dest$
  mitre_attack_id:
  - T1047
  nist:
  - DE.CM
  observable:
  - name: user
    role:
    - Victim
    type: User
  - name: dest
    role:
    - Victim
    type: Hostname
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.original_file_name
  - Endpoint.Processes.parent_process
  - Endpoint.Processes.parent_process_id
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.parent_process_path
  - Endpoint.Processes.process
  - Endpoint.Processes.process_guid
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.process_path
  - Endpoint.Processes.user
  - _time
  risk_score: 25
  security_domain: endpoint
type: Hunting
version: 1
