name: Windows Driver Load Non-Standard Path
id: 9216ef3d-066a-4958-8f27-c84589465e62
version: 1
date: '2022-04-04'
author: Michael Haag, Splunk
type: TTP
datamodel: []
description: The following analytic uses Windows EventCode 7045 to identify new Kernel
  Mode Drivers being loaded in Windows from a non-standard path. Note that, adversaries
  may move malicious or vulnerable drivers into these paths and load up. The idea
  is that this analytic provides visibility into drivers loading in non-standard file
  paths.
search: '`wineventlog_system` EventCode=7045 Service_Type="kernel mode driver" NOT
  (Service_File_Name IN ("*\\Windows\\*", "*\\Program File*", "*\\systemroot\\*","%SystemRoot%*",
  "system32\*")) | stats count min(_time) as firstTime max(_time) as lastTime by ComputerName
  EventCode Service_File_Name Service_Name Service_Start_Type Service_Type | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_driver_load_non_standard_path_filter`'
how_to_implement: To implement this analytic, the Windows EventCode 7045 will need
  to be logged. The Windows TA for Splunk is also recommended.
known_false_positives: False positives may be present based on legitimate third party
  applications needing to install drivers. Filter, or allow list known good drivers
  consistently being installed in these paths.
references:
- https://redcanary.com/blog/tracking-driver-inventory-to-expose-rootkits/
- https://attack.mitre.org/techniques/T1014/
- https://www.fuzzysecurity.com/tutorials/28.html
tags:
  analytic_story:
  - Windows Drivers
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 60
  context:
  - Source:Endpoint
  - Stage:Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1068/drivers/7045_kerneldrivers.log
  impact: 60
  kill_chain_phases:
  - Installation
  message: A kernel mode driver was loaded from a non-standard path on $ComputerName$.
  mitre_attack_id:
  - T1014
  nist:
  - DE.CM
  observable:
  - name: ComputerName
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - ComputerName
  - EventCode
  - Service_File_Name
  - Service_Name
  - Service_Start_Type
  - Service_Type
  risk_score: 36
  security_domain: endpoint
