name: Windows Scheduled Task Created Via XML
id: 7e03b682-3965-4598-8e91-a60a40a3f7e4
version: 3
date: '2024-05-17'
author: Teoderick Contreras, Splunk
status: production
type: TTP
data_source:
- Sysmon EventID 1
description: 'The following analytic detects the creation of scheduled tasks in Windows
  using schtasks.exe with the -create flag and an XML parameter. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on command-line
  executions and process details. This activity is significant as it is a common technique
  for establishing persistence or achieving privilege escalation, often used by malware
  like Trickbot and Winter-Vivern. If confirmed malicious, this could allow attackers
  to maintain access, execute additional payloads, and potentially lead to data theft
  or ransomware deployment.'
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=schtasks.exe
  Processes.process=*create* Processes.process="* /xml *" by Processes.user  Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.process Processes.process_guid
  Processes.process_id Processes.parent_process_guid Processes.dest | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_scheduled_task_created_via_xml_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: It is possible scripts or administrators may trigger this analytic.
  Filter as needed based on parent process, application.
references:
- https://twitter.com/_CERT_UA/status/1620781684257091584
- https://cert.gov.ua/article/3761104
tags:
  analytic_story:
  - Winter Vivern
  - CISA AA23-347A
  - Scheduled Tasks
  asset_type: Endpoint
  confidence: 70
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/winter-vivern/scheduledtask/sysmon.log
  impact: 70
  message: A scheduled task process, $process_name$, with 'create' or 'delete' commands
    present in the command line.
  mitre_attack_id:
  - T1053.005
  - T1053
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_name
  - Processes.process_id
  - Processes.process
  - Processes.dest
  - Processes.user
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/winter-vivern/scheduledtask/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
