name: Windows Kerberos Auth Ticket Request
id: e3ef244e-0a67-11ec-abf2-acde48001122
version: 1
date: '2021-08-31'
author: Michael Haag, Mauricio Velazco, Splunk
type: TTP
datamodel: []
description: The following analytic identifes Event Code 4768, A Kerberos authentication ticket (TGT) was requested, successfull occurs. This behavior has been identified to assist with detecting PetitPotam, CVE-2021-36942.
  This analytic will require tuning, we recommend filtering Account_Name to Domain Controllers for your environment.
search: '`wineventlog_security` EventCode=4768 Client_Address!="::1" Certificate_Thumbprint!="" Account_Name=*
  | stats count min(_time) as firstTime max(_time) as lastTime by dest, Account_Name, Client_Address, action, Message
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)`
  | `windows_kerberos_auth_ticket_request_filter`'
how_to_implement: The following analytic requires Event Code 4768. Ensure that it is logging no Domain Controllers and appearing in Splunk.
known_false_positives: False positives are possible if the environment is using certificates for authentication. 
references:
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=4768
  - https://isc.sans.edu/forums/diary/Active+Directory+Certificate+Services+ADCS+PKI+domain+admin+vulnerability/27668/
tags:
  analytic_story:
  - PetitPotam
  dataset: []
  kill_chain_phases:
  - Exploitation
  - Lateral Movement
  mitre_attack_id:
  - T1003
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - dest
  - Account_Name
  - Client_Address
  - action
  - Message
  security_domain: endpoint
  impact: 80
  confidence: 70
  # (impact * confidence)/100
  risk_score: 56
  context:
  - Source:Endpoint
  - Stage:Credential Access
  message: A certificate was requested in a non-standard manner against $dest$, potentially related to CVE-2021-36942, PetitPotam.
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim