name: Windows Process With NamedPipe CommandLine
id: e64399d4-94a8-11ec-a9da-acde48001122
version: 1
date: '2022-02-23'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: This analytic is to look for process commandline that contains named
  pipe. This technique was seen in some adversaries, threat actor and malware like
  olympic destroyer to communicate to its other child processes after process injection
  that serve as defense evasion and privilege escalation. On the other hand this analytic
  may catch some normal process that using this technique for example browser application.
  In that scenario we include common process path we've seen during testing that cause
  false positive which is the program files. False positive may still be arise if
  the normal application is in other folder path.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process = "*\\\\.\\pipe\\*"
  NOT (Processes.process_path IN ("*\\program files*")) by Processes.parent_process_name
  Processes.parent_process Processes.process_name Processes.process Processes.original_file_name
  Processes.process_id Processes.parent_process_path Processes.process_guid Processes.parent_process_id
  Processes.dest Processes.user Processes.process_path | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_process_with_namedpipe_commandline_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: Normal browser application may use this technique. Please update
  the filter macros to remove false positives.
references:
- https://blog.talosintelligence.com/2018/02/olympic-destroyer.html
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/olympic_destroyer/sysmon.log
  impact: 70
  kill_chain_phases:
  - Exploitation
  message: Process with named pipe in $process$ on $dest$
  mitre_attack_id:
  - T1055
  nist:
  - DE.CM
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  - Processes.process_guid
  risk_score: 49
  security_domain: endpoint
  asset_type: Endpoint
