name: Windows Change Default File Association For No File Ext
id: dbdf52ad-d6a1-4b68-975f-0a10939d8e38
version: 1
date: '2022-11-30'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: This analytic is developed to detect suspicious process commandline to
  change or set the default file association of a file without file extension with
  notepad.exe. This technique was seen in some APT and ransomware Prestige where it
  set/modify the default process to run file association, like .txt to notepad.exe.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime  from datamodel=Endpoint.Processes where `process_reg` AND Processes.process="*
  add *" AND Processes.process="* HKCR\\*" AND Processes.process="*\\shell\\open\\command*"
  AND  Processes.process= *Notepad.exe* by  Processes.process_name Processes.original_file_name
  Processes.process Processes.process_id Processes.process_guid Processes.parent_process_name
  Processes.parent_process Processes.parent_process_guid Processes.dest Processes.user
  | `drop_dm_object_name(Processes)` | rex field=process "Notepad\.exe (?<file_name_association>.*$)"
  | rex field=file_name_association "\.(?<extension>[^\.]*$)" | where isnull(extension)
  and isnotnull(file_name_association) | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_change_default_file_association_for_no_file_ext_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: unknown
references:
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
  analytic_story:
  - Prestige Ransomware
  asset_type: Endpoint
  confidence: 100
  impact: 80
  message: process with commandline $process$ set or change the file association of
    a file with no file extension in $dest$
  mitre_attack_id:
  - T1546.001
  - T1546
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/prestige_ransomware/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
