name: Windows Indirect Command Execution Via Series Of Forfiles
id: bfdaabe7-3db8-48c5-80c1-220f9b8f22be
version: 1
date: '2022-11-30'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: This analytic is developed to detect suspicious excessive usage of forfiles.exe
  process. This event was seen in post exploitation tool WINPEAS that was used by
  Ransomware Prestige. Forfiles command lets you run a command on or pass arguments
  to multiple files. This Windows OS built-in tool being abused to list all files
  in specific directory or drive.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  values(Processes.process_guid) as process_guid  values(Processes.process_name) as
  process_name count min(_time) as firstTime max(_time) as lastTime  from datamodel=Endpoint.Processes
  where Processes.process_name = "forfiles.exe" OR Processes.original_file_name =
  "forfiles.exe" by Processes.parent_process_name Processes.parent_process Processes.dest
  Processes.user _time span=1m | where count >=20 | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_indirect_command_execution_via_series_of_forfiles_filter`'
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
known_false_positives: unknown
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/forfiles
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
  analytic_story:
  - Windows Post-Exploitation
  - Prestige Ransomware
  asset_type: Endpoint
  confidence: 30
  impact: 30
  message: excessive forfiles process execution in $dest$
  mitre_attack_id:
  - T1202
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 9
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/winpeas/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
