name: Windows Access Token Manipulation SeDebugPrivilege
id: 6ece9ed0-5f92-4315-889d-48560472b188
version: 1
date: '2022-08-24'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: The following analytic identifies a suspicious process enabling the "SeDebugPrivilege" privilege token. 
  This technique was being abused by adversaries, threat actors and red-teamers to gain debug privileges on their malware process 
  to be able to access or debug a process to dump credentials or to inject malicious code. This anomaly detection can be a good pivot 
  to catch possible mimikatz, BRC4 or malware elevating their process privileges.
search: '`wineventlog_security` EventCode=4703 EnabledPrivilegeList = "*SeDebugPrivilege*" AND NOT(ProcessName IN ("*\\Program File*", "*\\System32\\lsass.exe*", "*\\SysWOW64\\lsass.exe*", "*\\SysWOW64\\svchost.exe*", "*\\System32\\svchost.exe*"))
  | stats count min(_time) as firstTime max(_time) as lastTime by ProcessName ProcessId SubjectDomainName SubjectUserName SubjectUserSid TargetUserName TargetLogonId TargetDomainName EnabledPrivilegeList action
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_access_token_manipulation_sedebugprivilege_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  Windows Security Event Logs with 4703 EventCode enabled. The Windows TA is also
  required.
known_false_positives: we've seen normal process in system32 folder path and browser application doing this technique. 
  Filter as needed.
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4703
tags:
  analytic_story:
  - Brute Ratel C4
  asset_type:  Endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 60
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/brute_ratel/sedebugprivilege_token/security-xml.log
  impact: 60
  kill_chain_phases:
  - Exploitation
  message: a process $Process_Name$ adjust its privileges with SeDebugPrivilege in $Computer$
  mitre_attack_id:
  - T1134.002
  - T1134
  nist:
  - DE.CM
  observable:
  - name: ComputerName
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Process_Name 
  - Security_ID 
  - action 
  - result 
  - Process_ID 
  - Message 
  - member_dn 
  - ComputerName 
  - user
  risk_score: 36
  security_domain: endpoint
