name: Windows DNS Gather Network Info
id: 347e0892-e8f3-4512-afda-dc0e3fa996f3
version: 2
date: '2024-05-30'
author: Teoderick Contreras, Splunk
type: Anomaly
status: production
data_source:
- Sysmon EventID 1
description: The following analytic detects the use of the dnscmd.exe command to enumerate
  DNS records. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process command-line executions. This activity is significant as it
  may indicate an adversary gathering network information, a common precursor to more
  targeted attacks. If confirmed malicious, this behavior could enable attackers to
  map the network, identify critical assets, and plan subsequent actions, potentially
  leading to data exfiltration or further compromise of the network.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name = "dnscmd.exe"
  Processes.process = "* /enumrecords *" by Processes.parent_process Processes.process_name
  Processes.process_id Processes.process_guid Processes.process Processes.user Processes.dest
  | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_dns_gather_network_info_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: network administrator can execute this command to enumerate
  DNS record. Filter or add other paths to the exclusion as needed.
references:
- https://cert.gov.ua/article/3718487
- https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
tags:
  analytic_story:
  - Sandworm Tools
  - Volt Typhoon
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: A process commandline $process$ to enumerate dns record in $dest$
  mitre_attack_id:
  - T1590.002
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 25
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1590.002/enum_dns_record/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
