name: Windows Service Create with Tscon
id: c13b3d74-6b63-4db5-a841-4206f0370077
version: 2
date: '2024-05-30'
author: Michael Haag, Splunk
type: TTP
status: production
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
description: The following analytic detects potential RDP Hijacking attempts by identifying
  the creation of a Windows service using sc.exe with a binary path that includes
  tscon.exe. This detection leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process creation events and command-line arguments. This activity
  is significant as it indicates an attacker may be trying to hijack a disconnected
  RDP session, posing a risk of unauthorized access. If confirmed malicious, the attacker
  could gain control over an existing user session, leading to potential data theft
  or further system compromise.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=sc.exe
  Processes.process="*/dest:rdp-tcp*" by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_service_create_with_tscon_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: False positives may arise in the RDP Hijacking analytic when
  legitimate administrators access remote sessions for maintenance or troubleshooting
  purposes. These activities might resemble an attacker''s attempt to hijack a disconnected
  session, leading to false alarms. To mitigate the risk of false positives and improve
  the overall security posture, organizations can implement Group Policy to automatically
  disconnect RDP sessions when they are complete. By enforcing this policy, administrators
  ensure that disconnected sessions are promptly terminated, reducing the window of
  opportunity for an attacker to hijack a session. Additionally, organizations can
  also implement access control mechanisms and monitor the behavior of privileged
  accounts to further enhance security and reduce the chances of false positives in
  RDP Hijacking detection.
references:
- https://doublepulsar.com/rdp-hijacking-how-to-hijack-rds-and-remoteapp-sessions-transparently-to-move-through-an-da2a1e73a5f6
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1563.002/T1563.002.md
tags:
  analytic_story:
  - Active Directory Lateral Movement
  asset_type: Endpoint
  confidence: 80
  impact: 80
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ attempting to hijack a RDP session.
  mitre_attack_id:
  - T1563.002
  - T1563
  - T1543.003
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 64
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1563.002/rdphijack/tscon_windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
