name: Windows High File Deletion Frequency
id: 45b125c4-866f-11eb-a95a-acde48001122
version: 1
date: '2023-04-14'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: This search looks for high frequency of file deletion relative to process
  name and process id. These events usually happen when the ransomware tries to encrypt
  the files with the ransomware file extensions and sysmon treat the original files
  to be deleted as soon it was replace as encrypted data.
data_source:
- Sysmon Event ID 23
search: '`sysmon` EventCode=23 TargetFilename IN ("*.cmd", "*.ini","*.gif", "*.jpg",
  "*.jpeg", "*.db", "*.ps1", "*.doc*", "*.xls*", "*.ppt*", "*.bmp","*.zip", "*.rar",
  "*.7z", "*.chm", "*.png", "*.log", "*.vbs", "*.js", "*.vhd", "*.bak", "*.wbcat",
  "*.bkf" , "*.backup*", "*.dsk", "*.win") | stats values(TargetFilename) as deleted_files
  min(_time) as firstTime max(_time) as lastTime count by Computer user EventCode
  Image ProcessID |where count >=100 | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_high_file_deletion_frequency_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the deleted target file name, process name and process id  from your endpoints.
  If you are using Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
known_false_positives: user may delete bunch of pictures or files in a folder.
references:
- https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
  analytic_story:
  - Clop Ransomware
  - DarkCrystal RAT
  - Swift Slicer
  - Data Destruction
  - WhisperGate
  - Sandworm Tools
  asset_type: Endpoint
  confidence: 80
  impact: 90
  message: High frequency file deletion activity detected on host $Computer$
  mitre_attack_id:
  - T1485
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: Computer
    type: Endpoint
    role:
    - Victim
  - name: deleted_files
    type: File Name
    role:
    - Target
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - EventCode
  - TargetFilename
  - Computer
  - user
  - Image
  - ProcessID
  - _time
  risk_score: 72
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/clop/clop_a/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
