name: Windows Executable in Loaded Modules
id: 3e27af56-fcf0-4113-988d-24969b062be7
version: 2
date: '2024-05-21'
author: Teoderick Contreras, Splunk
status: production
type: TTP
data_source:
- Sysmon EventID 7
description: The following analytic identifies instances where executable files (.exe)
  are loaded as modules, detected through 'ImageLoaded' events in Sysmon logs. This
  method leverages Sysmon EventCode 7 to track unusual module loading behavior, which
  is significant as it deviates from the norm of loading .dll files. This activity
  is crucial for SOC monitoring because it can indicate the presence of malware like
  NjRAT, which uses this technique to load malicious modules. If confirmed malicious,
  this behavior could allow attackers to execute arbitrary code, maintain persistence,
  and further compromise the host system.
search: '`sysmon` EventCode=7 ImageLoaded= *.exe | stats count min(_time) as firstTime
  max(_time) as lastTime by Image ImageLoaded Signed SignatureStatus OriginalFileName
  process_name Computer EventCode ProcessId Hashes IMPHASH | rename Computer as dest
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_executable_in_loaded_modules_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name and imageloaded executions from your endpoints. If you
  are using Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
known_false_positives: unknown.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.njrat
tags:
  analytic_story:
  - NjRAT
  asset_type: Endpoint
  confidence: 80
  impact: 80
  message: An executable $ImageLoaded$ loaded by $Image$ on $dest$
  mitre_attack_id:
  - T1129
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 64
  required_fields:
  - _time
  - Image
  - ImageLoaded
  - Signed
  - SignatureStatus
  - OriginalFileName
  - process_name
  - Computer
  - EventCode
  - ProcessId
  - Hashes
  - IMPHASH
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1129/executable_shared_modules/image_loaded_exe.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
