name: Windows AD DSRM Account Changes
id: 08cb291e-ea77-48e8-a95a-0799319bf056
version: 1
date: '2022-09-08'
author: Dean Luxton
type: TTP
status: production
data_source:
- Sysmon Event ID 13
description: Aside from being used to promote genuine domain controllers, the DSRM (Directory Services Restore Mode)
  account can be used to persist within a Domain. A DC can be configured to allow the DSRM account to logon & be
 used in the same way as a local administrator account. This detection is looking for alterations to the behaviour 
 of the account via registry.  
search: '| tstats `security_content_summariesonly` min(_time) as _time from datamodel=Endpoint.Registry
  where Registry.registry_path= "*\\System\\CurrentControlSet\\Control\\Lsa\\DSRMAdminLogonBehavior"
  Registry.registry_value_data IN ("*1","*2") by Registry.action Registry.registry_path
  Registry.registry_value_data Registry.registry_value_type Registry.process_guid
  | `drop_dm_object_name(Registry)`
  | join type=outer process_guid [| tstats `security_content_summariesonly` count
  FROM datamodel=Endpoint.Processes by Processes.user Processes.process_name Processes.process
  Processes.dest Processes.parent_process_name Processes.parent_process Processes.process_guid
  | `drop_dm_object_name(Processes)`]
  | table _time action dest user parent_process_name parent_process process_name process
  process_guid registry_path registry_value_data registry_value_type | `windows_ad_dsrm_account_changes_filter`'
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
known_false_positives: Disaster recovery events. 
references:
- https://adsecurity.org/?p=1714
tags:
  analytic_story:
  - Sneaky Active Directory Persistence Tricks
  - Windows Registry Abuse
  - Windows Persistence Techniques
  asset_type: Endpoint
  confidence: 100
  impact: 100
  message: DSRM Account Changes Initiated on $dest$ by $user$
  mitre_attack_id:
  - T1098
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_value_data
  - Registry.registry_path
  - Registry.dest
  - Registry.user
  risk_score: 100
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1098/dsrm_account/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog