name: Windows IIS Components Module Failed to Load
id: 40c2ba5b-dd6a-496b-9e6e-c9524d0be167
version: 2
date: '2024-05-15'
author: Michael Haag, Splunk
status: production
type: Anomaly
description: The following analytic detects when an IIS Module DLL fails to load due
  to a configuration problem, identified by EventCode 2282. This detection leverages
  Windows Application event logs to identify repeated failures in loading IIS modules.
  Such failures can indicate misconfigurations or potential tampering with IIS components.
  If confirmed malicious, this activity could lead to service disruptions or provide
  an attacker with opportunities to exploit vulnerabilities within the IIS environment.
  Immediate investigation is required to determine the legitimacy of the failing module
  and to mitigate any potential security risks.
data_source:
- Windows Event Log Application 2282
search: '`wineventlog_application` EventCode=2282 | stats  count min(_time) as firstTime
  max(_time) as lastTime by  EventCode dest Name ModuleDll | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_iis_components_module_failed_to_load_filter`'
how_to_implement: IIS must be installed and Application event logs must be collected
  in order to utilize this analytic.
known_false_positives: False positives will be present until all module failures are
  resolved or reviewed.
references:
- https://social.technet.microsoft.com/wiki/contents/articles/21757.event-id-2282-iis-worker-process-availability.aspx
- https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
- https://www.crowdstrike.com/wp-content/uploads/2022/05/crowdstrike-iceapple-a-novel-internet-information-services-post-exploitation-framework-1.pdf
- https://unit42.paloaltonetworks.com/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
- https://www.secureworks.com/research/bronze-union
- https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1505.004
- https://strontic.github.io/xcyclopedia/library/appcmd.exe-055B2B09409F980BF9B5A3969D01E5B2.html
tags:
  analytic_story:
  - IIS Components
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: A new IIS Module has been loaded and should be reviewed on $dest$.
  mitre_attack_id:
  - T1505
  - T1505.004
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - OpCode
  - EventCode
  - ComputerName
  - Message
  risk_score: 25
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1505.004/2282_windows-application.log
    source: XmlWinEventLog:Application
    sourcetype: XmlWinEventLog
    update_timestamp: true
