name: Windows Registry BootExecute Modification
id: eabbac3a-45aa-4659-920f-6b8cff383fb8
version: 2
date: '2024-05-29'
author: Michael Haag, Splunk
status: production
type: TTP
data_source:
- Sysmon EventID 12
- Sysmon EventID 13
description: The following analytic detects modifications to the BootExecute registry
  key, which manages applications and services executed during system boot. It leverages
  data from the Endpoint.Registry data model, focusing on changes to the registry
  path "HKLM\\System\\CurrentControlSet\\Control\\Session Manager\\BootExecute". This
  activity is significant because unauthorized changes to this key can indicate attempts
  to achieve persistence, load malicious code, or tamper with the boot process. If
  confirmed malicious, this could allow an attacker to maintain persistence, execute
  arbitrary code at boot, or disrupt system operations.
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  WHERE Registry.registry_path="HKLM\\System\\CurrentControlSet\\Control\\Session
  Manager\\BootExecute" BY _time span=1h Registry.dest Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.registry_value_data Registry.process_guid,
  Registry.action | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| `windows_registry_bootexecute_modification_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on Windows Registry that include the name of the path and key responsible for the
  changes from your endpoints into the `Endpoint` datamodel in the `Registry` node.
  In addition, confirm the latest CIM App 4.20 or higher is installed and the latest
  TA for the endpoint product.
known_false_positives: False positives may be present and will need to be filtered.
references:
- https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
tags:
  analytic_story:
  - Windows BootKits
  asset_type: Endpoint
  atomic_guid: []
  confidence: 100
  impact: 100
  message: The Registry BootExecute value was modified on $dest$ and should be reviewed
    immediately.
  mitre_attack_id:
  - T1542
  - T1547.001
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 100
  required_fields:
  - _time
  - Registry.dest
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.registry_value_name
  - Registry.registry_value_data
  - Registry.process_guid
  - Registry.action
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1547.001/atomic_red_team/bootexecute-windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
