name: Windows Scheduled Task with Highest Privileges
id: 2f15e1a4-0fc2-49dd-919e-cbbe60699218
version: 2
date: '2024-05-20'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: 'The following analytic detects the creation of a new scheduled task
  with the highest execution privileges via Schtasks.exe. It leverages Endpoint Detection
  and Response (EDR) logs to monitor for specific command-line parameters (''/rl''
  and ''highest'') in schtasks.exe executions. This activity is significant as it
  is commonly used in AsyncRAT attacks for persistence and privilege escalation. If
  confirmed malicious, this could allow an attacker to maintain persistent access
  and execute tasks with elevated privileges, potentially leading to unauthorized
  system access and data breaches.'
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime  from datamodel=Endpoint.Processes where Processes.process_name = "schtasks.exe"
  Processes.process = "*/rl *" Processes.process = "* highest *" by Processes.process_name
  Processes.parent_process_name Processes.parent_process Processes.process Processes.process_guid
  Processes.dest Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_scheduled_task_with_highest_privileges_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: False positives may arise from legitimate applications that
  create tasks to run as SYSTEM. Therefore, it's recommended to adjust filters based
  on parent process or modify the query to include world writable paths for restriction.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat
tags:
  analytic_story:
  - CISA AA23-347A
  - Scheduled Tasks
  - RedLine Stealer
  - AsyncRAT
  asset_type: Endpoint
  confidence: 80
  impact: 80
  message: a $process_name$ creating a schedule task $process$ with highest run level
    privilege in $dest$
  mitre_attack_id:
  - T1053
  - T1053.005
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 64
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1053.005/asyncrat_highest_priv_schtasks/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
