name: Windows System Discovery Using Qwinsta
id: 2e765c1b-144a-49f0-93d0-1df4287cca04
version: 1
date: '2022-10-21'
author: Teoderick Contreras, Splunk
status: production
type: Hunting
description: The following analytic identifies the execution of qwinsta.exe executable
  in Windows Operating System. This Windows executable file can display information
  about sessions on a remote desktop session host server. The information includes
  servername, sessionname, username and many more. This tool is being abused of Qakbot
  malware to gather information to the targeted or compromised host that will be send
  back to its Command And Control server.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name = "qwinsta.exe"
  OR Processes.original_file_name = "qwinsta.exe" by Processes.parent_process Processes.parent_process_name
  Processes.process_name Processes.process_id Processes.process_guid Processes.process
  Processes.user Processes.dest Processes.parent_process_id Processes.original_file_name
  | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)` |`security_content_ctime(lastTime)`
  | `windows_system_discovery_using_qwinsta_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: Administrator may execute this commandline tool for auditing
  purposes. Filter as needed.
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/qwinsta
- https://securelist.com/qakbot-technical-analysis/103931/
tags:
  analytic_story:
  - Qakbot
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: System qwinsta domain discovery on $dest$
  mitre_attack_id:
  - T1033
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 25
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1033/qakbot_discovery_cmdline/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
