name: Windows Multi hop Proxy TOR Website Query
id: 4c2d198b-da58-48d7-ba27-9368732d0054
version: 1
date: '2022-09-16'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: The following analytic identifies a dns query to a known TOR proxy website.
  This technique was seen in several adversaries, threat actors and malware like AgentTesla
  to To disguise the source of its malicious traffic. adversaries may chain together
  multiple proxies. This Anomaly detection might be a good pivot for a process trying
  to download or use TOR proxies in a compromised host machine.
data_source:
- Sysmon EventID 22
search: '`sysmon` EventCode=22 QueryName IN ("*.torproject.org", "www.theonionrouter.com")
  | stats count min(_time) as firstTime max(_time) as lastTime by Image QueryName
  QueryStatus ProcessId  Computer | rename Computer as dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_multi_hop_proxy_tor_website_query_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name and sysmon eventcode = 22 dns query events from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: third party application may use this proxies if allowed in
  production environment. Filter is needed.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.agent_tesla
tags:
  analytic_story:
  - AgentTesla
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: a process $Image$ is having a dns query in a tor domain $QueryName$ in
    $dest$
  mitre_attack_id:
  - T1071.003
  - T1071
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Image
  - QueryName
  - QueryStatus
  - ProcessId
  - dest
  risk_score: 25
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/agent_tesla/agent_tesla_tor_dns_query/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
