name: Windows System LogOff Commandline
id: 74a8133f-93e7-4b71-9bd3-13a66124fd57
version: 1
date: '2022-07-27'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: The following analytic identifies Windows commandline to logoff a windows
  host machine. This technique was seen in several APT, RAT like dcrat and other commodity
  malware to shutdown the machine to add more impact, interrupt access, aid destruction
  of the system like wiping disk or inhibit system recovery. This TTP is a good pivot
  to check why application trigger this commandline which is not so common way to
  logoff a machine.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where (Processes.process_name = shutdown.exe OR Processes.original_file_name = shutdown.exe)
  Processes.process="*shutdown*" Processes.process="* /l*" Processes.process="* /t*"
  by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.original_file_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_system_logoff_commandline_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: Administrator may execute this commandline to trigger shutdown,
  logoff or restart the host machine.
references:
- https://attack.mitre.org/techniques/T1529/
- https://www.mandiant.com/resources/analyzing-dark-crystal-rat-backdoor
tags:
  analytic_story:
  - DarkCrystal RAT
  asset_type: Endpoint
  confidence: 80
  impact: 70
  message: Process name $process_name$ is seen to execute logoff commandline on $dest$
  mitre_attack_id:
  - T1529
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 56
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/dcrat/reboot_logoff_commandline/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
