name: Windows PowerView AD Access Control List Enumeration
id: 39405650-c364-4e1e-a740-32a63ef042a6
version: 2
date: '2024-05-17'
author: Mauricio Velazco, Splunk
status: production
type: TTP
data_source:
- Powershell Script Block Logging 4104
description: The following analytic detects the execution of PowerView PowerShell
  cmdlets `Get-ObjectAcl` or `Get-DomainObjectAcl`, which are used to enumerate Access
  Control List (ACL) permissions for Active Directory objects. It leverages Event
  ID 4104 from PowerShell Script Block Logging to identify this activity. This behavior
  is significant as it may indicate an attempt to discover weak permissions in Active
  Directory, potentially leading to privilege escalation. If confirmed malicious,
  attackers could exploit these permissions to gain unauthorized access or escalate
  their privileges within the network.
search: ' `powershell` EventCode=4104  (ScriptBlockText=*get-objectacl* OR ScriptBlockText=*Get-DomainObjectAcl*
  ) | stats count min(_time) as firstTime max(_time) as lastTime by Opcode Computer
  UserID EventCode ScriptBlockText | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_powerview_ad_access_control_list_enumeration_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.=
known_false_positives: Administrators may leverage PowerView for legitimate purposes,
  filter as needed.
references:
- https://attack.mitre.org/techniques/T1078/002/
- https://medium.com/r3d-buck3t/enumerating-access-controls-in-active-directory-c06e2efa8b89
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/abusing-active-directory-acls-aces
- https://powersploit.readthedocs.io/en/latest/Recon/Get-DomainObjectAcl/
tags:
  analytic_story:
  - Active Directory Discovery
  - Active Directory Privilege Escalation
  - Rhysida Ransomware
  asset_type: Endpoint
  confidence: 50
  impact: 40
  message: PowerView AD acccess control list enumeration detected on $Computer$
  mitre_attack_id:
  - T1078.002
  - T1069
  observable:
  - name: Computer
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - ScriptBlockText
  - Opcode
  - UserID
  risk_score: 20
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1078.002/powerview_acl_enumeration/windows-powershell.log
    source: XmlWinEventLog:Microsoft-Windows-PowerShell/Operational
    sourcetype: XmlWinEventLog
