name: Windows Files and Dirs Access Rights Modification Via Icacls
id: c76b796c-27e1-4520-91c4-4a58695c749e
version: 1
date: '2023-06-06'
author: Teoderick Contreras, Splunk
status: production
type: TTP
data_source:
- Sysmon Event ID 1
description: This analytic aims to identify potential adversaries who manipulate the
  security permissions of specific files or directories. This technique is frequently
  observed in the tradecraft of Advanced Persistent Threats (APTs) and coinminer scripts.
  By modifying the security permissions, adversaries seek to evade detection and impede
  access to their component files. Such actions indicate a deliberate effort to maintain
  control over compromised systems and hinder investigation or remediation efforts.
  Detecting these security permission changes can serve as a valuable indicator of
  an ongoing attack and enable timely response to mitigate the impact of the adversary's
  activities.
search: '| tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name IN( "icacls.exe",
  "cacls.exe","xcacls.exe") AND Processes.process IN ("*:R*", "*:W*", "*:F*", "*:C*",,
  "*:N*","*/P*", "*/E*") by Processes.parent_process_name Processes.parent_process
  Processes.process_name Processes.process Processes.process_guid Processes.dest Processes.user
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_files_and_dirs_access_rights_modification_via_icacls_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Unknown. It is possible some administrative scripts use ICacls.
  Filter as needed.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.amadey
tags:
  analytic_story:
  - Amadey
  asset_type: Endpoint
  atomic_guid:
  - 3309f53e-b22b-4eb6-8fd2-a6cf58b355a9
  confidence: 70
  impact: 70
  message: Process name $process_name$ with access right modification argument executed
    by $user$ to change security permission of a specific file or directory on host
    $dest$
  mitre_attack_id:
  - T1222.001
  - T1222
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 49
  required_fields:
  - _time
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_name
  - Processes.process
  - Processes.process_guid
  - Processes.dest
  - Processes.user
  - Processes.process_id
  - Processes.process
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/amadey/access_permission/amadey_sysmon2.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
