name: Windows Credentials from Password Stores Chrome Login Data Access
id: 0d32ba37-80fc-4429-809c-0ba15801aeaf
version: 1
date: '2023-04-27'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
data_source:
- Security Event ID 4663
description: This analytic is designed to identify non-chrome processes accessing the Chrome user data file called "login data." 
  This SQLite database file contains important information related to the browser's operations on the computer. Threat actors, adversaries, 
  and malware authors have been known to exploit this file in attempts to extract and decrypt passwords saved in the Chrome browser. 
  Detecting access to the "login data" file by non-chrome processes serves as a valuable pivot for analyzing suspicious processes 
  beyond the commonly observed chrome.exe and explorer.exe executables. By monitoring for this anomaly, we can enhance our ability 
  to detect potential threats and protect sensitive information stored within the browser.
search: '`wineventlog_security` EventCode=4663 object_file_path="*\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data"
  AND NOT (process_path IN ("*:\\Windows\\explorer.exe", "*:\\Windows\\System32\\dllhost.exe", "*\\chrome.exe"))       
  | stats count min(_time) as firstTime max(_time) as lastTime by object_file_name object_file_path process_name process_path  process_id EventCode dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_credentials_from_password_stores_chrome_login_data_access_filter`'
how_to_implement: To successfully implement this search, you must ingest Windows Security
  Event logs and track event code 4663. For 4663, enable "Audit Object Access" in
  Group Policy. Then check the two boxes listed for both "Success" and "Failure."
known_false_positives: Uninstall application may access this registry to remove the entry of the target application. filter is needed.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
tags:
  analytic_story:
  - RedLine Stealer
  - Amadey
  - Warzone RAT
  asset_type: Endpoint
  confidence: 70
  impact: 70
  message: A non-chrome process $process_name$ accessing Chrome "Login Data" file on $dest$  
  mitre_attack_id:
  - T1012
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - object_file_name
  - object_file_path
  - process_name
  - process_path
  - process_id
  - EventCode
  - dest
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/redline/chrome_login_data_simulate_access/redline-login-data-security-xml.log
    source: XmlWinEventLog:Security
    sourcetype: XmlWinEventLog

