name: Windows Group Policy Object Created
id: 23add2a8-ea22-4fd4-8bc0-8c0b822373a1
version: 1
date: '2023-03-27'
author: Mauricio Velazco
status: production
type: TTP
data_source:
- Windows Security 5136
- Windows Security 5137
description: The following analytic leverages Event IDs 5136 and 51137 to identify
  the creation of a new Group Policy Object. With GPOs, system administrators can
  manage and configure applications, software operations, and user settings throughout
  an entire organization. GPOs can be abused and leveraged by adversaries to escalate
  privileges or deploy malware across an Active Directory network. As an example,
  the Lockbit ransomware malware will create new group policies on the domain controller
  that are then pushed out to every device on the network. Security teams should monitor
  the creation of new Group Policy Objects.
search: ' `wineventlog_security` EventCode=5137 OR (EventCode=5136 AttributeValue!="New
  Group Policy Object" AND (AttributeLDAPDisplayName=displayName OR AttributeLDAPDisplayName=gPCFileSysPath)
  ) ObjectClass=groupPolicyContainer | stats values(AttributeValue) as details values(SubjectUserSid)
  as User values(ObjectDN) as ObjectDN by ObjectGUID Computer | eval GPO_Name = mvindex(details,
  0) | eval GPO_Path = mvindex(details, 1) | fields - details | `windows_group_policy_object_created_filter`'
how_to_implement: To successfully implement this search, the Advanced Security Audit
  policy setting `Audit Directory Service Changes` within `DS Access` needs to be
  enabled. Furthermore, the appropriate system access control lists (SACL) need to
  be created as the used events are not logged by default. A good guide to accomplish
  this can be found here https://jgspiers.com/audit-group-policy-changes/.
known_false_positives: Group Policy Objects are created as part of regular administrative
  operations, filter as needed.
references:
- https://attack.mitre.org/techniques/T1484/
- https://attack.mitre.org/techniques/T1484/001
- https://www.trustedsec.com/blog/weaponizing-group-policy-objects-access/
- https://adsecurity.org/?p=2716
- https://www.bleepingcomputer.com/news/security/lockbit-ransomware-now-encrypts-windows-domains-using-group-policies/
- https://www.varonis.com/blog/group-policy-objects
tags:
  analytic_story:
  - Active Directory Privilege Escalation
  - Sneaky Active Directory Persistence Tricks
  asset_type: Endpoint
  confidence: 50
  impact: 80
  message: A new group policy objected was created by $User$
  mitre_attack_id:
  - T1484
  - T1484.001
  - T1078.002
  observable:
  - name: User
    type: User
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - AttributeValue
  - AttributeLDAPDisplayName
  - ObjectClass
  - SubjectUserSid
  - ObjectDN
  - ObjectGUID
  - Computer
  risk_score: 40
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1484.001/group_policy_created/windows-security.log
    source: XmlWinEventLog:Security
    sourcetype: XmlWinEventLog
