name: Windows Command Shell DCRat ForkBomb Payload
id: 2bb1a362-7aa8-444a-92ed-1987e8da83e1
version: 2
date: '2024-05-24'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: The following analytic detects the execution of a DCRat "forkbomb" payload,
  which spawns multiple cmd.exe processes that launch notepad.exe instances in quick
  succession. This detection leverages Endpoint Detection and Response (EDR) data,
  focusing on the rapid creation of cmd.exe and notepad.exe processes within a 30-second
  window. This activity is significant as it indicates a potential DCRat infection,
  a known Remote Access Trojan (RAT) with destructive capabilities. If confirmed malicious,
  this behavior could lead to system instability, resource exhaustion, and potential
  disruption of services.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` values(Processes.process) as process
  values(Processes.parent_process) as parent_process values(Processes.parent_process_id)
  as parent_process_id values(Processes.process_id) as process_id dc(Processes.parent_process_id)
  as parent_process_id_count dc(Processes.process_id) as process_id_count min(_time)
  as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=
  "cmd.exe" (Processes.process_name = "notepad.exe" OR Processes.original_file_name=
  "notepad.exe") Processes.parent_process = "*.bat*" by  Processes.parent_process_name
  Processes.process_name Processes.original_file_name Processes.parent_process Processes.dest
  Processes.user  _time span=30s | where parent_process_id_count>= 10 AND process_id_count
  >=10 | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` |
  `security_content_ctime(lastTime)` | `windows_command_shell_dcrat_forkbomb_payload_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: unknown
references:
- https://cert.gov.ua/article/405538
- https://malpedia.caad.fkie.fraunhofer.de/details/win.dcrat
- https://www.mandiant.com/resources/analyzing-dark-crystal-rat-backdoor
tags:
  analytic_story:
  - DarkCrystal RAT
  asset_type: Endpoint
  confidence: 90
  impact: 90
  message: Multiple cmd.exe processes with child process of notepad.exe executed on
    $dest$
  mitre_attack_id:
  - T1059.003
  - T1059
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 81
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/dcrat/dcrat_forkbomb/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
