name: Windows Hijack Execution Flow Version Dll Side Load
id: 8351340b-ac0e-41ec-8b07-dd01bf32d6ea
version: 1
date: '2022-08-24'
author: Teoderick Contreras, Splunk
type: Anomaly
datamodel:
- Endpoint
description: This analytic is to detect a process loading version.dll that are not in %windir%\\system32 or %windir%\\syswow64 dir path. 
  This event are seen in ransomware apt that execute malicious version.dll place same place on onedrive application that will look for this module. 
  This technique is known to be dll side loading. This technique was used to execute an agent from Brute Ratel C4 red teaming tools to serve as remote 
  admin tool to collect and compromised target host.
search: '`sysmon` EventCode=7  
  ImageLoaded = "*\\version.dll" AND (Signed = "false" OR NOT(ImageLoaded IN("*\\windows\\system32*",  "*\\windows\\syswow64\\*"))) 
  | stats count min(_time) as firstTime max(_time) as lastTime by Image ImageLoaded process_name Computer EventCode Signed ProcessId 
  | `security_content_ctime(firstTime)` 
  | `security_content_ctime(lastTime)` 
  | `windows_hijack_execution_flow_version_dll_side_load_filter`'
how_to_implement: The latest Sysmon TA 3.0 https://splunkbase.splunk.com/app/5709 will 
  add the ImageLoaded name to the process_name field, allowing this query to work. Use as an example and implement for other products.
known_false_positives: unknown
references:
- https://www.mdsec.co.uk/2022/08/part-3-how-i-met-your-beacon-brute-ratel/
tags:
  analytic_story:
  - Brute Ratel C4
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 70
  context:
  - Source:Endpoint
  - Stage:Persistence
  - Stage:Privilege Escalation
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/brute_ratel/iso_version_dll_campaign/sysmon.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: a process $Image$ loading $ImageLoaded$ as a side load dll in $Computer$
  mitre_attack_id:
  - T1574.001
  - T1574
  nist:
  - DE.CM
  observable:
  - name: Computer
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Image
  - ImageLoaded
  - process_name
  - Computer
  - EventCode
  - Signed
  - ProcessId 
  risk_score: 35
  security_domain: endpoint
