name: Windows Exfiltration Over C2 Via Invoke RestMethod
id: 06ade821-f6fa-40d0-80af-15bc1d45b3ba
version: 2
date: '2024-05-21'
author: Teoderick Contreras, Splunk
status: production
type: TTP
data_source:
- Powershell Script Block Logging 4104
description: The following analytic detects potential data exfiltration using PowerShell's
  Invoke-RestMethod. It leverages PowerShell Script Block Logging to identify scripts
  that attempt to upload files via HTTP POST requests. This activity is significant
  as it may indicate an attacker is exfiltrating sensitive data, such as desktop screenshots
  or files, to an external command and control (C2) server. If confirmed malicious,
  this could lead to data breaches, loss of sensitive information, and further compromise
  of the affected systems. Immediate investigation is recommended to determine the
  intent and scope of the activity.
search: '`powershell` EventCode=4104 ScriptBlockText = "*Invoke-RestMethod *" AND
  ScriptBlockText = "* -Uri *" AND ScriptBlockText = "* -Method *" AND ScriptBlockText
  = "* Post *" AND ScriptBlockText = "* -InFile *" | stats count min(_time) as firstTime
  max(_time) as lastTime by EventCode ScriptBlockText Computer UserID | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_exfiltration_over_c2_via_invoke_restmethod_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: False positives should be limited. Filter as needed.
references:
- https://twitter.com/_CERT_UA/status/1620781684257091584
- https://cert.gov.ua/article/3761104
tags:
  analytic_story:
  - Winter Vivern
  asset_type: Endpoint
  confidence: 70
  impact: 70
  message: A PowerShell script on $Computer$ is attempting to transfer files to a
    remote URL.
  mitre_attack_id:
  - T1041
  observable:
  - name: Computer
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - ScriptBlockText
  - Computer
  - UserID
  - EventCode
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/winter-vivern/pwh_exfiltration/windows-powershell-xml.log
    source: XmlWinEventLog:Microsoft-Windows-PowerShell/Operational
    sourcetype: xmlwineventlog
