author: Teoderick Contreras, Bhavin Patel, Splunk
datamodel:
- Endpoint.Filesystem
- Endpoint.Processes
date: '2022-02-25'
description: This analytic is to look for suspicious file creation in the critical
  folder like "System32\Drivers" folder without file extension. This artifacts was
  seen in latest hermeticwiper where it drops its driver component in Driver Directory
  both the compressed(without file extension) and the actual driver component (with
  .sys file extension). This TTP is really a good indication that a host might be
  compromised by this destructive malware that wipes the boot sector of the system.
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the Filesystem responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Filesystem` node.
id: 0dbcac64-963c-11ec-bf04-acde48001122
known_false_positives: Unknown at this point
name: Windows File Without Extension In Critical Folder
references:
- https://blog.talosintelligence.com/2022/02/threat-advisory-hermeticwiper.html
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Filesystem
  where Filesystem.file_path IN ("*\\System32\\drivers\\*", "*\\syswow64\\drivers\\*")
  by _time span=5m Filesystem.dest Filesystem.user Filesystem.file_name Filesystem.file_path
  Filesystem.process_guid Filesystem.file_create_time | `drop_dm_object_name(Filesystem)`
  | rex field="file_name" "\.(?<extension>[^\.]*$)" | where isnull(extension) | join
  process_guid [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  by _time span=5m Processes.process_name Processes.dest Processes.process_guid Processes.user
  | `drop_dm_object_name(Processes)`] | stats count min(_time) as firstTime max(_time)
  as lastTime by dest process_name process_guid file_name file_path file_create_time
  user | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_file_without_extension_in_critical_folder_filter`'
tags:
  analytic_story:
  - Data Destruction
  - Hermetic Wiper
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Persistence
  - Privilege Escalation
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/hermetic_wiper/sysmon.log
  impact: 90
  kill_chain_phases:
  - Exploitation
  message: Driver file with out file extension drop in $file_path$ in $dest$
  mitre_attack_id:
  - T1485
  nist:
  - DE.CM
  observable:
  - name: user
    role:
    - Victim
    type: User
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Filesystem.dest
  - Endpoint.Filesystem.file_create_time
  - Endpoint.Filesystem.file_name
  - Endpoint.Filesystem.file_path
  - Endpoint.Filesystem.process_guid
  - Endpoint.Filesystem.user
  - Endpoint.Processes.dest
  - Endpoint.Processes.process_guid
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 90
  security_domain: endpoint
type: TTP
version: 1
