author: Michael Haag, Splunk
datamodel:
- Endpoint.Processes
date: '2022-02-07'
description: The following analytic identifies Schtasks.exe creating a new task to
  start and run as an elevated user - SYSTEM. This is commonly used by adversaries
  to spawn a process in an elevated state.
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
id: 41a0e58e-884c-11ec-9976-acde48001122
known_false_positives: False positives will be limited to legitimate applications
  creating a task to run as SYSTEM. Filter as needed based on parent process, or modify
  the query to have world writeable paths to restrict it.
name: Windows Schtasks Create Run As System
references:
- https://pentestlab.blog/2019/11/04/persistence-scheduled-tasks/
- https://www.ired.team/offensive-security/persistence/t1053-schtask
- https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_schtasks` Processes.process="*/create
  *" AND Processes.process="*/ru *" AND Processes.process="*system*" by Processes.dest
  Processes.user Processes.parent_process_name Processes.process_name Processes.original_file_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_schtasks_create_run_as_system_filter`'
tags:
  analytic_story:
  - Windows Persistence Techniques
  confidence: 60
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1053.005/schtask_system/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: An $process_name$ was created on endpoint $dest$ attempting to spawn as
    SYSTEM.
  mitre_attack_id:
  - T1053.005
  - T1053
  observable:
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: process_name
    role:
    - Child Process
    type: Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.original_file_name
  - Endpoint.Processes.parent_process_id
  - Endpoint.Processes.parent_process_name
  - Endpoint.Processes.process
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.user
  - _time
  risk_score: 48
  security_domain: endpoint
type: TTP
version: 1
