name: Windows Impair Defense Set Win Defender Smart Screen Level To Warn
id: cc2a3425-2703-47e7-818f-3dca1b0bc56f
version: 2
date: '2024-05-21'
author: Teoderick Contreras, Splunk
status: production
type: TTP
data_source:
- Sysmon EventID 12 
- Sysmon EventID 13
description: The following analytic detects modifications to the Windows registry
  that set the Windows Defender SmartScreen level to "warn." This detection leverages
  data from the Endpoint.Registry data model, specifically monitoring changes to the
  ShellSmartScreenLevel registry value. This activity is significant because altering
  SmartScreen settings to "warn" can reduce immediate suspicion from users, allowing
  potentially malicious executables to run with just a warning prompt. If confirmed
  malicious, this could enable attackers to execute harmful files, increasing the
  risk of successful malware deployment and subsequent system compromise.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path= "*\\Microsoft\\Windows\\System\\ShellSmartScreenLevel"
  Registry.registry_value_data="Warn" by Registry.registry_key_name Registry.user
  Registry.registry_path Registry.registry_value_data Registry.action Registry.dest
  | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_impair_defense_set_win_defender_smart_screen_level_to_warn_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node.
known_false_positives: It is unusual to turn this feature off a Windows system since
  it is a default security control, although it is not rare for some policies to disable
  it. Although no false positives have been identified, use the provided filter macro
  to tune the search.
references:
- https://x.com/malmoeb/status/1742604217989415386?s=20
- https://github.com/undergroundwires/privacy.sexy
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Windows Registry Abuse
  asset_type: Endpoint
  confidence: 70
  impact: 70
  message: Windows Defender SmartScreen Level to Warn on $dest$.
  mitre_attack_id:
  - T1562.001
  - T1562
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 49
  required_fields:
  - _time
  - Registry.registry_key_name
  - Registry.registry_value_name
  - Registry.dest
  - Registry.user
  - Registry.registry_path
  - Registry.action
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1562.001/disable-windows-security-defender-features/windefender-bypas-2-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
