name: Windows InProcServer32 New Outlook Form
id: fedb49c4-4bd7-4d42-8fd9-f8c8538c73c4
version: 2
date: '2024-05-25'
author: Michael Haag, Splunk
data_source:
- Sysmon EventID 13
type: Anomaly
status: production
description: The following analytic detects the creation or modification of registry
  keys associated with new Outlook form installations, potentially indicating exploitation
  of CVE-2024-21378. It leverages data from the Endpoint.Registry datamodel, focusing
  on registry paths involving InProcServer32 keys linked to Outlook forms. This activity
  is significant as it may signify an attempt to achieve authenticated remote code
  execution via malicious form objects. If confirmed malicious, this could allow an
  attacker to create arbitrary files and registry keys, leading to remote code execution
  and potential full system compromise.
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  where Registry.registry_path="*\\InProcServer32\\*" Registry.registry_value_data=*\\FORMS\\*
  by Registry.registry_path Registry.registry_key_name Registry.registry_value_name
  Registry.registry_value_data Registry.dest Registry.process_guid Registry.user |
  `drop_dm_object_name(Registry)` |`security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_inprocserver32_new_outlook_form_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node.
known_false_positives: False positives are possible if the organization adds new forms
  to Outlook via an automated method. Filter by name or path to reduce false positives.
references:
- https://www.netspi.com/blog/technical/red-team-operations/microsoft-outlook-remote-code-execution-cve-2024-21378/
tags:
  analytic_story:
  - Outlook RCE CVE-2024-21378
  cve:
  - CVE-2024-21378
  asset_type: Endpoint
  confidence: 70
  impact: 70
  message: A registry key associated with a new Outlook form installation was created
    or modified. This could indicate exploitation of CVE-2024-21378 on $dest$.
  mitre_attack_id:
  - T1566
  - T1112
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.registry_value_name
  - Registry.registry_value_data
  - Registry.dest
  - Registry.process_guid
  - Registry.user
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1566/cve-2024-21378/inprocserver32_windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
