name: Windows Powershell Import Applocker Policy
id: 102af98d-0ca3-4aa4-98d6-7ab2b98b955a
version: 1
date: '2022-06-30'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: The following analytic is to identify the imports of Windows PowerShell
  Applocker commandlets. This technique was seen in Azorult malware where it drops
  an xml Applocker policy that will deny several AV product and then loaded using
  PowerShell Applocker commandlet.
data_source:
- Powershell Script Block Logging 4104
search: '`powershell` EventCode=4104 ScriptBlockText="*Import-Module Applocker*" ScriptBlockText="*Set-AppLockerPolicy
  *" ScriptBlockText="* -XMLPolicy *" | stats count min(_time) as firstTime max(_time)
  as lastTime by EventCode ScriptBlockText Computer UserID | rename Computer as dest | rename UserID as user | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_powershell_import_applocker_policy_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: administrators may execute this command that may cause some
  false positive.
references:
- https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
tags:
  analytic_story:
  - Azorult
  asset_type: Endpoint
  confidence: 70
  impact: 70
  message: A PowerShell script contains Import Applocker Policy command $ScriptBlockText$
    with EventCode $EventCode$ on host $dest$
  mitre_attack_id:
  - T1059.001
  - T1059
  - T1562.001
  - T1562
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - ScriptBlockText
  - Computer
  - EventCode
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059.001/import_applocker_policy/windows-powershell-xml2.log
    source: XmlWinEventLog:Microsoft-Windows-PowerShell/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
