name: Windows Group Policy Object Created
id: 23add2a8-ea22-4fd4-8bc0-8c0b822373a1
version: 1
date: '2023-03-27'
author: Mauricio Velazco
type: TTP
datamodel: []
description: UPDATE_DESCRIPTION
search: ' `wineventlog_security` EventCode=5137 OR (EventCode=5136 AttributeValue!="New Group Policy Object" AND (AttributeLDAPDisplayName=displayName OR AttributeLDAPDisplayName=gPCFileSysPath) ) ObjectClass=groupPolicyContainer
  | stats values(AttributeValue) as details values(SubjectUserSid) as User values(ObjectDN) as ObjectDN by ObjectGUID Computer
  | eval GPO_Name = mvindex(details, 0)
  | eval GPO_Path = mvindex(details, 1)
  | fields - details
  | `windows_group_policy_object_created_filter`'
how_to_implement: UPDATE_HOW_TO_IMPLEMENT
known_false_positives: UPDATE_KNOWN_FALSE_POSITIVES
references:
- https://attack.mitre.org/techniques/T1484/
- https://attack.mitre.org/techniques/T1484/001
- https://www.trustedsec.com/blog/weaponizing-group-policy-objects-access/
- https://adsecurity.org/?p=2716
tags:
  analytic_story:
  - Active Directory Privilege Escalation
  - Sneaky Active Directory Persistence Tricks
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Privilege Escalation
  - Stage:Persistence
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1484.001/group_policy_created/windows-security.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  - Installation
  - Actions on Objectives
  message: UPDATE message
  mitre_attack_id:
  - T1484
  - T1484.001
  - T1078.002
  nist:
  - DE.CM
  observable:
  - name: User
    type: User
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - EventCode
  - AttributeValue
  - AttributeLDAPDisplayName
  - ObjectClass
  - SubjectUserSid
  - ObjectDN
  - ObjectGUID
  - Computer
  risk_score: 40
  security_domain: endpoint
