name: Windows Common Language Runtime Loaded
id: aed3d140-5051-41d7-8fe9-af587700da4e
version: 1
date: '2023-02-23'
author: Mauricio Velazco, Splunk
type: TTP
datamodel: []
description: UPDATE_DESCRIPTION
search: ' `sysmon` EventCode=7 (ImageLoaded="*\\mscoreei.dll" OR ImageLoaded="*\\mscorlib.ni.dll" OR ImageLoaded="*\\amsi.dll") AND NOT (Image IN("C:\\Windows\\*", "C:\\Program File*", "%systemroot%\\*"))  
  | stats count min(_time) as firstTime max(_time) as lastTime by Image ImageLoaded Computer EventCode Signed ProcessId
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_common_language_runtime_loaded_filter`'
how_to_implement: UPDATE_HOW_TO_IMPLEMENT
known_false_positives: UPDATE_KNOWN_FALSE_POSITIVES
references:
- REFERENCE
tags:
  analytic_story:
  - UPDATE_STORY_NAME
  asset_type: UPDATE asset_type
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: UPDATE value between 1-100
  context:
  - Update context
  dataset:
  - UPDATE_DATASET_URL
  impact: UPDATE value between 1-100
  kill_chain_phases:
  - Weaponization
  - Exploitation
  - Installation
  - Command & Control
  message: UPDATE message
  mitre_attack_id:
  - T1003.002
  nist:
  - DE.CM
  observable:
  - name: UPDATE
    type: UPDATE
    role:
    - UPDATE
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - UPDATE
  risk_score: UPDATE (impact * confidence)/100
  security_domain: endpoint
