name: Windows InstallUtil Remote Network Connection
id: 4fbf9270-43da-11ec-9486-acde48001122
version: 2
date: '2022-03-16'
author: Michael Haag, Splunk
type: TTP
datamodel:
- Endpoint
description: 'The following analytic identifies the Windows InstallUtil.exe binary
  making a remote network connection. This technique may be used to download and execute
  code while bypassing application control. \

  When `InstallUtil.exe` is used in a malicous manner, the path to an executable on
  the filesystem is typically specified. Take note of the parent process. In a suspicious
  instance, this will be spawned from a non-standard process like `Cmd.exe`, `PowerShell.exe`
  or `Explorer.exe`. \

  If used by a developer, typically this will be found with multiple command-line
  switches/arguments and spawn from Visual Studio. \

  During triage review resulting network connections, file modifications, and parallel
  processes. Capture any artifacts and review further.'
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where `process_installutil` by _time span=1h  Processes.process_id Processes.process_name
  Processes.dest Processes.process_path Processes.process Processes.parent_process_name
  Processes.original_file_name | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | join  process_id [| tstats `security_content_summariesonly`
  count FROM datamodel=Network_Traffic.All_Traffic where All_Traffic.dest_port != 0 by All_Traffic.process_id
  All_Traffic.dest All_Traffic.dest_port | `drop_dm_object_name(All_Traffic)` | rename dest as C2 ]
  | table _time dest parent_process_name process_name process_path process process_id dest_port C2 
  | `windows_installutil_remote_network_connection_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` and `Ports` node.
  In addition, confirm the latest CIM App 4.20 or higher is installed and the latest
  TA for the endpoint product.
known_false_positives: Limited false positives should be present as InstallUtil is
  not typically used to download remote files. Filter as needed based on Developers
  requirements.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.004/T1218.004.md
tags:
  analytic_story:
  - Signed Binary Proxy Execution InstallUtil
  - Living Off The Land
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.004/atomic_red_team/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ generating a remote download.
  mitre_attack_id:
  - T1218.004
  - T1218
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  - Ports.process_guid
  - Ports.dest
  - Ports.dest_port
  risk_score: 80
  security_domain: endpoint
  asset_type: Endpoint
