name: Windows InstallUtil Credential Theft
id: ccfeddec-43ec-11ec-b494-acde48001122
version: 1
date: '2021-11-12'
author: Michael Haag, Splunk
type: TTP
datamodel:
- Endpoint
description: 'The following analytic identifies the Windows InstallUtil.exe binary
  loading `vaultcli.dll` and Samlib.dll`. This technique may be used to execute code
  to bypassing application control and capture credentials by utilizing a tool like
  MimiKatz. \

  When `InstallUtil.exe` is used in a malicous manner, the path to an executable on
  the filesystem is typically specified. Take note of the parent process. In a suspicious
  instance, this will be spawned from a non-standard process like `Cmd.exe`, `PowerShell.exe`
  or `Explorer.exe`. \

  If used by a developer, typically this will be found with multiple command-line
  switches/arguments and spawn from Visual Studio. \

  During triage review resulting network connections, file modifications, and parallel
  processes. Capture any artifacts and review further.'
search: '`sysmon` EventCode=7  process_name=installutil.exe ImageLoaded IN ("*\\samlib.dll",
  "*\\vaultcli.dll") | stats count min(_time) as firstTime max(_time) as lastTime
  by Computer, process_name, ImageLoaded, OriginalFileName, process_id | rename Computer
  as dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_installutil_credential_theft_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and module loads from your endpoints.
  If you are using Sysmon, you must have at least version 6.0.4 of the Sysmon TA.
known_false_positives: Typically this will not trigger as by it's very nature InstallUtil
  does not need credentials. Filter as needed.
references:
- https://gist.github.com/xorrior/bbac3919ca2aef8d924bdf3b16cce3d0
tags:
  analytic_story:
  - Signed Binary Proxy Execution InstallUtil
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1218.004/atomic_red_team/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ loading samlib.dll and vaultcli.dll to potentially
    capture credentials in memory.
  mitre_attack_id:
  - T1218.004
  - T1218
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 80
  security_domain: endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
  asset_type: Endpoint
