name: Windows Modify Registry Qakbot Binary Data Registry
id: 2e768497-04e0-4188-b800-70dd2be0e30d
version: 1
date: '2022-11-10'
author: Teoderick Contreras, Bhavin Patel, Splunk
status: production
type: Anomaly
description: The following analytic identifies a suspicious registry entry created
  by Qakbot malware as part of its malicious execution. This "Binary Data" Registry  was
  created by newly spawn explorer.exe where its malicious code is injected to it.
  The registry consist of 8 random registry value name with encrypted binary data
  on its registry value data. This anomaly detections can be a good pivot for possible
  Qakbot malware infection or other malware that uses registry to save or store there
  config or malicious code on the registry data stream.
data_source:
- Sysmon Event ID 13
search: '| tstats `security_content_summariesonly` count dc(registry_value_name) as
  registry_value_name_count FROM datamodel=Endpoint.Registry where Registry.registry_path="*\\SOFTWARE\\Microsoft\\*"
  AND Registry.registry_value_data = "Binary Data" by _time span=1m Registry.dest
  Registry.user Registry.registry_path Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid Registry.process_id Registry.registry_key_name | `drop_dm_object_name(Registry)`
  | rename process_guid as proc_guid | eval registry_key_name_len = len(registry_key_name)
  | eval registry_value_name_len = len(registry_value_name) | regex registry_value_name="^[0-9a-fA-F]{8}"
  | where registry_key_name_len < 80 AND registry_value_name_len == 8 | join proc_guid,
  _time [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  where Processes.process_name IN  ("explorer.exe", "wermgr.exe","dxdiag.exe", "OneDriveSetup.exe",
  "mobsync.exe", "msra.exe", "xwizard.exe") by _time span=1m Processes.process_id
  Processes.process_name Processes.process Processes.dest Processes.parent_process_name
  Processes.parent_process Processes.process_guid Processes.process_path | `drop_dm_object_name(Processes)`
  | rename process_guid as proc_guid | fields _time dest user parent_process_name
  parent_process process_name process_path process proc_guid registry_path registry_value_name
  registry_value_data process_id registry_key_name registry_value_name_count] | stats
  min(_time) as firstTime max(_time) as lastTime values(registry_value_name) as registry_value_name
  dc(registry_value_name) as registry_value_name_count by process_path registry_key_name
  registry_value_data proc_guid registry_key_name_len registry_value_name_len | where
  registry_value_name_count >= 5 | `windows_modify_registry_qakbot_binary_data_registry_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node. Also make sure
  that this registry was included in your config files ex. sysmon config to be monitored.
known_false_positives: unknown
references:
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/decrypting-qakbots-encrypted-registry-keys/
tags:
  analytic_story:
  - Qakbot
  asset_type: Endpoint
  confidence: 70
  impact: 70
  message: registry with binary data $registry_path$ created by $process_name$ in
    $dest$
  mitre_attack_id:
  - T1112
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - dest
  - user
  - parent_process_name
  - parent_process
  - process_name
  - process_path
  - process
  - proc_guid
  - registry_path
  - registry_value_name
  - registry_value_data
  - process_id
  - registry_key_name
  - registry_key_name_len
  - registry_value_name_len
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/qakbot/qbot2/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
