author: Michael Haag, Splunk
datamodel:
- Endpoint.Processes
date: '2022-01-24'
description: The following hunting analytic assists with identifying the proces execution
  of commonly used utilities from NirSoft. Potentially not adversary behavior, but
  worth identifying to know if the software is present and being used.
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
id: 5b2f4596-7d4c-11ec-88a7-acde48001122
known_false_positives: False positives may be present. Filtering may be required before
  setting to alert.
name: Windows NirSoft Utilities
references:
- https://www.cisa.gov/uscert/ncas/alerts/TA18-201A
- http://www.nirsoft.net/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Processes by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.original_file_name Processes.process_path
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name("Processes")`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `is_nirsoft_software`
  | `windows_nirsoft_utilities_filter`'
tags:
  analytic_story:
  - WhisperGate
  automated_detection_testing: passed
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1588.002/atomic_red_team/windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ by user $user$ related to NiRSoft software usage.
  mitre_attack_id:
  - T1588.002
  observable:
  - name: user
    role:
    - Victim
    type: User
  - name: dest
    role:
    - Victim
    type: Hostname
  - name: parent_process_name
    role:
    - Parent Process
    type: Parent Process
  - name: process_name
    role:
    - Child Process
    type: Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Endpoint.Processes.dest
  - Endpoint.Processes.original_file_name
  - Endpoint.Processes.parent_process
  - Endpoint.Processes.parent_process_id
  - Endpoint.Processes.process
  - Endpoint.Processes.process_id
  - Endpoint.Processes.process_name
  - Endpoint.Processes.process_path
  - Endpoint.Processes.user
  - _time
  risk_score: 80
  security_domain: endpoint
type: Hunting
version: 1
