name: Windows Service Creation Using Registry Entry
id: 25212358-948e-11ec-ad47-acde48001122
version: 3
date: '2023-04-27'
author: Steven Dick, Teoderick Contreras, Splunk
status: production
type: TTP
description: This analytic is to look for suspicious modification or creation of registry
  to have service entry. This technique is abused by adversaries or threat actor to
  persist, gain privileges in the machine or even lateral movement. This technique
  can be executed using reg.exe application or using windows API like for example
  the CrashOveride malware. This detection is a good indicator that a process is trying
  to create a service entry using registry ImagePath.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  WHERE (Registry.registry_path="*\\SYSTEM\\CurrentControlSet\\Services*" Registry.registry_value_name
  = ImagePath) BY _time span=1h Registry.registry_path Registry.registry_key_name
  Registry.registry_value_name Registry.registry_value_data Registry.process_guid
  | `drop_dm_object_name(Registry)` | where isnotnull(registry_value_data)
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_service_creation_using_registry_entry_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the registry value name, registry path, and registry value data from your
  endpoints. If you are using Sysmon, you must have at least version 2.0 of the offical
  Sysmon TA. https://splunkbase.splunk.com/app/5709
known_false_positives: Third party tools may used this technique to create services
  but not so common.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/36d49de4c8b00bf36054294b4a1fcbab3917d7c5/atomics/T1574.011/T1574.011.md
tags:
  analytic_story:
  - Active Directory Lateral Movement
  - Suspicious Windows Registry Activities
  - Windows Persistence Techniques
  - Windows Registry Abuse
  - Brute Ratel C4
  asset_type: Endpoint
  confidence: 80
  impact: 80
  message: A Windows Service was created on a endpoint from $dest$
  mitre_attack_id:
  - T1574.011
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.dest
  - Registry.registry_value_name
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.registry_value_data
  - Registry.process_guid
  risk_score: 64
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1574.011/change_registry_path_service/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
