name: Windows Command and Scripting Interpreter Hunting Path Traversal
id: d0026380-b3c4-4da0-ac8e-02790063ff6b
version: 2
date: '2024-05-15'
author: Teoderick Contreras, Michael Haag, Splunk
status: production
type: Hunting
description: The following analytic identifies path traversal command-line executions,
  leveraging data from Endpoint Detection and Response (EDR) agents. It detects patterns
  in command-line arguments indicative of path traversal techniques, such as multiple
  instances of "/..", "\..", or "\\..". This activity is significant as it often indicates
  attempts to evade defenses by executing malicious code, such as through msdt.exe.
  If confirmed malicious, this behavior could allow attackers to execute arbitrary
  code, potentially leading to system compromise, data exfiltration, or further lateral
  movement within the network.
data_source:
- Sysmon EventID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime FROM datamodel=Endpoint.Processes  by Processes.original_file_name Processes.process_id
  Processes.parent_process_id Processes.process_hash Processes.dest Processes.user
  Processes.parent_process_name Processes.process_name Processes.process | `drop_dm_object_name("Processes")`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | eval
  count_of_pattern1 = (mvcount(split(process,"/.."))-1) | eval count_of_pattern2 =
  (mvcount(split(process,"\.."))-1) | eval count_of_pattern3 = (mvcount(split(process,"\\.."))-1)
  | eval count_of_pattern4 = (mvcount(split(process,"//.."))-1) | search count_of_pattern1
  > 1 OR count_of_pattern2 > 1 OR count_of_pattern3 > 1 OR count_of_pattern4 > 1 |
  `windows_command_and_scripting_interpreter_hunting_path_traversal_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: false positive may vary depends on the score you want to check.
  The bigger number of path traversal string count the better.
references:
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Microsoft Support Diagnostic Tool Vulnerability CVE-2022-30190
  asset_type: Endpoint
  confidence: 60
  impact: 60
  message: A parent process $parent_process_name$ has spawned a child $process_name$
    with path traversal commandline $process$ in $dest$
  mitre_attack_id:
  - T1059
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 36
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1059/path_traversal/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
