name: Windows Proxy Via Netsh
id: c137bfe8-6036-4cff-b77b-4e327dd0a1cf
version: 1
date: '2023-05-25'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
data_source:
- Sysmon EventID 1
description: This search looks for processes launching netsh.exe for connection proxy.
  Netsh is a command-line scripting utility that allows you to, either locally or
  remotely, display or modify the network configuration of a computer that is currently
  running. Netsh can be used as a persistence proxy technique to execute a helper
  DLL when netsh.exe is executed. In this search, we are looking for processes spawned
  by netsh.exe and executing commands via the command line.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_netsh` Processes.process
  = "* portproxy *" Processes.process = "* v4tov4 *" by Processes.parent_process_name
  Processes.parent_process Processes.original_file_name Processes.process_name Processes.process
  Processes.user Processes.dest |`drop_dm_object_name("Processes")` |`security_content_ctime(firstTime)`
  |`security_content_ctime(lastTime)` | `windows_proxy_via_netsh_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Some VPN applications are known to launch netsh.exe. Outside
  of these instances, it is unusual for an executable to launch netsh.exe and run
  commands.
references:
- https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
tags:
  analytic_story:
  - Volt Typhoon
  asset_type: Endpoint
  atomic_guid:
  - b8223ea9-4be2-44a6-b50a-9657a3d4e72a
  confidence: 70
  impact: 70
  message: A process $process_name$ has launched netsh with command-line $process$
    on $dest$.
  mitre_attack_id:
  - T1090.001
  - T1090
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 49
  required_fields:
  - _time
  - Processes.process
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_name
  - Processes.user
  - Processes.dest
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1090.001/netsh_portproxy/volt_sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
