name: Windows ClipBoard Data via Get-ClipBoard
id: ab73289e-2246-4de0-a14b-67006c72a893
version: 1
date: '2022-11-30'
author: Teoderick Contreras, Splunk
status: production
type: Anomaly
description: The following analytic identifies a powershell script command to retrieve
  clipboard data. This technique was seen in several post exploitation tools like
  WINPEAS to steal sensitive information that was saved in clipboard. Using the Get-Clipboard
  powershell commandlet, adversaries can be able collect data stored in clipboard
  that might be a copied user name, password or other sensitive information.
data_source:
- Powershell 4104
search: '`powershell` EventCode=4104 ScriptBlockText = "*Get-Clipboard*" | stats count
  min(_time) as firstTime max(_time) as lastTime by EventCode ScriptBlockText Computer
  user_id | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_clipboard_data_via_get_clipboard_filter`'
how_to_implement: To successfully implement this analytic, you will need to enable
  PowerShell Script Block Logging on some or all endpoints. Additional setup here
  https://docs.splunk.com/Documentation/UBA/5.0.4.1/GetDataIn/AddPowerShell#Configure_module_logging_for_PowerShell.
known_false_positives: It is possible there will be false positives, filter as needed.
references:
- https://attack.mitre.org/techniques/T1115/
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
  analytic_story:
  - Windows Post-Exploitation
  - Prestige Ransomware
  asset_type: Endpoint
  confidence: 50
  impact: 50
  message: powershell script $ScriptBlockText$ execute Get-Clipboard commandlet in
    $dest$
  mitre_attack_id:
  - T1115
  observable:
  - name: Computer
    type: Hostname
    role:
    - Victim
  - name: UserID
    type: User
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - ScriptBlockText
  - Opcode
  - Computer
  - UserID
  - EventCode
  risk_score: 25
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/winpeas/powershell/windows-powershell-xml2.log
    source: XmlWinEventLog:Microsoft-Windows-PowerShell/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
