name: 'Windows Registry SIP Provider Modification'
id: 3b4e18cb-497f-4073-85ad-1ada7c2107ab
version: 2
date: '2024-05-28'
author: Michael Haag, Splunk
status: production
type: TTP
data_source:
- Sysmon EventID 12
- Sysmon EventID 13
description: 'The following analytic detects modifications to the Windows Registry
  SIP Provider. It leverages Sysmon Event ID 7 to monitor registry changes in paths
  and values related to Cryptography Providers and OID Encoding Types. This activity
  is significant as it may indicate an attempt to subvert trust controls, a common
  tactic for bypassing security measures and maintaining persistence. If confirmed
  malicious, an attacker could manipulate the system''s cryptographic functions, potentially
  leading to unauthorized access, data theft, or other damaging outcomes. Review the
  modified registry paths and concurrent processes to identify the attack source.'
search: '| tstats `security_content_summariesonly` count values(Registry.registry_key_name)
  as registry_key_name values(Registry.registry_path) as registry_path min(_time)
  as firstTime max(_time) as lastTime from datamodel=Endpoint.Registry where Registry.registry_path
  IN ("*\\SOFTWARE\\Microsoft\\Cryptography\\Providers\\*", "*\\SOFTWARE\\Microsoft\\Cryptography\\OID\\EncodingType*",
  "*\\SOFTWARE\\WOW6432Node\\Microsoft\\Cryptography\\Providers\\*", "*\\SOFTWARE\\WOW6432Node\\Microsoft\\Cryptography\\OID\\EncodingType*")
  Registry.registry_value_name IN ("Dll","$DLL") by Registry.dest , Registry.user
  Registry.registry_value_name, Registry.registry_value_data | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)` | `drop_dm_object_name(Registry)`| `windows_registry_sip_provider_modification_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: Be aware of potential false positives - legitimate applications
  may cause benign activities to be flagged.
references:
- https://attack.mitre.org/techniques/T1553/003/
- https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_sip_persistence.yml
- https://specterops.io/wp-content/uploads/sites/3/2022/06/SpecterOps_Subverting_Trust_in_Windows.pdf
- https://github.com/gtworek/PSBits/tree/master/SIP
- https://github.com/mattifestation/PoCSubjectInterfacePackage
- https://pentestlab.blog/2017/11/06/hijacking-digital-signatures/
tags:
  analytic_story:
  - Subvert Trust Controls SIP and Trust Provider Hijacking
  asset_type: Endpoint
  atomic_guid: []
  confidence: 80
  impact: 80
  message: Windows Registry SIP Provider Modification detected on $dest$.
  mitre_attack_id:
  - T1553.003
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 64
  required_fields:
  - Registry.dest
  - Registry.user
  - Registry.registry_value_name
  - Registry.registry_value_data
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1553.003/sip/sip_windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
