name: Windows Scheduled Task with Highest Privileges
id: 2f15e1a4-0fc2-49dd-919e-cbbe60699218
version: 1
date: '2023-01-26'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: 'The following analytic detects the creation of a new task with the highest
  execution privilege via Schtasks.exe. This tactic is often observed in AsyncRAT
  attacks, where the scheduled task is used for persistence and privilege escalation.
  AsyncRAT sets up a scheduled task with parameters ''/rl'' and ''highest'', triggering
  this technique. It''s a strong indicator of potential malware or adversaries seeking
  to establish persistence and escalate privileges through scheduled tasks. This is
  crucial for a Security Operations Center (SOC) as it can prevent unauthorized system
  access and potential data breaches.\

  The analytic works by monitoring logs for process name, parent process, and command-line
  executions. In the presence of the ''*/rl '' and '' highest *'' commands in a schtasks.exe
  process, an alert is triggered.'
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime  from datamodel=Endpoint.Processes where Processes.process_name = "schtasks.exe"
  Processes.process = "*/rl *" Processes.process = "* highest *" by Processes.process_name
  Processes.parent_process_name Processes.parent_process Processes.process Processes.process_guid
  Processes.dest Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_scheduled_task_with_highest_privileges_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: False positives may arise from legitimate applications that
  create tasks to run as SYSTEM. Therefore, it's recommended to adjust filters based
  on parent process or modify the query to include world writable paths for restriction.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat
tags:
  analytic_story:
  - AsyncRAT
  - Scheduled Tasks
  asset_type: Endpoint
  confidence: 80
  impact: 80
  message: a $process_name$ creating a schedule task $process$ with highest run level
    privilege in $dest$
  mitre_attack_id:
  - T1053
  - T1053.005
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 64
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1053.005/asyncrat_highest_priv_schtasks/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
