name: Windows Admon Group Policy Object Created
id: 69201633-30d9-48ef-b1b6-e680805f0582
version: 2
date: '2024-05-20'
author: Mauricio Velazco, Splunk
status: production
type: TTP
data_source:
- Windows Active Directory Admon
description: The following analytic detects the creation of a new Group Policy Object
  (GPO) using Splunk's Admon data. It identifies events where a new GPO is created,
  excluding default "New Group Policy Object" entries. Monitoring GPO creation is
  crucial as adversaries can exploit GPOs to escalate privileges or deploy malware
  across an Active Directory network. If confirmed malicious, this activity could
  allow attackers to control system configurations, deploy ransomware, or propagate
  malware, significantly compromising the network's security.
search: ' `admon` admonEventType=Update objectCategory="CN=Group-Policy-Container,CN=Schema,CN=Configuration,DC=*"
  versionNumber=0 displayName!="New Group Policy Object" | stats min(_time) as firstTime
  max(_time) as lastTime values(gPCFileSysPath) by dcName, displayName | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_admon_group_policy_object_created_filter`'
how_to_implement: To successfully implement this search, you need to be monitoring
  Active Directory logs using Admon. Details can be found here 
  https://docs.splunk.com/Documentation/SplunkCloud/8.1.2101/Data/MonitorActiveDirectory
known_false_positives: Group Policy Objects are created as part of regular administrative
  operations, filter as needed.
references:
- https://attack.mitre.org/techniques/T1484/
- https://attack.mitre.org/techniques/T1484/001
- https://www.trustedsec.com/blog/weaponizing-group-policy-objects-access/
- https://adsecurity.org/?p=2716
- https://docs.splunk.com/Documentation/SplunkCloud/8.1.2101/Data/MonitorActiveDirectory
tags:
  analytic_story:
  - Active Directory Privilege Escalation
  - Sneaky Active Directory Persistence Tricks
  asset_type: Endpoint
  confidence: 50
  impact: 100
  message: A new group policy objected was created on $dcName$
  mitre_attack_id:
  - T1484
  - T1484.001
  observable:
  - name: dcName
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - admonEventType
  - objectCategory
  - displayName
  - gPCFileSysPath
  - dcName
  risk_score: 50
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1484.001/group_policy_created/windows-admon.log
    source: ActiveDirectory
    sourcetype: ActiveDirectory
