name: Windows Remote Assistance Spawning Process
id: ced50492-8849-11ec-9f68-acde48001122
version: 1
date: '2022-02-07'
author: Michael Haag, Splunk
type: TTP
datamodel:
- Endpoint
description: The following analytic identifies the use of Microsoft Remote Assistance,
  msra.exe, spawning PowerShell.exe or cmd.exe as a child process. Msra.exe by default
  has no command-line arguments and typically spawns itself. It will generate a network
  connection to the remote system that is connected. This behavior is indicative of
  another process injected into msra.exe. Review the parent process or cross process
  events to identify source.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=msra.exe
  `windows_shells` by Processes.dest Processes.user Processes.parent_process_name
  Processes.process_name Processes.original_file_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_remote_assistance_spawning_process_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: False positives should be limited, filter as needed. Add additional
  shells as needed.
references:
- https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
tags:
  analytic_story:
  - Unusual Processes
  confidence: 100
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1055/msra/msra-windows-sysmon.log
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$, generating behavior not common with msra.exe.
  mitre_attack_id:
  - T1055
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 80
  security_domain: endpoint
  asset_type: Endpoint
  supported_tas:
  - Splunk_TA_microsoft_sysmon
