name: WinEvent Scheduled Task Created to Spawn Shell
id: 203ef0ea-9bd8-11eb-8201-acde48001122
version: 4
date: '2024-05-18'
author: Michael Haag, Splunk
status: production
type: TTP
datamodel: []
description: The following analytic detects the creation of scheduled tasks designed
  to execute commands using native Windows shells like PowerShell, Cmd, Wscript, or
  Cscript. It leverages Windows Security EventCode 4698 to identify when such tasks
  are registered. This activity is significant as it may indicate an attempt to establish
  persistence or execute malicious commands on a system. If confirmed malicious, this
  could allow an attacker to maintain access, execute arbitrary code, or escalate
  privileges, posing a severe threat to the environment.
data_source:
- Windows Event Log Security 4698
search: '`wineventlog_security` EventCode=4698 TaskContent IN ("*powershell.exe*",
  "*wscript.exe*", "*cscript.exe*", "*cmd.exe*", "*sh.exe*", "*ksh.exe*", "*zsh.exe*",
  "*bash.exe*", "*scrcons.exe*", "*pwsh.exe*") | stats count min(_time) as firstTime
  max(_time) as lastTime by Computer, TaskName, TaskContent | rename Computer as dest
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `winevent_scheduled_task_created_to_spawn_shell_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  Windows Security Event Logs with 4698 EventCode enabled. The Windows TA is also
  required.
known_false_positives: False positives are possible if legitimate applications are
  allowed to register tasks that call a shell to be spawned. Filter as needed based
  on command-line or processes that are used legitimately.
references:
- https://research.checkpoint.com/2021/irans-apt34-returns-with-an-updated-arsenal/
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4698
- https://redcanary.com/threat-detection-report/techniques/scheduled-task-job/
- https://docs.microsoft.com/en-us/windows/win32/taskschd/time-trigger-example--scripting-?redirectedfrom=MSDN
tags:
  analytic_story:
  - Ransomware
  - Windows Persistence Techniques
  - Winter Vivern
  - Ryuk Ransomware
  - CISA AA22-257A
  - Scheduled Tasks
  - Windows Error Reporting Service Elevation of Privilege Vulnerability
  asset_type: Endpoint
  confidence: 100
  impact: 70
  message: 'A windows scheduled task was created (task name=$TaskName$) on $dest$
    by the following command: $TaskContent$'
  mitre_attack_id:
  - T1053.005
  - T1053
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - dest
  - Task_Name
  - Description
  - Command
  risk_score: 70
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1053.005/winevent_scheduled_task_created_to_spawn_shell/windows-xml.log
    source: XmlWinEventLog:Security
    sourcetype: XmlWinEventLog

