name: WinRM Spawning a Process
id: a081836a-ba4d-11eb-8593-acde48001122
version: 2
date: '2024-05-20'
author: Drew Church, Michael Haag, Splunk
status: experimental
type: TTP
description: The following analytic detects suspicious processes spawned by WinRM
  (wsmprovhost.exe). It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on specific child processes like cmd.exe, powershell.exe, and others.
  This activity is significant as it may indicate exploitation attempts of vulnerabilities
  like CVE-2021-31166, which could lead to system instability or compromise. If confirmed
  malicious, attackers could execute arbitrary commands, escalate privileges, or maintain
  persistence, posing a severe threat to the environment.
data_source:
- Sysmon EventID 1
- Windows Event Log Security 4688
- CrowdStrike ProcessRollup2
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=wsmprovhost.exe
  Processes.process_name IN ("cmd.exe","sh.exe","bash.exe","powershell.exe","pwsh.exe","schtasks.exe","certutil.exe","whoami.exe","bitsadmin.exe","scp.exe")
  by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.process Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `winrm_spawning_a_process_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: Unknown. Add new processes or filter as needed. It is possible
  system management software may spawn processes from `wsmprovhost.exe`.
references:
- https://github.com/SigmaHQ/sigma/blob/9b7fb0c0f3af2e53ed483e29e0d0f88ccf1c08ca/rules/windows/process_access/win_susp_shell_spawn_from_winrm.yml
- https://www.zerodayinitiative.com/blog/2021/5/17/cve-2021-31166-a-wormable-code-execution-bug-in-httpsys
- https://github.com/0vercl0k/CVE-2021-31166/blob/main/cve-2021-31166.py
tags:
  analytic_story:
  - CISA AA23-347A
  - Rhysida Ransomware
  - Unusual Processes
  asset_type: Endpoint
  confidence: 50
  cve:
  - CVE-2021-31166
  impact: 50
  message: tbd
  mitre_attack_id:
  - T1190
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_id
  risk_score: 25
  security_domain: endpoint
