name: Winword Spawning Cmd
id: 6fcbaedc-a37b-11eb-956b-acde48001122
version: 1
date: '2021-04-22'
author: Michael Haag, Splunk
type: batch
datamodel:
- Endpoint
description: The following detection identifies Microsoft Word spawning `cmd.exe`.
  Typically, this is not common behavior and not default with winword.exe. Winword.exe
  will generally be found in the following path `C:\Program Files\Microsoft Office\root\Office16`
  (version will vary). Cmd.exe spawning from winword.exe is common for a spearphishing
  attachment and is actively used. Albeit, the command-line will indicate what is
  being executed. During triage, review parallel processes and identify any files
  that may have been written. It is possible that COM is utilized to trampoline the
  child process to `explorer.exe` or `wmiprvse.exe`.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=winword.exe
  Processes.process_name=cmd.exe by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `winword_spawning_cmd_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: False positives should be limited, but if any are present,
  filter as needed.
references:
- https://app.any.run/tasks/73af0064-a785-4c0a-ab0d-cde593fe16ef/
tags:
  analytic_story:
  - Spearphishing Attachments
  automated_detection_testing: passed
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1566.001/macro/windows-sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1566.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - process_name
  - process_id
  - parent_process_name
  - dest
  - user
  - parent_process_id
  security_domain: endpoint
  impact: 70
  confidence: 100
  # (impact * confidence)/100
  risk_score: 70
  context:
  - Source:Endpoint
  - Stage:Initial Access
  message: "$parent_process_name$ on $dest$ by $user$ launched command: $process_name$ which is very common in spearphishing attacks."
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Target
