name: Wmic NonInteractive App Uninstallation
id: bff0e7a0-317f-11ec-ab4e-acde48001122
version: 1
date: '2021-10-20'
author: Teoderick Contreras, Splunk
type: Hunting
datamodel:
- Endpoint
description: This analytic is to detect a suspicious wmic commandlined that uninstall
  application non interactively. This technique was seen in IceID to uninstall av
  products to the compromised host to bypassed and evade detections. This Hunting
  query maybe a good indicator that some process tries to uninstall application using
  wmic which is not a common behavior. This approach may seen in some script or third
  part appication to uninstall their application but it is a good thing to check what
  it uninstall and why.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=wmic.exe
  Processes.process="* product *" Processes.process="*where name*" Processes.process="*call
  uninstall*" Processes.process="*/nointeractive*" by Processes.dest Processes.user
  Processes.parent_process_name Processes.process_name Processes.process Processes.original_file_name
  Processes.process_id Processes.parent_process_id | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `wmic_noninteractive_app_uninstallation_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: third party application may use this approach to uninstall
  there application
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
tags:
  analytic_story:
  - IceID
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/disable_av/sysmon2.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: wmic $process$ with commandline $process$ in $dest$
  mitre_attack_id:
  - T1562.001
  - T1562
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  - name: process_name
    type: Process
    role:
    - Target
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 25
  security_domain: endpoint
  asset_type: Endpoint
