name: WSReset UAC Bypass
id: 8b5901bc-da63-11eb-be43-acde48001122
version: 1
date: '2021-07-01'
author: Teoderick Contreras, Splunk
type: batch
datamodel:
- Endpoint
description: This search is to detect a suspicious modification of registry related to UAC bypass. 
  This technique is to modify the registry in this detection, create a registry value with the path of the payload and run WSreset.exe to 
  bypass User account Control.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Registry 
  where Registry.registry_path= "*\\AppX82a6gwre4fdg3bt635tn5ctqjf8msdd2\\Shell\\open\\command*" (Registry.registry_key_name = "(Default)" OR Registry.registry_key_name = "DelegateExecute")
  by Registry.registry_path Registry.registry_key_name Registry.registry_value_name Registry.dest 
  | `drop_dm_object_name(Registry)` 
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `wsreset_uac_bypass_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Registry` node. Also make sure
  that this registry was included in your config files ex. sysmon config to be monitored.
known_false_positives: unknown
references:
- https://github.com/hfiref0x/UACME
- https://blog.morphisec.com/trickbot-uses-a-new-windows-10-uac-bypass
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1548.002
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Registry.registry_path
  - Registry.registry_key_name
  - Registry.registry_value_name
  - Registry.dest 
  security_domain: endpoint
  impact: 70
  confidence: 90 
  # (impact * confidence)/100
  risk_score: 63
  context:
  - Source:Endpoint
  - Stage:Persistence
  - Stage:Privilege Escalation
  - Stage:Defense Evasion
  - Scope:Incoming
  message: Suspicious modification of registry $registry_path$ with possible payload path $registry_value_name$ in $dest$
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548/uac_bypass/windows-sysmon.log
