name: WSReset UAC Bypass
id: 8b5901bc-da63-11eb-be43-acde48001122
version: 3
date: '2022-11-14'
author: Steven Dick, Teoderick Contreras, Splunk
status: production
type: TTP
description: This search is to detect a suspicious modification of registry related
  to UAC bypass. This technique is to modify the registry in this detection, create
  a registry value with the path of the payload and run WSreset.exe to bypass User
  account Control.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) AS firstTime max(_time)
  AS lastTime FROM datamodel=Endpoint.Processes BY _time span=1h Processes.user Processes.process_id
  Processes.process_name Processes.process Processes.process_path Processes.dest Processes.parent_process_name
  Processes.parent_process Processes.process_guid | `drop_dm_object_name(Processes)`
  | join process_guid [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry
  WHERE Registry.registry_path= "*\\AppX82a6gwre4fdg3bt635tn5ctqjf8msdd2\\Shell\\open\\command*"
  AND (Registry.registry_value_name = "(Default)" OR Registry.registry_value_name
  = "DelegateExecute") by _time span=1h Registry.dest Registry.user Registry.registry_path
  Registry.registry_key_name Registry.registry_value_name Registry.registry_value_data
  Registry.process_guid | `drop_dm_object_name(Registry)`] | fields firstTime lastTime
  dest user parent_process_name parent_process process_name process_path process registry_key_name
  registry_path registry_value_name registry_value_data process_guid | where isnotnull(registry_value_data)
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `wsreset_uac_bypass_filter`'
how_to_implement: The detection is based on data that originates from Endpoint Detection
  and Response (EDR) agents. These agents are designed to provide security-related
  telemetry from the endpoints where the agent is installed. To implement this search,
  you must ingest logs that contain the process GUID, process name, and parent process.
  Additionally, you must ingest complete command-line executions. These logs must
  be processed using the appropriate Splunk Technology Add-ons that are specific to
  the EDR product. The logs must also be mapped to the `Processes` node of the `Endpoint`
  data model. Use the Splunk Common Information Model (CIM) to normalize the field
  names and speed up the data modeling process.
known_false_positives: unknown
references:
- https://github.com/hfiref0x/UACME
- https://blog.morphisec.com/trickbot-uses-a-new-windows-10-uac-bypass
tags:
  analytic_story:
  - Windows Defense Evasion Tactics
  - Living Off The Land
  - Windows Registry Abuse
  asset_type: Endpoint
  confidence: 90
  impact: 70
  message: Suspicious modification of registry $registry_path$ with possible payload
    path $registry_value_name$ in $dest$
  mitre_attack_id:
  - T1548.002
  - T1548
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.user
  - Processes.dest
  - Processes.process_id
  - Processes.process_name
  - Processes.process
  - Processes.process_path
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_guid
  - Registry.dest
  - Registry.registry_value_name
  - Registry.registry_key_name
  - Registry.registry_path
  - Registry.registry_value_data
  - Registry.process_guid
  risk_score: 63
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1548/uac_bypass/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
