name: XSL Script Execution With WMIC
id: 004e32e2-146d-11ec-a83f-acde48001122
version: 1
date: '2021-09-13'
author: Teoderick Contreras, Splunk
type: TTP
datamodel:
- Endpoint
description: This search is to detect a suspicious wmic.exe process or renamed wmic process to execute malicious xsl file. 
  This technique was seen in FIN7 to execute its malicous jscript using the .xsl as the loader with the help of wmic.exe process.
  This TTP is really a good indicator for you to hunt further for FIN7 or other attacker that known to used this technique.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes 
  where Processes.process = "*os get*" Processes.process="*/format:*" Processes.process = "*.xsl*"
  by Processes.parent_process_name Processes.parent_process Processes.process_name Processes.process_id Processes.process Processes.dest Processes.user 
  | `drop_dm_object_name(Processes)` 
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `xsl_script_execution_with_wmic_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA. 
known_false_positives: unknown
references:
- https://www.fireeye.com/blog/threat-research/2018/08/fin7-pursuing-an-enigmatic-and-evasive-global-criminal-operation.html
- https://attack.mitre.org/groups/G0046/
tags:
  analytic_story:
  - FIN7
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/fin7/fin7_macro_js_1/sysmon.log
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1220
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.process_name
  - Processes.process_id
  - Processes.process
  - Processes.dest
  - Processes.user 
  security_domain: endpoint
  impact: 70
  confidence: 70
  # (impact * confidence)/100
  risk_score: 49
  context:
  - Source:Endpoint
  - Stage:Execution
  message: Process name $process_name$ with commandline $process$ to execute jscript in $dest$
  observable:
  - name: dest
    type: Endpoint
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  