name: Disable Defender BlockAtFirstSeen Feature
id: 2dd719ac-3021-11ec-97b4-acde48001122
version: 2
date: '2022-01-26'
author: Teoderick Contreras
status: production
type: TTP
description: This analytic is intended to detect a suspicious modification of the
  Windows registry to disable a Windows Defender feature. This technique is intended
  to bypass or evade detection from Windows Defender AV, specifically the BlockAtFirstSeen
  feature where it blocks suspicious files the first time seen on the host.
data_source:
- Sysmon Event ID 13
search: '| tstats `security_content_summariesonly` count from datamodel=Endpoint.Registry
  where Registry.registry_path = "*\\Microsoft\\Windows Defender\\SpyNet*" Registry.registry_value_name
  = DisableBlockAtFirstSeen Registry.registry_value_data = 0x00000001 by _time span=1h
  Registry.dest Registry.user Registry.registry_path Registry.registry_value_name
  Registry.registry_value_data Registry.process_guid | `drop_dm_object_name(Registry)`
  |rename process_guid as proc_guid |join proc_guid, _time [| tstats `security_content_summariesonly`
  count FROM datamodel=Endpoint.Processes by _time span=1h Processes.process_id Processes.process_name
  Processes.process Processes.dest Processes.parent_process_name Processes.parent_process
  Processes.process_guid | `drop_dm_object_name(Processes)` |rename process_guid as
  proc_guid | fields _time dest user parent_process_name parent_process process_name
  process_path process proc_guid registry_path registry_value_name registry_value_data]
  | table _time dest user parent_process_name parent_process process_name process_path
  process proc_guid registry_path registry_value_name registry_value_data | `disable_defender_blockatfirstseen_feature_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the registry value name, registry path, and registry value data from your
  endpoints. If you are using Sysmon, you must have at least version 6.0.4 of the
  Sysmon TA.
known_false_positives: admin or user may choose to disable windows defender product
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
tags:
  analytic_story:
  - IcedID
  - Windows Registry Abuse
  - Azorult
  asset_type: Endpoint
  atomic_guid: []
  confidence: 70
  drilldown_search: []
  impact: 70
  message: modified/added/deleted registry entry $registry_path$ in $dest$
  mitre_attack_id:
  - T1562.001
  - T1562
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 49
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/malware/icedid/disable_av/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
