name: Dump LSASS via comsvcs DLL
id: 8943b567-f14d-4ee8-a0bb-2121d4ce3184
version: 2
date: '2020-02-21'
author: Patrick Bareiss, Splunk
status: production
type: TTP
description: Detect the usage of comsvcs.dll for dumping the lsass process.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where `process_rundll32` Processes.process=*comsvcs.dll*
  Processes.process=*MiniDump* by Processes.user Processes.process_name Processes.original_file_name
  Processes.process Processes.dest | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `dump_lsass_via_comsvcs_dll_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: None identified.
references:
- https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/
- https://twitter.com/SBousseaden/status/1167417096374050817
tags:
  analytic_story:
  - Credential Dumping
  - Suspicious Rundll32 Activity
  - HAFNIUM Group
  - Living Off The Land
  - Industroyer2
  - CISA AA22-257A
  - CISA AA22-264A
  - Prestige Ransomware
  asset_type: Endpoint
  atomic_guid: []
  drilldown_search: []
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    accessing credentials using comsvcs.dll on endpoint $dest$ by user $user$.
  mitre_attack_id:
  - T1003.001
  - T1003
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 80
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1003.001/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
