name: ETW Registry Disabled
id: 8ed523ac-276b-11ec-ac39-acde48001122
version: 2
date: '2022-01-28'
author: Teoderick Contreras, Splunk
status: production
type: TTP
description: This analytic is to detect a registry modification to disable ETW feature
  of windows. This technique is to evade EDR appliance to evade detections and hide
  its execution from audit logs.
data_source:
- Sysmon Event ID 13
search: '| tstats `security_content_summariesonly` count  min(_time) as firstTime
  max(_time) as lastTime FROM datamodel=Endpoint.Registry where Registry.registry_path="*\\SOFTWARE\\Microsoft\\.NETFramework*"
  Registry.registry_value_name = ETWEnabled Registry.registry_value_data=0x00000000
  by _time span=1h Registry.dest Registry.user Registry.registry_path Registry.registry_value_name
  Registry.process_guid Registry.registry_key_name Registry.registry_value_data |
  `drop_dm_object_name(Registry)` |rename process_guid as proc_guid |join proc_guid,
  _time [| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
  by _time span=1h Processes.process_id Processes.process_name Processes.process Processes.dest
  Processes.parent_process_name Processes.parent_process Processes.process_guid |
  `drop_dm_object_name(Processes)` |rename process_guid as proc_guid | fields _time
  dest user parent_process_name parent_process process_name process_path process proc_guid
  registry_path registry_value_name registry_value_data registry_key_name] | table
  _time dest user parent_process_name parent_process process_name process_path process
  proc_guid registry_path registry_value_name registry_value_data registry_key_name
  | `etw_registry_disabled_filter`'
how_to_implement: To successfully implement this search, you must be ingesting data
  that records registry activity from your hosts to populate the endpoint data model
  in the registry node. This is typically populated via endpoint detection-and-response
  product, such as Carbon Black or endpoint data sources, such as Sysmon. The data
  used for this search is typically generated via logs that report reads and writes
  to the registry.
known_false_positives: unknown
references:
- https://gist.github.com/Cyb3rWard0g/a4a115fd3ab518a0e593525a379adee3
tags:
  analytic_story:
  - Windows Persistence Techniques
  - Windows Privilege Escalation
  - Windows Registry Abuse
  - Hermetic Wiper
  asset_type: Endpoint
  atomic_guid: []
  drilldown_search: []
  message: modified/added/deleted registry entry $Registry.registry_path$ in $dest$
  mitre_attack_id:
  - T1562.006
  - T1127
  - T1562
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 90
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1127/etw_disable/sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
