name: Office Product Spawning Windows Script Host
id: b3628a5b-8d02-42fa-a891-eebf2351cbe1
version: 1
date: '2022-09-26'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following analytic will identify a Windows Office Product spawning
  WScript.exe or CScript.exe. Tuning may be required based on legitimate application
  usage that may spawn scripts from an Office product.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name
  IN ("winword.exe","excel.exe","powerpnt.exe","mspub.exe","visio.exe") Processes.process_name
  IN ("wscript.exe", "cscript.exe") by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.original_file_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`|
  `security_content_ctime(lastTime)` | `office_product_spawning_windows_script_host_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: False positives may be present based on macro based approved
  documents in the organization. Filtering may be needed.
references:
- https://blog.cluster25.duskrise.com/2022/09/23/in-the-footsteps-of-the-fancy-bear-powerpoint-graphite/
- https://www.fortinet.com/blog/threat-research/latest-remcos-rat-phishing
tags:
  analytic_story:
  - Spearphishing Attachments
  - Remcos
  asset_type: Endpoint
  atomic_guid: []
  drilldown_search: []
  message: office parent process $parent_process_name$ will execute a suspicious child
    process $process_name$ on host $dest$.
  mitre_attack_id:
  - T1566
  - T1566.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 63
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1566.002/atomic_red_team/windows-sysmon.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
    update_timestamp: true
