name: Office Product Spawning Wmic
id: ffc236d6-a6c9-11eb-95f1-acde48001122
version: 3
date: '2021-09-16'
author: Michael Haag, Splunk
status: production
type: TTP
description: The following detection identifies the latest behavior utilized by Ursnif
  malware family. This detection identifies any Windows Office Product spawning `wmic.exe`.
  In malicious instances, the command-line of `wmic.exe` will contain `wmic process
  call create`. In addition, Threat Research has released a detection identifying
  the use of `wmic process call create` on the command-line of `wmic.exe`. In this
  instance, we narrow our detection down to the Office suite as a parent process.
  During triage, review all file modifications. Capture and analyze any artifacts
  on disk. The Office Product, or `wmic.exe` will have reached out to a remote destination,
  capture and block the IPs or domain. Review additional parallel processes for further
  activity.
data_source:
- Sysmon Event ID 1
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name
  IN ("winword.exe","excel.exe","powerpnt.exe","mspub.exe","visio.exe") `process_wmic`
  by Processes.dest Processes.user Processes.parent_process Processes.process_name
  Processes.original_file_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `office_product_spawning_wmic_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node. In addition,
  confirm the latest CIM App 4.20 or higher is installed and the latest TA for the
  endpoint product.
known_false_positives: No false positives known. Filter as needed.
references:
- https://app.any.run/tasks/fb894ab8-a966-4b72-920b-935f41756afd/
- https://attack.mitre.org/techniques/T1047/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1047/T1047.md
tags:
  analytic_story:
  - Spearphishing Attachments
  - FIN7
  asset_type: Endpoint
  atomic_guid: []
  confidence: 90
  drilldown_search: []
  impact: 70
  message: office parent process $parent_process_name$ will execute a suspicious child
    process $process_name$ with process id $process_id$ in host $dest$
  mitre_attack_id:
  - T1566
  - T1566.001
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  risk_score: 63
  security_domain: endpoint
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1566.001/macro/windows-sysmon_macros.log
    source: XmlWinEventLog:Microsoft-Windows-Sysmon/Operational
    sourcetype: xmlwineventlog
