name: Detect Remote Access Software Usage URL
id: 9296f515-073c-43a5-88ec-eda5a4626654
version: 2
date: '2024-05-09'
author: Steven Dick
status: production
type: Anomaly
description: The following analytic detects the execution of known remote access software
  within the environment. It leverages network logs mapped to the Web data model,
  identifying specific URLs and user agents associated with remote access tools like
  AnyDesk, GoToMyPC, LogMeIn, and TeamViewer. This activity is significant as adversaries
  often use these utilities to maintain unauthorized remote access. If confirmed malicious,
  this could allow attackers to control systems remotely, exfiltrate data, or further
  compromise the network, posing a severe security risk.
data_source:
- Palo Alto Network Threat
search: '| tstats count min(_time) as firstTime max(_time) as lastTime latest(Web.http_method)
  as http_method latest(Web.http_user_agent) as http_user_agent latest(Web.url) as
  url latest(Web.user) as user latest(Web.dest) as dest from datamodel=Web by Web.action
  Web.src Web.category Web.url_domain | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `drop_dm_object_name("Web")` | lookup remote_access_software remote_domain AS
  url_domain OUTPUT isutility, description as signature, comment_reference as desc,
  category | search isutility = True | `detect_remote_access_software_usage_url_filter`'
how_to_implement: The detection is based on data that originates from network logs.
  These logs must be processed using the appropriate Splunk Technology Add-ons that
  are specific to the network logs. The logs must also be mapped to the `Web` data
  model. Use the Splunk Common Information Model (CIM) to normalize the field names
  and speed up the data modeling process.
known_false_positives: It is possible that legitimate remote access software is used
  within the environment. Ensure that the lookup is reviewed and updated with any
  additional remote access software that is used within the environment.
references:
- https://attack.mitre.org/techniques/T1219/
- https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
- https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
tags:
  analytic_story:
  - Insider Threat
  - Command And Control
  - Ransomware
  asset_type: Network
  confidence: 50
  impact: 50
  message: A domain for a known remote access software $url_domain$ was contacted
    by $src$.
  mitre_attack_id:
  - T1219
  observable:
  - name: src
    type: Hostname
    role:
    - Victim
  - name: user
    type: User
    role:
    - Victim
  - name: url_domain
    type: Hostname
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Web.action
  - Web.src
  - Web.category
  - Web.url_domain
  risk_score: 25
  security_domain: network
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1219/screenconnect/screenconnect_palo.log
    source: screenconnect_palo
    sourcetype: pan:threat
