name: JetBrains TeamCity Authentication Bypass Suricata CVE-2024-27198
id: fbcc04c7-8a79-453c-b3a9-c232c423bdd3
version: 2
date: '2024-05-16'
author: Michael Haag, Splunk
data_source:
- Suricata
type: TTP
status: production
description: 'The following analytic detects attempts to exploit the CVE-2024-27198
  vulnerability in JetBrains TeamCity on-premises servers, which allows attackers
  to bypass authentication mechanisms. It leverages Suricata HTTP traffic logs to
  identify suspicious POST requests to the `/app/rest/users` and `/app/rest/users/id:1/tokens`
  endpoints. This activity is significant because it can lead to unauthorized administrative
  access, enabling attackers to gain full control over the TeamCity server, including
  projects, builds, agents, and artifacts. If confirmed malicious, this could result
  in severe security breaches and compromise the integrity of the development environment.'
search: '`suricata` ((http.url="*?jsp=*" AND http.url="*;.jsp*") http.status=200 http_method=POST)
  OR (http.url IN ("*jsp=/app/rest/users;.jsp","*?jsp=/app/rest/users;.jsp","*?jsp=.*/app/rest/users/id:*/tokens;*")
  http.status=200 http_method=POST ) | stats count min(_time) as firstTime max(_time)
  as lastTime by src, dest, http.http_user_agent, http.url, http.status,http_method
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| `jetbrains_teamcity_authentication_bypass_suricata_cve_2024_27198_filter`'
how_to_implement: The following detection relies on the Suricata TA and ensuring it
  is properly configured to monitor HTTP traffic. Modify the query for your environment
  and log sources as needed.
known_false_positives: False positives are not expected, as this detection is based
  on the presence of specific URI paths and HTTP methods that are indicative of the
  CVE-2024-27198 vulnerability exploitation. Monitor, filter and tune as needed based
  on organization log sources.
references:
- https://github.com/projectdiscovery/nuclei-templates/pull/9279/files
- https://www.rapid7.com/blog/post/2024/03/04/etr-cve-2024-27198-and-cve-2024-27199-jetbrains-teamcity-multiple-authentication-bypass-vulnerabilities-fixed/
- https://blog.jetbrains.com/teamcity/2024/03/teamcity-2023-11-4-is-out/
- https://blog.jetbrains.com/teamcity/2024/03/additional-critical-security-issues-affecting-teamcity-on-premises-cve-2024-27198-and-cve-2024-27199-update-to-2023-11-4-now/
tags:
  analytic_story:
  - JetBrains TeamCity Vulnerabilities
  asset_type: Web Server
  confidence: 90
  impact: 90
  message: Possible JetBrains TeamCity Authentication Bypass Attempt against $dest$
    from $src$.
  mitre_attack_id:
  - T1190
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: src
    type: IP Address
    role:
    - Attacker
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - src
  - dest
  - http.http_user_agent
  - http.url
  - http.status
  - http_method
  risk_score: 81
  security_domain: network
  cve:
  - CVE-2024-27198
tests:
- name: True Positive Test
  attack_data:
  - data: 
      https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1190/jetbrains/teamcity_cve_2024_27198.log
    sourcetype: suricata
    source: suricata
