name: Log4Shell JNDI Payload Injection with Outbound Connection
id: 69afee44-5c91-11ec-bf1f-497c9a704a72
version: 1
date: '2021-12-13'
author: Jose Hernandez
type: Anomaly
datamodel:
- Network_Traffic
- Web
description: CVE-2021-44228 Log4Shell payloads can be injected via various methods,
  but on of the most common vectors injection is via Web calls. Many of the vulnerable
  java web applications that are using log4j have a web component to them are specially
  targets of this injection, specifically projects like Apache Struts, Flink, Druid,
  and Solr. The exploit is triggered by a LDAP lookup function in the log4j package,
  its invocation is similar to `${jndi:ldap://PAYLOAD_INJECTED}`, when executed against
  vulnerable web applications the invocation can be seen in various part of web logs.
  Specifically it has been successfully exploited via headers like X-Forwarded-For,
  User-Agent, Referer, and X-Api-Version. In this detection we match the invocation
  function with a network connection to a malicious ip address.
search: '| from datamodel Web.Web | rex field=_raw max_match=0 "[jJnNdDiI]{4}(\:|\%3A|\/|\%2F)(?<proto>\w+)(\:\/\/|\%3A\%2F\%2F)(\$\{.*?\}(\.)?)?(?<affected_host>[a-zA-Z0-9\.\-\_\$]+)"
  | join affected_host type=inner [| tstats `security_content_summariesonly` count
  min(_time) as firstTime max(_time) as lastTime from datamodel=Network_Traffic.All_Traffic
  by All_Traffic.dest | `drop_dm_object_name(All_Traffic)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | rename dest AS affected_host] | fillnull
  | stats count by action, category, dest, dest_port, http_content_type, http_method,
  http_referrer, http_user_agent, site, src, url, url_domain, user | `log4shell_jndi_payload_injection_with_outbound_connection_filter`'
how_to_implement: This detection requires the Web datamodel to be populated from a
  supported Technology Add-On like Splunk for Apache or Splunk for Nginx.
known_false_positives: If there is a vulnerablility scannner looking for log4shells
  this will trigger, otherwise likely to have low false positives.
references:
- https://www.lunasec.io/docs/blog/log4j-zero-day/
tags:
  analytic_story:
  - Log4Shell CVE-2021-44228
  asset_type: Endpoint
  cis20:
  - CIS 3
  - CIS 5
  - CIS 16
  confidence: 30
  context:
  - Source:Application Log
  - Stage:Execution
  cve:
  - CVE-2021-44228
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1190/log4j_proxy_logs/log4j_proxy_logs.log
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1190/log4j_network_logs/log4j_network_logs.log
  impact: 50
  kill_chain_phases:
  - Exploitation
  message: CVE-2021-44228 Log4Shell triggered for host $dest$
  mitre_attack_id:
  - T1190
  nist:
  - DE.CM
  observable:
  - name: user
    type: User
    role:
    - Victim
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - action
  - category
  - dest
  - dest_port
  - http_content_type
  - http_method
  - http_referrer
  - http_user_agent
  - site
  - src
  - url
  - url_domain
  - user
  risk_score: 15
  security_domain: threat
