name: Log4Shell JNDI Payload Injection with Outbound Connection
id: 69afee44-5c91-11ec-bf1f-497c9a704a72
version: 1
date: '2021-12-13'
author: Jose Hernandez
type: Anomaly
datamodel:
- Network_Traffic
- Web
description: 
	UPDATE_DESCRIPTION
	WHAT IS THIS?
	WHAT DOES IT LOOK LIKE?
	HOW DO YOU TRIAGE IT?
search: '| from datamodel Web.Web | rex field=_raw max_match=0 "[jJnNdDiI]{4}(\:|\%3A|\/|\%2F)(?<proto>\w+)(\:\/\/|\%3A\%2F\%2F)(\$\{.*?\}(\.)?)?(?<affected_host>[a-zA-Z0-9\.\-\_\$]+)" | join affected_host type=inner [| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Network_Traffic.All_Traffic by All_Traffic.dest | `drop_dm_object_name(All_Traffic)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | rename dest AS affected_host] | `log4shell_jndi_payload_injection_with_outbound_connection_filter`'
how_to_implement: UPDATE_HOW_TO_IMPLEMENT
known_false_positives: UPDATE_KNOWN_FALSE_POSITIVES
references:
-  
tags:
  analytic_story:
  - UPDATE_STORY_NAME
  dataset:
  - UPDATE_DATASET_URL
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1190
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  security_domain: threat
  impact: 
  confidence: 
  # (impact * confidence)/100
  risk_score: 
  context:
  message: 
  observable:
  nist:
  -
  cis20:
  -