name: VMware Workspace ONE Freemarker Server-side Template Injection
id: 9e5726fe-8fde-460e-bd74-cddcf6c86113
version: 1
date: '2022-05-19'
author: Michael Haag, Splunk
status: production
type: Anomaly
description: The following analytic identifies the server side template injection
  related to CVE-2022-22954. Based on the scanning activity across the internet and
  proof of concept code available the template injection occurs at catalog-portal/ui/oauth/verify?error=&deviceudid=.
  Upon triage, review parallel processes and VMware logs. Following the deviceudid=
  may be a command to be executed. Capture any file creates and review modified files
  on disk.
data_source: 
- Palo Alto Network Threat
search: '| tstats count from datamodel=Web where Web.http_method IN ("GET") Web.url="*/catalog-portal/ui/oauth/verify?error=&deviceudid=*"
  AND Web.url="*freemarker.template.utility.Execute*" by Web.http_user_agent Web.http_method,
  Web.url,Web.url_length Web.src, Web.dest sourcetype | `drop_dm_object_name("Web")`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `vmware_workspace_one_freemarker_server_side_template_injection_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  web or proxy logs, or ensure it is being filled by a proxy like device, into the
  Web Datamodel. For additional filtering, allow list private IP space or restrict
  by known good.
known_false_positives: False positives may be present if the activity is blocked or
  was not successful. Filter known vulnerablity scanners. Filter as needed.
references:
- https://www.cisa.gov/uscert/ncas/alerts/aa22-138b
- https://github.com/wvu/metasploit-framework/blob/master/modules/exploits/linux/http/vmware_workspace_one_access_cve_2022_22954.rb
- https://github.com/sherlocksecurity/VMware-CVE-2022-22954
- https://www.vmware.com/security/advisories/VMSA-2022-0011.html
- https://attackerkb.com/topics/BDXyTqY1ld/cve-2022-22954/rapid7-analysis
tags:
  analytic_story:
  - VMware Server Side Injection and Privilege Escalation
  asset_type: Web Server
  confidence: 70
  cve:
  - CVE-2022-22954
  impact: 70
  message: An attempt to exploit a VMware Server Side Injection CVE-2022-22954 on
    $dest$ has occurred.
  mitre_attack_id:
  - T1190
  - T1133
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - Web.http_method
  - Web.url
  - Web.url_length
  - Web.src
  - Web.dest
  - Web.http_user_agent
  risk_score: 49
  security_domain: network
tests:
- name: True Positive Test
  attack_data:
  - data: https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1190/vmware/vmware_scanning_pan_threat.log
    source: pan:threat
    sourcetype: pan:threat
    update_timestamp: true
