author: Rico Valdez, Splunk
date: '2020-03-16'
description: This search looks for child processes of spoolsv.exe. This activity is
  associated with a POC privilege-escalation exploit associated with CVE-2018-8440.
  Spoolsv.exe is the process associated with the Print Spooler service in Windows
  and typically runs as SYSTEM.
how_to_implement: You must be ingesting endpoint data that tracks process activity,
  including parent-child relationships from your endpoints to populate the Endpoint
  data model in the Processes node. The command-line arguments are mapped to the "process"
  field in the Endpoint data model. Update the `children_of_spoolsv_filter` macro
  to filter out legitimate child processes spawned by spoolsv.exe.
id: aa0c4aeb-5b18-41c4-8c07-f1442d7599df
known_false_positives: Some legitimate printer-related processes may show up as children
  of spoolsv.exe. You should confirm that any activity as legitimate and may be added
  as exclusions in the search.
name: Child Processes of Spoolsv exe
references: []
search: '| tstats `security_content_summariesonly` count values(Processes.process_name)
  as process_name values(Processes.process) as process min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=spoolsv.exe
  AND Processes.process_name!=regsvr32.exe by Processes.dest Processes.parent_process
  Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `child_processes_of_spoolsv_exe_filter` '
tags:
  analytics_story:
  - Windows Privilege Escalation
  asset_type: Endpoint
  cis20:
  - CIS 5
  - CIS 8
  kill_chain_phases:
  - Exploitation
  mitre_attack_id:
  - T1068
  nist:
  - PR.AC
  - PR.PT
  - DE.CM
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  security_domain: endpoint
type: ESCU
version: 3
