name: MSBuild spawn via Office Product
id: b547c2e1-ebcd-4b4b-b81b-9a4cf24c2c4d
version: 1
date: '2021-02-04'
description: The following analytic identifies a Windows Office product spawning msbuild.exe.
  Adversaries may embed their script code in an Office macro that upon loading it spawns msbuild.exe
  as a child process. Typically, the script code will be written to disk by the Office product.
  During investigation, review file write events along with other child process events that may occur. 
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
type: ESCU
references:
- https://lolbas-project.github.io/lolbas/Binaries/Msbuild/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1127.001/T1127.001.md
- https://twitter.com/h2jazi/status/1356791338029744129?s=20
- https://www.vmray.com/analyses/503523ffbb01/report/overview.html
- https://github.com/infosecn1nja/MaliciousMacroMSBuild
author: Michael Haag, Splunk
search: '| tstats `security_content_summariesonly` count values(Processes.process_name)
  as process_name values(Processes.process) as process min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name IN
  (winword.exe, excel.exe, powerpnt.exe, mspub.exe, visio.exe) Processes.process_name=msbuild.exe
  by Processes.dest Processes.parent_process_name Processes.parent_process Processes.user | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`| `msbuild_spawn_via_office_product_filter`'
known_false_positives: This is unlikely to produce false positives, but if it occurs, filter as needed.
tags:
  analytics_story:
  - Trusted Developer Utilities Proxy Execution MSBuild
mitre_attack_id:
  - T1127.001
  kill_chain_phases:
  - Exploitation
  cis20:
  - CIS 8
  nist:
  - PR.PT
  - DE.CM
  security_domain: endpoint
  asset_type: Endpoint
  dataset:
  - https://media.githubusercontent.com/media/splunk/attack_data/master/datasets/attack_techniques/T1127.001/windows-sysmon.log
