name: Suspicious Curl Network Connection
id: 3f613dc0-21f2-4063-93b1-5d3c15eef22f
version: 1
date: '2021-02-22'
author: Michael Haag, Splunk
type: batch
datamodel:
- Endpoint
description: The following analytic identifies the use of a curl contacting suspicious
  remote domains to checkin to command and control servers or download further implants.
  In the context of Silver Sparrow, curl is identified contacting s3.amazonaws.com.
  This particular behavior is common with MacOS adware-malicious software.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.process_name=curl
  Processes.process=s3.amazonaws.com by Processes.dest Processes.user Processes.parent_process
  Processes.process_name Processes.process Processes.process_id Processes.parent_process_id
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `suspicious_curl_network_connection_filter`'
how_to_implement: To successfully implement this search you need to be ingesting information
  on process that include the name of the process responsible for the changes from
  your endpoints into the `Endpoint` datamodel in the `Processes` node.
known_false_positives: Unknown. Filter as needed.
references:
- https://redcanary.com/blog/clipping-silver-sparrows-wings/
- https://marcosantadev.com/manage-plist-files-plistbuddy/
tags:
  analytic_story:
  - Silver Sparrow
  - Ingress Tool Transfer
  asset_type: Endpoint
  dataset: []
  kill_chain_phases:
  - Actions on Objectives
  mitre_attack_id:
  - T1105
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.process_name
  - Processes.process
  - Processes.dest
  - Processes.user
  - Processes.parent_process
  - Processes.process_id
  - Processes.parent_process_id
  security_domain: endpoint
