name: Windows Java Spawning Shells
id: 28c81306-5c47-11ec-bfea-acde48001122
version: 1
date: '2021-12-13'
author: Michael Haag, Splunk
type: TTP
datamodel:
- Endpoint
description: The following analytic identifies the process name of java.exe and w3wp.exe
  spawning a Windows shell. This is potentially indicative of exploitation of the
  Java application and may be related to current event CVE-2021-44228 (Log4Shell).
  The shells included in the macro are "cmd.exe", "powershell.exe". Upon triage, review
  parallel processes and command-line arguments to determine legitimacy.
search: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_name=java.exe
  OR Processes.parent_process_name=w3wp.exe `windows_shells` by Processes.dest Processes.user
  Processes.parent_process_name Processes.process_name Processes.process Processes.process_id
  Processes.parent_process_id | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_java_spawning_shells_filter`'
how_to_implement: To successfully implement this search, you need to be ingesting
  logs with the process name, parent process, and command-line executions from your
  endpoints. Restrict the analytic to publicly facing endpoints to reduce false positives.
  Add any additional identified web application process name to the query. Add any
  further Windows process names to the macro (ex. LOLBins) to further expand this
  query.
known_false_positives: Filtering may be required on internal developer build systems
  or classify assets as web facing and restrict the analytic based on that.
references:
- https://blog.netlab.360.com/ten-families-of-malicious-samples-are-spreading-using-the-log4j2-vulnerability-now/
- https://gist.github.com/olafhartong/916ebc673ba066537740164f7e7e1d72
tags:
  analytic_story:
  - Log4Shell CVE-2021-44228
  asset_type: Endpoint
  confidence: 50
  context:
  - Source:Endpoint
  - Stage:Defense Evasion
  cve:
  - CVE-2021-44228
  dataset: []
  impact: 80
  kill_chain_phases:
  - Exploitation
  message: An instance of $parent_process_name$ spawning $process_name$ was identified
    on endpoint $dest$ spawning a Windows shell, potentially indicative of exploitation.
  mitre_attack_id:
  - T1190
  observable:
  - name: dest
    type: Hostname
    role:
    - Victim
  - name: parent_process_name
    type: Process
    role:
    - Parent Process
  - name: process_name
    type: Process
    role:
    - Child Process
  product:
  - Splunk Enterprise
  - Splunk Enterprise Security
  - Splunk Cloud
  required_fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
  risk_score: 40
  security_domain: endpoint
